Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/m33.h
// THIS HEADER FILE IS AUTOMATICALLY GENERATED -- DO NOT EDIT

/**
 * Copyright (c) 2024 Raspberry Pi Ltd.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
// =============================================================================
// Register block : M33
// Version        : 1
// Bus type       : apb
// Description    : TEAL registers accessible through the debug interface
// =============================================================================
#ifndef _HARDWARE_REGS_M33_H
#define _HARDWARE_REGS_M33_H
// =============================================================================
// Register    : M33_ITM_STIM0
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM0_OFFSET _u(0x00000000)
#define M33_ITM_STIM0_BITS   _u(0xffffffff)
#define M33_ITM_STIM0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM0_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM0_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM0_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM0_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM0_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM0_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM1
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM1_OFFSET _u(0x00000004)
#define M33_ITM_STIM1_BITS   _u(0xffffffff)
#define M33_ITM_STIM1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM1_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM1_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM1_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM1_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM1_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM1_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM2
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM2_OFFSET _u(0x00000008)
#define M33_ITM_STIM2_BITS   _u(0xffffffff)
#define M33_ITM_STIM2_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM2_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM2_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM2_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM2_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM2_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM2_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM3
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM3_OFFSET _u(0x0000000c)
#define M33_ITM_STIM3_BITS   _u(0xffffffff)
#define M33_ITM_STIM3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM3_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM3_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM3_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM3_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM3_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM3_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM4
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM4_OFFSET _u(0x00000010)
#define M33_ITM_STIM4_BITS   _u(0xffffffff)
#define M33_ITM_STIM4_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM4_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM4_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM4_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM4_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM4_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM4_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM5
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM5_OFFSET _u(0x00000014)
#define M33_ITM_STIM5_BITS   _u(0xffffffff)
#define M33_ITM_STIM5_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM5_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM5_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM5_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM5_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM5_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM5_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM6
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM6_OFFSET _u(0x00000018)
#define M33_ITM_STIM6_BITS   _u(0xffffffff)
#define M33_ITM_STIM6_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM6_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM6_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM6_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM6_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM6_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM6_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM7
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM7_OFFSET _u(0x0000001c)
#define M33_ITM_STIM7_BITS   _u(0xffffffff)
#define M33_ITM_STIM7_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM7_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM7_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM7_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM7_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM7_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM7_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM8
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM8_OFFSET _u(0x00000020)
#define M33_ITM_STIM8_BITS   _u(0xffffffff)
#define M33_ITM_STIM8_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM8_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM8_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM8_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM8_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM8_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM8_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM9
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM9_OFFSET _u(0x00000024)
#define M33_ITM_STIM9_BITS   _u(0xffffffff)
#define M33_ITM_STIM9_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM9_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM9_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM9_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM9_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM9_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM9_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM10
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM10_OFFSET _u(0x00000028)
#define M33_ITM_STIM10_BITS   _u(0xffffffff)
#define M33_ITM_STIM10_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM10_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM10_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM10_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM10_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM10_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM10_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM11
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM11_OFFSET _u(0x0000002c)
#define M33_ITM_STIM11_BITS   _u(0xffffffff)
#define M33_ITM_STIM11_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM11_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM11_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM11_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM11_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM11_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM11_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM12
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM12_OFFSET _u(0x00000030)
#define M33_ITM_STIM12_BITS   _u(0xffffffff)
#define M33_ITM_STIM12_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM12_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM12_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM12_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM12_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM12_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM12_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM13
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM13_OFFSET _u(0x00000034)
#define M33_ITM_STIM13_BITS   _u(0xffffffff)
#define M33_ITM_STIM13_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM13_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM13_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM13_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM13_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM13_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM13_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM14
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM14_OFFSET _u(0x00000038)
#define M33_ITM_STIM14_BITS   _u(0xffffffff)
#define M33_ITM_STIM14_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM14_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM14_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM14_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM14_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM14_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM14_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM15
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM15_OFFSET _u(0x0000003c)
#define M33_ITM_STIM15_BITS   _u(0xffffffff)
#define M33_ITM_STIM15_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM15_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM15_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM15_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM15_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM15_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM15_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM16
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM16_OFFSET _u(0x00000040)
#define M33_ITM_STIM16_BITS   _u(0xffffffff)
#define M33_ITM_STIM16_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM16_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM16_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM16_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM16_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM16_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM16_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM17
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM17_OFFSET _u(0x00000044)
#define M33_ITM_STIM17_BITS   _u(0xffffffff)
#define M33_ITM_STIM17_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM17_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM17_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM17_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM17_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM17_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM17_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM18
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM18_OFFSET _u(0x00000048)
#define M33_ITM_STIM18_BITS   _u(0xffffffff)
#define M33_ITM_STIM18_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM18_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM18_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM18_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM18_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM18_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM18_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM19
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM19_OFFSET _u(0x0000004c)
#define M33_ITM_STIM19_BITS   _u(0xffffffff)
#define M33_ITM_STIM19_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM19_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM19_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM19_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM19_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM19_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM19_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM20
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM20_OFFSET _u(0x00000050)
#define M33_ITM_STIM20_BITS   _u(0xffffffff)
#define M33_ITM_STIM20_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM20_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM20_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM20_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM20_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM20_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM20_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM21
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM21_OFFSET _u(0x00000054)
#define M33_ITM_STIM21_BITS   _u(0xffffffff)
#define M33_ITM_STIM21_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM21_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM21_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM21_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM21_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM21_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM21_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM22
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM22_OFFSET _u(0x00000058)
#define M33_ITM_STIM22_BITS   _u(0xffffffff)
#define M33_ITM_STIM22_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM22_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM22_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM22_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM22_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM22_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM22_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM23
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM23_OFFSET _u(0x0000005c)
#define M33_ITM_STIM23_BITS   _u(0xffffffff)
#define M33_ITM_STIM23_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM23_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM23_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM23_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM23_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM23_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM23_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM24
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM24_OFFSET _u(0x00000060)
#define M33_ITM_STIM24_BITS   _u(0xffffffff)
#define M33_ITM_STIM24_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM24_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM24_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM24_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM24_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM24_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM24_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM25
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM25_OFFSET _u(0x00000064)
#define M33_ITM_STIM25_BITS   _u(0xffffffff)
#define M33_ITM_STIM25_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM25_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM25_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM25_STIMULUS_BITS   _u(0xffffffff)
