Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/m33.h
#define M33_ITM_STIM25_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM25_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM25_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM26
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM26_OFFSET _u(0x00000068)
#define M33_ITM_STIM26_BITS   _u(0xffffffff)
#define M33_ITM_STIM26_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM26_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM26_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM26_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM26_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM26_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM26_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM27
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM27_OFFSET _u(0x0000006c)
#define M33_ITM_STIM27_BITS   _u(0xffffffff)
#define M33_ITM_STIM27_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM27_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM27_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM27_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM27_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM27_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM27_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM28
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM28_OFFSET _u(0x00000070)
#define M33_ITM_STIM28_BITS   _u(0xffffffff)
#define M33_ITM_STIM28_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM28_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM28_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM28_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM28_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM28_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM28_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM29
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM29_OFFSET _u(0x00000074)
#define M33_ITM_STIM29_BITS   _u(0xffffffff)
#define M33_ITM_STIM29_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM29_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM29_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM29_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM29_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM29_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM29_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM30
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM30_OFFSET _u(0x00000078)
#define M33_ITM_STIM30_BITS   _u(0xffffffff)
#define M33_ITM_STIM30_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM30_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM30_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM30_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM30_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM30_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM30_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_STIM31
// Description : Provides the interface for generating Instrumentation packets
#define M33_ITM_STIM31_OFFSET _u(0x0000007c)
#define M33_ITM_STIM31_BITS   _u(0xffffffff)
#define M33_ITM_STIM31_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_STIM31_STIMULUS
// Description : Data to write to the Stimulus Port FIFO, for forwarding as an
//               Instrumentation packet. The size of write access determines the
//               type of Instrumentation packet generated.
#define M33_ITM_STIM31_STIMULUS_RESET  _u(0x00000000)
#define M33_ITM_STIM31_STIMULUS_BITS   _u(0xffffffff)
#define M33_ITM_STIM31_STIMULUS_MSB    _u(31)
#define M33_ITM_STIM31_STIMULUS_LSB    _u(0)
#define M33_ITM_STIM31_STIMULUS_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_TER0
// Description : Provide an individual enable bit for each ITM_STIM register
#define M33_ITM_TER0_OFFSET _u(0x00000e00)
#define M33_ITM_TER0_BITS   _u(0xffffffff)
#define M33_ITM_TER0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_TER0_STIMENA
// Description : For STIMENA[m] in ITM_TER*n, controls whether ITM_STIM(32*n +
//               m) is enabled
#define M33_ITM_TER0_STIMENA_RESET  _u(0x00000000)
#define M33_ITM_TER0_STIMENA_BITS   _u(0xffffffff)
#define M33_ITM_TER0_STIMENA_MSB    _u(31)
#define M33_ITM_TER0_STIMENA_LSB    _u(0)
#define M33_ITM_TER0_STIMENA_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_TPR
// Description : Controls which stimulus ports can be accessed by unprivileged
//               code
#define M33_ITM_TPR_OFFSET _u(0x00000e40)
#define M33_ITM_TPR_BITS   _u(0x0000000f)
#define M33_ITM_TPR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_TPR_PRIVMASK
// Description : Bit mask to enable tracing on ITM stimulus ports
#define M33_ITM_TPR_PRIVMASK_RESET  _u(0x0)
#define M33_ITM_TPR_PRIVMASK_BITS   _u(0x0000000f)
#define M33_ITM_TPR_PRIVMASK_MSB    _u(3)
#define M33_ITM_TPR_PRIVMASK_LSB    _u(0)
#define M33_ITM_TPR_PRIVMASK_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_TCR
// Description : Configures and controls transfers through the ITM interface
#define M33_ITM_TCR_OFFSET _u(0x00000e80)
#define M33_ITM_TCR_BITS   _u(0x00ff0f3f)
#define M33_ITM_TCR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_TCR_BUSY
// Description : Indicates whether the ITM is currently processing events
#define M33_ITM_TCR_BUSY_RESET  _u(0x0)
#define M33_ITM_TCR_BUSY_BITS   _u(0x00800000)
#define M33_ITM_TCR_BUSY_MSB    _u(23)
#define M33_ITM_TCR_BUSY_LSB    _u(23)
#define M33_ITM_TCR_BUSY_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ITM_TCR_TRACEBUSID
// Description : Identifier for multi-source trace stream formatting. If multi-
//               source trace is in use, the debugger must write a unique non-
//               zero trace ID value to this field
#define M33_ITM_TCR_TRACEBUSID_RESET  _u(0x00)
#define M33_ITM_TCR_TRACEBUSID_BITS   _u(0x007f0000)
#define M33_ITM_TCR_TRACEBUSID_MSB    _u(22)
#define M33_ITM_TCR_TRACEBUSID_LSB    _u(16)
#define M33_ITM_TCR_TRACEBUSID_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_ITM_TCR_GTSFREQ
// Description : Defines how often the ITM generates a global timestamp, based
//               on the global timestamp clock frequency, or disables generation
//               of global timestamps
#define M33_ITM_TCR_GTSFREQ_RESET  _u(0x0)
#define M33_ITM_TCR_GTSFREQ_BITS   _u(0x00000c00)
#define M33_ITM_TCR_GTSFREQ_MSB    _u(11)
#define M33_ITM_TCR_GTSFREQ_LSB    _u(10)
#define M33_ITM_TCR_GTSFREQ_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_ITM_TCR_TSPRESCALE
// Description : Local timestamp prescaler, used with the trace packet reference
//               clock
#define M33_ITM_TCR_TSPRESCALE_RESET  _u(0x0)
#define M33_ITM_TCR_TSPRESCALE_BITS   _u(0x00000300)
#define M33_ITM_TCR_TSPRESCALE_MSB    _u(9)
#define M33_ITM_TCR_TSPRESCALE_LSB    _u(8)
#define M33_ITM_TCR_TSPRESCALE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_ITM_TCR_STALLENA
// Description : Stall the PE to guarantee delivery of Data Trace packets.
#define M33_ITM_TCR_STALLENA_RESET  _u(0x0)
#define M33_ITM_TCR_STALLENA_BITS   _u(0x00000020)
#define M33_ITM_TCR_STALLENA_MSB    _u(5)
#define M33_ITM_TCR_STALLENA_LSB    _u(5)
#define M33_ITM_TCR_STALLENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_ITM_TCR_SWOENA
// Description : Enables asynchronous clocking of the timestamp counter
#define M33_ITM_TCR_SWOENA_RESET  _u(0x0)
#define M33_ITM_TCR_SWOENA_BITS   _u(0x00000010)
#define M33_ITM_TCR_SWOENA_MSB    _u(4)
#define M33_ITM_TCR_SWOENA_LSB    _u(4)
#define M33_ITM_TCR_SWOENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_ITM_TCR_TXENA
// Description : Enables forwarding of hardware event packet from the DWT unit
//               to the ITM for output to the TPIU
#define M33_ITM_TCR_TXENA_RESET  _u(0x0)
#define M33_ITM_TCR_TXENA_BITS   _u(0x00000008)
#define M33_ITM_TCR_TXENA_MSB    _u(3)
#define M33_ITM_TCR_TXENA_LSB    _u(3)
#define M33_ITM_TCR_TXENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_ITM_TCR_SYNCENA
// Description : Enables Synchronization packet transmission for a synchronous
//               TPIU
#define M33_ITM_TCR_SYNCENA_RESET  _u(0x0)
#define M33_ITM_TCR_SYNCENA_BITS   _u(0x00000004)
#define M33_ITM_TCR_SYNCENA_MSB    _u(2)
#define M33_ITM_TCR_SYNCENA_LSB    _u(2)
#define M33_ITM_TCR_SYNCENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_ITM_TCR_TSENA
// Description : Enables Local timestamp generation
#define M33_ITM_TCR_TSENA_RESET  _u(0x0)
#define M33_ITM_TCR_TSENA_BITS   _u(0x00000002)
#define M33_ITM_TCR_TSENA_MSB    _u(1)
#define M33_ITM_TCR_TSENA_LSB    _u(1)
#define M33_ITM_TCR_TSENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_ITM_TCR_ITMENA
// Description : Enables the ITM
#define M33_ITM_TCR_ITMENA_RESET  _u(0x0)
#define M33_ITM_TCR_ITMENA_BITS   _u(0x00000001)
#define M33_ITM_TCR_ITMENA_MSB    _u(0)
#define M33_ITM_TCR_ITMENA_LSB    _u(0)
#define M33_ITM_TCR_ITMENA_ACCESS "RW"
// =============================================================================
// Register    : M33_INT_ATREADY
// Description : Integration Mode: Read ATB Ready
#define M33_INT_ATREADY_OFFSET _u(0x00000ef0)
#define M33_INT_ATREADY_BITS   _u(0x00000003)
#define M33_INT_ATREADY_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_INT_ATREADY_AFVALID
// Description : A read of this bit returns the value of AFVALID
#define M33_INT_ATREADY_AFVALID_RESET  _u(0x0)
#define M33_INT_ATREADY_AFVALID_BITS   _u(0x00000002)
#define M33_INT_ATREADY_AFVALID_MSB    _u(1)
#define M33_INT_ATREADY_AFVALID_LSB    _u(1)
#define M33_INT_ATREADY_AFVALID_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_INT_ATREADY_ATREADY
// Description : A read of this bit returns the value of ATREADY
#define M33_INT_ATREADY_ATREADY_RESET  _u(0x0)
#define M33_INT_ATREADY_ATREADY_BITS   _u(0x00000001)
#define M33_INT_ATREADY_ATREADY_MSB    _u(0)
#define M33_INT_ATREADY_ATREADY_LSB    _u(0)
#define M33_INT_ATREADY_ATREADY_ACCESS "RO"
// =============================================================================
// Register    : M33_INT_ATVALID
// Description : Integration Mode: Write ATB Valid
#define M33_INT_ATVALID_OFFSET _u(0x00000ef8)
#define M33_INT_ATVALID_BITS   _u(0x00000003)
#define M33_INT_ATVALID_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_INT_ATVALID_AFREADY
// Description : A write to this bit gives the value of AFREADY
#define M33_INT_ATVALID_AFREADY_RESET  _u(0x0)
#define M33_INT_ATVALID_AFREADY_BITS   _u(0x00000002)
#define M33_INT_ATVALID_AFREADY_MSB    _u(1)
#define M33_INT_ATVALID_AFREADY_LSB    _u(1)
#define M33_INT_ATVALID_AFREADY_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_INT_ATVALID_ATREADY
// Description : A write to this bit gives the value of ATVALID
#define M33_INT_ATVALID_ATREADY_RESET  _u(0x0)
#define M33_INT_ATVALID_ATREADY_BITS   _u(0x00000001)
#define M33_INT_ATVALID_ATREADY_MSB    _u(0)
#define M33_INT_ATVALID_ATREADY_LSB    _u(0)
#define M33_INT_ATVALID_ATREADY_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_ITCTRL
// Description : Integration Mode Control Register
#define M33_ITM_ITCTRL_OFFSET _u(0x00000f00)
#define M33_ITM_ITCTRL_BITS   _u(0x00000001)
#define M33_ITM_ITCTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_ITCTRL_IME
// Description : Integration mode enable bit - The possible values are:  0 - The
//               trace unit is not in integration mode. 1 - The trace unit is in
//               integration mode. This mode enables: A debug agent to perform
//               topology detection. SoC test software to perform integration
//               testing.
#define M33_ITM_ITCTRL_IME_RESET  _u(0x0)
#define M33_ITM_ITCTRL_IME_BITS   _u(0x00000001)
#define M33_ITM_ITCTRL_IME_MSB    _u(0)
#define M33_ITM_ITCTRL_IME_LSB    _u(0)
#define M33_ITM_ITCTRL_IME_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_DEVARCH
// Description : Provides CoreSight discovery information for the ITM
#define M33_ITM_DEVARCH_OFFSET _u(0x00000fbc)
#define M33_ITM_DEVARCH_BITS   _u(0xffffffff)
#define M33_ITM_DEVARCH_RESET  _u(0x47701a01)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_DEVARCH_ARCHITECT
// Description : Defines the architect of the component. Bits [31:28] are the
//               JEP106 continuation code (JEP106 bank ID, minus 1) and bits
//               [27:21] are the JEP106 ID code.
#define M33_ITM_DEVARCH_ARCHITECT_RESET  _u(0x23b)
#define M33_ITM_DEVARCH_ARCHITECT_BITS   _u(0xffe00000)
#define M33_ITM_DEVARCH_ARCHITECT_MSB    _u(31)
#define M33_ITM_DEVARCH_ARCHITECT_LSB    _u(21)
#define M33_ITM_DEVARCH_ARCHITECT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ITM_DEVARCH_PRESENT
// Description : Defines that the DEVARCH register is present
#define M33_ITM_DEVARCH_PRESENT_RESET  _u(0x1)
#define M33_ITM_DEVARCH_PRESENT_BITS   _u(0x00100000)
#define M33_ITM_DEVARCH_PRESENT_MSB    _u(20)
#define M33_ITM_DEVARCH_PRESENT_LSB    _u(20)
#define M33_ITM_DEVARCH_PRESENT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ITM_DEVARCH_REVISION
// Description : Defines the architecture revision of the component
#define M33_ITM_DEVARCH_REVISION_RESET  _u(0x0)
#define M33_ITM_DEVARCH_REVISION_BITS   _u(0x000f0000)
#define M33_ITM_DEVARCH_REVISION_MSB    _u(19)
#define M33_ITM_DEVARCH_REVISION_LSB    _u(16)
#define M33_ITM_DEVARCH_REVISION_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ITM_DEVARCH_ARCHVER
// Description : Defines the architecture version of the component
#define M33_ITM_DEVARCH_ARCHVER_RESET  _u(0x1)
#define M33_ITM_DEVARCH_ARCHVER_BITS   _u(0x0000f000)
#define M33_ITM_DEVARCH_ARCHVER_MSB    _u(15)
#define M33_ITM_DEVARCH_ARCHVER_LSB    _u(12)
#define M33_ITM_DEVARCH_ARCHVER_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ITM_DEVARCH_ARCHPART
// Description : Defines the architecture of the component
#define M33_ITM_DEVARCH_ARCHPART_RESET  _u(0xa01)
#define M33_ITM_DEVARCH_ARCHPART_BITS   _u(0x00000fff)
#define M33_ITM_DEVARCH_ARCHPART_MSB    _u(11)
#define M33_ITM_DEVARCH_ARCHPART_LSB    _u(0)
#define M33_ITM_DEVARCH_ARCHPART_ACCESS "RO"
// =============================================================================
// Register    : M33_ITM_DEVTYPE
// Description : Provides CoreSight discovery information for the ITM
#define M33_ITM_DEVTYPE_OFFSET _u(0x00000fcc)
#define M33_ITM_DEVTYPE_BITS   _u(0x000000ff)
#define M33_ITM_DEVTYPE_RESET  _u(0x00000043)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_DEVTYPE_SUB
// Description : Component sub-type
#define M33_ITM_DEVTYPE_SUB_RESET  _u(0x4)
#define M33_ITM_DEVTYPE_SUB_BITS   _u(0x000000f0)
#define M33_ITM_DEVTYPE_SUB_MSB    _u(7)
#define M33_ITM_DEVTYPE_SUB_LSB    _u(4)
#define M33_ITM_DEVTYPE_SUB_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ITM_DEVTYPE_MAJOR
// Description : Component major type
#define M33_ITM_DEVTYPE_MAJOR_RESET  _u(0x3)
#define M33_ITM_DEVTYPE_MAJOR_BITS   _u(0x0000000f)
#define M33_ITM_DEVTYPE_MAJOR_MSB    _u(3)
#define M33_ITM_DEVTYPE_MAJOR_LSB    _u(0)
#define M33_ITM_DEVTYPE_MAJOR_ACCESS "RO"
// =============================================================================
// Register    : M33_ITM_PIDR4
// Description : Provides CoreSight discovery information for the ITM
#define M33_ITM_PIDR4_OFFSET _u(0x00000fd0)
#define M33_ITM_PIDR4_BITS   _u(0x000000ff)
#define M33_ITM_PIDR4_RESET  _u(0x00000004)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_PIDR4_SIZE
// Description : See CoreSight Architecture Specification
#define M33_ITM_PIDR4_SIZE_RESET  _u(0x0)
#define M33_ITM_PIDR4_SIZE_BITS   _u(0x000000f0)
#define M33_ITM_PIDR4_SIZE_MSB    _u(7)
#define M33_ITM_PIDR4_SIZE_LSB    _u(4)
#define M33_ITM_PIDR4_SIZE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ITM_PIDR4_DES_2
// Description : See CoreSight Architecture Specification
#define M33_ITM_PIDR4_DES_2_RESET  _u(0x4)
#define M33_ITM_PIDR4_DES_2_BITS   _u(0x0000000f)
#define M33_ITM_PIDR4_DES_2_MSB    _u(3)
#define M33_ITM_PIDR4_DES_2_LSB    _u(0)
#define M33_ITM_PIDR4_DES_2_ACCESS "RO"
// =============================================================================
// Register    : M33_ITM_PIDR5
// Description : Provides CoreSight discovery information for the ITM
#define M33_ITM_PIDR5_OFFSET _u(0x00000fd4)
#define M33_ITM_PIDR5_BITS   _u(0x00000000)
#define M33_ITM_PIDR5_RESET  _u(0x00000000)
#define M33_ITM_PIDR5_MSB    _u(31)
#define M33_ITM_PIDR5_LSB    _u(0)
#define M33_ITM_PIDR5_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_PIDR6
// Description : Provides CoreSight discovery information for the ITM
#define M33_ITM_PIDR6_OFFSET _u(0x00000fd8)
#define M33_ITM_PIDR6_BITS   _u(0x00000000)
#define M33_ITM_PIDR6_RESET  _u(0x00000000)
#define M33_ITM_PIDR6_MSB    _u(31)
#define M33_ITM_PIDR6_LSB    _u(0)
#define M33_ITM_PIDR6_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_PIDR7
// Description : Provides CoreSight discovery information for the ITM
#define M33_ITM_PIDR7_OFFSET _u(0x00000fdc)
#define M33_ITM_PIDR7_BITS   _u(0x00000000)
#define M33_ITM_PIDR7_RESET  _u(0x00000000)
#define M33_ITM_PIDR7_MSB    _u(31)
#define M33_ITM_PIDR7_LSB    _u(0)
#define M33_ITM_PIDR7_ACCESS "RW"
// =============================================================================
// Register    : M33_ITM_PIDR0
// Description : Provides CoreSight discovery information for the ITM
#define M33_ITM_PIDR0_OFFSET _u(0x00000fe0)
#define M33_ITM_PIDR0_BITS   _u(0x000000ff)
#define M33_ITM_PIDR0_RESET  _u(0x00000021)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_PIDR0_PART_0
// Description : See CoreSight Architecture Specification
#define M33_ITM_PIDR0_PART_0_RESET  _u(0x21)
#define M33_ITM_PIDR0_PART_0_BITS   _u(0x000000ff)
#define M33_ITM_PIDR0_PART_0_MSB    _u(7)
#define M33_ITM_PIDR0_PART_0_LSB    _u(0)
#define M33_ITM_PIDR0_PART_0_ACCESS "RO"
// =============================================================================
// Register    : M33_ITM_PIDR1
// Description : Provides CoreSight discovery information for the ITM
#define M33_ITM_PIDR1_OFFSET _u(0x00000fe4)
#define M33_ITM_PIDR1_BITS   _u(0x000000ff)
#define M33_ITM_PIDR1_RESET  _u(0x000000bd)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_PIDR1_DES_0
// Description : See CoreSight Architecture Specification
#define M33_ITM_PIDR1_DES_0_RESET  _u(0xb)
#define M33_ITM_PIDR1_DES_0_BITS   _u(0x000000f0)
#define M33_ITM_PIDR1_DES_0_MSB    _u(7)
#define M33_ITM_PIDR1_DES_0_LSB    _u(4)
#define M33_ITM_PIDR1_DES_0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ITM_PIDR1_PART_1
// Description : See CoreSight Architecture Specification
#define M33_ITM_PIDR1_PART_1_RESET  _u(0xd)
#define M33_ITM_PIDR1_PART_1_BITS   _u(0x0000000f)
#define M33_ITM_PIDR1_PART_1_MSB    _u(3)
#define M33_ITM_PIDR1_PART_1_LSB    _u(0)
#define M33_ITM_PIDR1_PART_1_ACCESS "RO"
// =============================================================================
// Register    : M33_ITM_PIDR2
// Description : Provides CoreSight discovery information for the ITM
#define M33_ITM_PIDR2_OFFSET _u(0x00000fe8)
#define M33_ITM_PIDR2_BITS   _u(0x000000ff)
#define M33_ITM_PIDR2_RESET  _u(0x0000000b)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_PIDR2_REVISION
// Description : See CoreSight Architecture Specification
#define M33_ITM_PIDR2_REVISION_RESET  _u(0x0)
#define M33_ITM_PIDR2_REVISION_BITS   _u(0x000000f0)
#define M33_ITM_PIDR2_REVISION_MSB    _u(7)
#define M33_ITM_PIDR2_REVISION_LSB    _u(4)
#define M33_ITM_PIDR2_REVISION_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ITM_PIDR2_JEDEC
// Description : See CoreSight Architecture Specification
#define M33_ITM_PIDR2_JEDEC_RESET  _u(0x1)
#define M33_ITM_PIDR2_JEDEC_BITS   _u(0x00000008)
#define M33_ITM_PIDR2_JEDEC_MSB    _u(3)
#define M33_ITM_PIDR2_JEDEC_LSB    _u(3)
