Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/m33.h
#define M33_ITM_PIDR2_JEDEC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ITM_PIDR2_DES_1
// Description : See CoreSight Architecture Specification
#define M33_ITM_PIDR2_DES_1_RESET  _u(0x3)
#define M33_ITM_PIDR2_DES_1_BITS   _u(0x00000007)
#define M33_ITM_PIDR2_DES_1_MSB    _u(2)
#define M33_ITM_PIDR2_DES_1_LSB    _u(0)
#define M33_ITM_PIDR2_DES_1_ACCESS "RO"
// =============================================================================
// Register    : M33_ITM_PIDR3
// Description : Provides CoreSight discovery information for the ITM
#define M33_ITM_PIDR3_OFFSET _u(0x00000fec)
#define M33_ITM_PIDR3_BITS   _u(0x000000ff)
#define M33_ITM_PIDR3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_PIDR3_REVAND
// Description : See CoreSight Architecture Specification
#define M33_ITM_PIDR3_REVAND_RESET  _u(0x0)
#define M33_ITM_PIDR3_REVAND_BITS   _u(0x000000f0)
#define M33_ITM_PIDR3_REVAND_MSB    _u(7)
#define M33_ITM_PIDR3_REVAND_LSB    _u(4)
#define M33_ITM_PIDR3_REVAND_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ITM_PIDR3_CMOD
// Description : See CoreSight Architecture Specification
#define M33_ITM_PIDR3_CMOD_RESET  _u(0x0)
#define M33_ITM_PIDR3_CMOD_BITS   _u(0x0000000f)
#define M33_ITM_PIDR3_CMOD_MSB    _u(3)
#define M33_ITM_PIDR3_CMOD_LSB    _u(0)
#define M33_ITM_PIDR3_CMOD_ACCESS "RO"
// =============================================================================
// Register    : M33_ITM_CIDR0
// Description : Provides CoreSight discovery information for the ITM
#define M33_ITM_CIDR0_OFFSET _u(0x00000ff0)
#define M33_ITM_CIDR0_BITS   _u(0x000000ff)
#define M33_ITM_CIDR0_RESET  _u(0x0000000d)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_CIDR0_PRMBL_0
// Description : See CoreSight Architecture Specification
#define M33_ITM_CIDR0_PRMBL_0_RESET  _u(0x0d)
#define M33_ITM_CIDR0_PRMBL_0_BITS   _u(0x000000ff)
#define M33_ITM_CIDR0_PRMBL_0_MSB    _u(7)
#define M33_ITM_CIDR0_PRMBL_0_LSB    _u(0)
#define M33_ITM_CIDR0_PRMBL_0_ACCESS "RO"
// =============================================================================
// Register    : M33_ITM_CIDR1
// Description : Provides CoreSight discovery information for the ITM
#define M33_ITM_CIDR1_OFFSET _u(0x00000ff4)
#define M33_ITM_CIDR1_BITS   _u(0x000000ff)
#define M33_ITM_CIDR1_RESET  _u(0x00000090)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_CIDR1_CLASS
// Description : See CoreSight Architecture Specification
#define M33_ITM_CIDR1_CLASS_RESET  _u(0x9)
#define M33_ITM_CIDR1_CLASS_BITS   _u(0x000000f0)
#define M33_ITM_CIDR1_CLASS_MSB    _u(7)
#define M33_ITM_CIDR1_CLASS_LSB    _u(4)
#define M33_ITM_CIDR1_CLASS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ITM_CIDR1_PRMBL_1
// Description : See CoreSight Architecture Specification
#define M33_ITM_CIDR1_PRMBL_1_RESET  _u(0x0)
#define M33_ITM_CIDR1_PRMBL_1_BITS   _u(0x0000000f)
#define M33_ITM_CIDR1_PRMBL_1_MSB    _u(3)
#define M33_ITM_CIDR1_PRMBL_1_LSB    _u(0)
#define M33_ITM_CIDR1_PRMBL_1_ACCESS "RO"
// =============================================================================
// Register    : M33_ITM_CIDR2
// Description : Provides CoreSight discovery information for the ITM
#define M33_ITM_CIDR2_OFFSET _u(0x00000ff8)
#define M33_ITM_CIDR2_BITS   _u(0x000000ff)
#define M33_ITM_CIDR2_RESET  _u(0x00000005)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_CIDR2_PRMBL_2
// Description : See CoreSight Architecture Specification
#define M33_ITM_CIDR2_PRMBL_2_RESET  _u(0x05)
#define M33_ITM_CIDR2_PRMBL_2_BITS   _u(0x000000ff)
#define M33_ITM_CIDR2_PRMBL_2_MSB    _u(7)
#define M33_ITM_CIDR2_PRMBL_2_LSB    _u(0)
#define M33_ITM_CIDR2_PRMBL_2_ACCESS "RO"
// =============================================================================
// Register    : M33_ITM_CIDR3
// Description : Provides CoreSight discovery information for the ITM
#define M33_ITM_CIDR3_OFFSET _u(0x00000ffc)
#define M33_ITM_CIDR3_BITS   _u(0x000000ff)
#define M33_ITM_CIDR3_RESET  _u(0x000000b1)
// -----------------------------------------------------------------------------
// Field       : M33_ITM_CIDR3_PRMBL_3
// Description : See CoreSight Architecture Specification
#define M33_ITM_CIDR3_PRMBL_3_RESET  _u(0xb1)
#define M33_ITM_CIDR3_PRMBL_3_BITS   _u(0x000000ff)
#define M33_ITM_CIDR3_PRMBL_3_MSB    _u(7)
#define M33_ITM_CIDR3_PRMBL_3_LSB    _u(0)
#define M33_ITM_CIDR3_PRMBL_3_ACCESS "RO"
// =============================================================================
// Register    : M33_DWT_CTRL
// Description : Provides configuration and status information for the DWT unit,
//               and used to control features of the unit
#define M33_DWT_CTRL_OFFSET _u(0x00001000)
#define M33_DWT_CTRL_BITS   _u(0xffff1fff)
#define M33_DWT_CTRL_RESET  _u(0x73741824)
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CTRL_NUMCOMP
// Description : Number of DWT comparators implemented
#define M33_DWT_CTRL_NUMCOMP_RESET  _u(0x7)
#define M33_DWT_CTRL_NUMCOMP_BITS   _u(0xf0000000)
#define M33_DWT_CTRL_NUMCOMP_MSB    _u(31)
#define M33_DWT_CTRL_NUMCOMP_LSB    _u(28)
#define M33_DWT_CTRL_NUMCOMP_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CTRL_NOTRCPKT
// Description : Indicates whether the implementation does not support trace
#define M33_DWT_CTRL_NOTRCPKT_RESET  _u(0x0)
#define M33_DWT_CTRL_NOTRCPKT_BITS   _u(0x08000000)
#define M33_DWT_CTRL_NOTRCPKT_MSB    _u(27)
#define M33_DWT_CTRL_NOTRCPKT_LSB    _u(27)
#define M33_DWT_CTRL_NOTRCPKT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CTRL_NOEXTTRIG
// Description : Reserved, RAZ
#define M33_DWT_CTRL_NOEXTTRIG_RESET  _u(0x0)
#define M33_DWT_CTRL_NOEXTTRIG_BITS   _u(0x04000000)
#define M33_DWT_CTRL_NOEXTTRIG_MSB    _u(26)
#define M33_DWT_CTRL_NOEXTTRIG_LSB    _u(26)
#define M33_DWT_CTRL_NOEXTTRIG_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CTRL_NOCYCCNT
// Description : Indicates whether the implementation does not include a cycle
//               counter
#define M33_DWT_CTRL_NOCYCCNT_RESET  _u(0x1)
#define M33_DWT_CTRL_NOCYCCNT_BITS   _u(0x02000000)
#define M33_DWT_CTRL_NOCYCCNT_MSB    _u(25)
#define M33_DWT_CTRL_NOCYCCNT_LSB    _u(25)
#define M33_DWT_CTRL_NOCYCCNT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CTRL_NOPRFCNT
// Description : Indicates whether the implementation does not include the
//               profiling counters
#define M33_DWT_CTRL_NOPRFCNT_RESET  _u(0x1)
#define M33_DWT_CTRL_NOPRFCNT_BITS   _u(0x01000000)
#define M33_DWT_CTRL_NOPRFCNT_MSB    _u(24)
#define M33_DWT_CTRL_NOPRFCNT_LSB    _u(24)
#define M33_DWT_CTRL_NOPRFCNT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CTRL_CYCDISS
// Description : Controls whether the cycle counter is disabled in Secure state
#define M33_DWT_CTRL_CYCDISS_RESET  _u(0x0)
#define M33_DWT_CTRL_CYCDISS_BITS   _u(0x00800000)
#define M33_DWT_CTRL_CYCDISS_MSB    _u(23)
#define M33_DWT_CTRL_CYCDISS_LSB    _u(23)
#define M33_DWT_CTRL_CYCDISS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CTRL_CYCEVTENA
// Description : Enables Event Counter packet generation on POSTCNT underflow
#define M33_DWT_CTRL_CYCEVTENA_RESET  _u(0x1)
#define M33_DWT_CTRL_CYCEVTENA_BITS   _u(0x00400000)
#define M33_DWT_CTRL_CYCEVTENA_MSB    _u(22)
#define M33_DWT_CTRL_CYCEVTENA_LSB    _u(22)
#define M33_DWT_CTRL_CYCEVTENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CTRL_FOLDEVTENA
// Description : Enables DWT_FOLDCNT counter
#define M33_DWT_CTRL_FOLDEVTENA_RESET  _u(0x1)
#define M33_DWT_CTRL_FOLDEVTENA_BITS   _u(0x00200000)
#define M33_DWT_CTRL_FOLDEVTENA_MSB    _u(21)
#define M33_DWT_CTRL_FOLDEVTENA_LSB    _u(21)
#define M33_DWT_CTRL_FOLDEVTENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CTRL_LSUEVTENA
// Description : Enables DWT_LSUCNT counter
#define M33_DWT_CTRL_LSUEVTENA_RESET  _u(0x1)
#define M33_DWT_CTRL_LSUEVTENA_BITS   _u(0x00100000)
#define M33_DWT_CTRL_LSUEVTENA_MSB    _u(20)
#define M33_DWT_CTRL_LSUEVTENA_LSB    _u(20)
#define M33_DWT_CTRL_LSUEVTENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CTRL_SLEEPEVTENA
// Description : Enable DWT_SLEEPCNT counter
#define M33_DWT_CTRL_SLEEPEVTENA_RESET  _u(0x0)
#define M33_DWT_CTRL_SLEEPEVTENA_BITS   _u(0x00080000)
#define M33_DWT_CTRL_SLEEPEVTENA_MSB    _u(19)
#define M33_DWT_CTRL_SLEEPEVTENA_LSB    _u(19)
#define M33_DWT_CTRL_SLEEPEVTENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CTRL_EXCEVTENA
// Description : Enables DWT_EXCCNT counter
#define M33_DWT_CTRL_EXCEVTENA_RESET  _u(0x1)
#define M33_DWT_CTRL_EXCEVTENA_BITS   _u(0x00040000)
#define M33_DWT_CTRL_EXCEVTENA_MSB    _u(18)
#define M33_DWT_CTRL_EXCEVTENA_LSB    _u(18)
#define M33_DWT_CTRL_EXCEVTENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CTRL_CPIEVTENA
// Description : Enables DWT_CPICNT counter
#define M33_DWT_CTRL_CPIEVTENA_RESET  _u(0x0)
#define M33_DWT_CTRL_CPIEVTENA_BITS   _u(0x00020000)
#define M33_DWT_CTRL_CPIEVTENA_MSB    _u(17)
#define M33_DWT_CTRL_CPIEVTENA_LSB    _u(17)
#define M33_DWT_CTRL_CPIEVTENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CTRL_EXTTRCENA
// Description : Enables generation of Exception Trace packets
#define M33_DWT_CTRL_EXTTRCENA_RESET  _u(0x0)
#define M33_DWT_CTRL_EXTTRCENA_BITS   _u(0x00010000)
#define M33_DWT_CTRL_EXTTRCENA_MSB    _u(16)
#define M33_DWT_CTRL_EXTTRCENA_LSB    _u(16)
#define M33_DWT_CTRL_EXTTRCENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CTRL_PCSAMPLENA
// Description : Enables use of POSTCNT counter as a timer for Periodic PC
//               Sample packet generation
#define M33_DWT_CTRL_PCSAMPLENA_RESET  _u(0x1)
#define M33_DWT_CTRL_PCSAMPLENA_BITS   _u(0x00001000)
#define M33_DWT_CTRL_PCSAMPLENA_MSB    _u(12)
#define M33_DWT_CTRL_PCSAMPLENA_LSB    _u(12)
#define M33_DWT_CTRL_PCSAMPLENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CTRL_SYNCTAP
// Description : Selects the position of the synchronization packet counter tap
//               on the CYCCNT counter. This determines the Synchronization
//               packet rate
#define M33_DWT_CTRL_SYNCTAP_RESET  _u(0x2)
#define M33_DWT_CTRL_SYNCTAP_BITS   _u(0x00000c00)
#define M33_DWT_CTRL_SYNCTAP_MSB    _u(11)
#define M33_DWT_CTRL_SYNCTAP_LSB    _u(10)
#define M33_DWT_CTRL_SYNCTAP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CTRL_CYCTAP
// Description : Selects the position of the POSTCNT tap on the CYCCNT counter
#define M33_DWT_CTRL_CYCTAP_RESET  _u(0x0)
#define M33_DWT_CTRL_CYCTAP_BITS   _u(0x00000200)
#define M33_DWT_CTRL_CYCTAP_MSB    _u(9)
#define M33_DWT_CTRL_CYCTAP_LSB    _u(9)
#define M33_DWT_CTRL_CYCTAP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CTRL_POSTINIT
// Description : Initial value for the POSTCNT counter
#define M33_DWT_CTRL_POSTINIT_RESET  _u(0x1)
#define M33_DWT_CTRL_POSTINIT_BITS   _u(0x000001e0)
#define M33_DWT_CTRL_POSTINIT_MSB    _u(8)
#define M33_DWT_CTRL_POSTINIT_LSB    _u(5)
#define M33_DWT_CTRL_POSTINIT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CTRL_POSTPRESET
// Description : Reload value for the POSTCNT counter
#define M33_DWT_CTRL_POSTPRESET_RESET  _u(0x2)
#define M33_DWT_CTRL_POSTPRESET_BITS   _u(0x0000001e)
#define M33_DWT_CTRL_POSTPRESET_MSB    _u(4)
#define M33_DWT_CTRL_POSTPRESET_LSB    _u(1)
#define M33_DWT_CTRL_POSTPRESET_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CTRL_CYCCNTENA
// Description : Enables CYCCNT
#define M33_DWT_CTRL_CYCCNTENA_RESET  _u(0x0)
#define M33_DWT_CTRL_CYCCNTENA_BITS   _u(0x00000001)
#define M33_DWT_CTRL_CYCCNTENA_MSB    _u(0)
#define M33_DWT_CTRL_CYCCNTENA_LSB    _u(0)
#define M33_DWT_CTRL_CYCCNTENA_ACCESS "RW"
// =============================================================================
// Register    : M33_DWT_CYCCNT
// Description : Shows or sets the value of the processor cycle counter, CYCCNT
#define M33_DWT_CYCCNT_OFFSET _u(0x00001004)
#define M33_DWT_CYCCNT_BITS   _u(0xffffffff)
#define M33_DWT_CYCCNT_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CYCCNT_CYCCNT
// Description : Increments one on each processor clock cycle when
//               DWT_CTRL.CYCCNTENA == 1 and DEMCR.TRCENA == 1. On overflow,
//               CYCCNT wraps to zero
#define M33_DWT_CYCCNT_CYCCNT_RESET  _u(0x00000000)
#define M33_DWT_CYCCNT_CYCCNT_BITS   _u(0xffffffff)
#define M33_DWT_CYCCNT_CYCCNT_MSB    _u(31)
#define M33_DWT_CYCCNT_CYCCNT_LSB    _u(0)
#define M33_DWT_CYCCNT_CYCCNT_ACCESS "RW"
// =============================================================================
// Register    : M33_DWT_EXCCNT
// Description : Counts the total cycles spent in exception processing
#define M33_DWT_EXCCNT_OFFSET _u(0x0000100c)
#define M33_DWT_EXCCNT_BITS   _u(0x000000ff)
#define M33_DWT_EXCCNT_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_DWT_EXCCNT_EXCCNT
// Description : Counts one on each cycle when all of the following are true: -
//               DWT_CTRL.EXCEVTENA == 1 and DEMCR.TRCENA == 1. - No instruction
//               is executed, see DWT_CPICNT. - An exception-entry or exception-
//               exit related operation is in progress. - Either
//               SecureNoninvasiveDebugAllowed() == TRUE, or NS-Req for the
//               operation is set to Non-secure and NoninvasiveDebugAllowed() ==
//               TRUE.
#define M33_DWT_EXCCNT_EXCCNT_RESET  _u(0x00)
#define M33_DWT_EXCCNT_EXCCNT_BITS   _u(0x000000ff)
#define M33_DWT_EXCCNT_EXCCNT_MSB    _u(7)
#define M33_DWT_EXCCNT_EXCCNT_LSB    _u(0)
#define M33_DWT_EXCCNT_EXCCNT_ACCESS "RW"
// =============================================================================
// Register    : M33_DWT_LSUCNT
// Description : Increments on the additional cycles required to execute all
//               load or store instructions
#define M33_DWT_LSUCNT_OFFSET _u(0x00001014)
#define M33_DWT_LSUCNT_BITS   _u(0x000000ff)
#define M33_DWT_LSUCNT_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_DWT_LSUCNT_LSUCNT
// Description : Counts one on each cycle when all of the following are true: -
//               DWT_CTRL.LSUEVTENA == 1 and DEMCR.TRCENA == 1. - No instruction
//               is executed, see DWT_CPICNT. - No exception-entry or exception-
//               exit operation is in progress, see DWT_EXCCNT. - A load-store
//               operation is in progress. - Either
//               SecureNoninvasiveDebugAllowed() == TRUE, or NS-Req for the
//               operation is set to Non-secure and NoninvasiveDebugAllowed() ==
//               TRUE.
#define M33_DWT_LSUCNT_LSUCNT_RESET  _u(0x00)
#define M33_DWT_LSUCNT_LSUCNT_BITS   _u(0x000000ff)
#define M33_DWT_LSUCNT_LSUCNT_MSB    _u(7)
#define M33_DWT_LSUCNT_LSUCNT_LSB    _u(0)
#define M33_DWT_LSUCNT_LSUCNT_ACCESS "RW"
// =============================================================================
// Register    : M33_DWT_FOLDCNT
// Description : Increments on the additional cycles required to execute all
//               load or store instructions
#define M33_DWT_FOLDCNT_OFFSET _u(0x00001018)
#define M33_DWT_FOLDCNT_BITS   _u(0x000000ff)
#define M33_DWT_FOLDCNT_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FOLDCNT_FOLDCNT
// Description : Counts on each cycle when all of the following are true: -
//               DWT_CTRL.FOLDEVTENA == 1 and DEMCR.TRCENA == 1. - At least two
//               instructions are executed, see DWT_CPICNT. - Either
//               SecureNoninvasiveDebugAllowed() == TRUE, or the PE is in Non-
//               secure state and NoninvasiveDebugAllowed() == TRUE. The counter
//               is incremented by the number of instructions executed, minus
//               one
#define M33_DWT_FOLDCNT_FOLDCNT_RESET  _u(0x00)
#define M33_DWT_FOLDCNT_FOLDCNT_BITS   _u(0x000000ff)
#define M33_DWT_FOLDCNT_FOLDCNT_MSB    _u(7)
#define M33_DWT_FOLDCNT_FOLDCNT_LSB    _u(0)
#define M33_DWT_FOLDCNT_FOLDCNT_ACCESS "RW"
// =============================================================================
// Register    : M33_DWT_COMP0
// Description : Provides a reference value for use by watchpoint comparator 0
#define M33_DWT_COMP0_OFFSET _u(0x00001020)
#define M33_DWT_COMP0_BITS   _u(0xffffffff)
#define M33_DWT_COMP0_RESET  _u(0x00000000)
#define M33_DWT_COMP0_MSB    _u(31)
#define M33_DWT_COMP0_LSB    _u(0)
#define M33_DWT_COMP0_ACCESS "RW"
// =============================================================================
// Register    : M33_DWT_FUNCTION0
// Description : Controls the operation of watchpoint comparator 0
#define M33_DWT_FUNCTION0_OFFSET _u(0x00001028)
#define M33_DWT_FUNCTION0_BITS   _u(0xf9000c3f)
#define M33_DWT_FUNCTION0_RESET  _u(0x58000000)
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FUNCTION0_ID
// Description : Identifies the capabilities for MATCH for comparator *n
#define M33_DWT_FUNCTION0_ID_RESET  _u(0x0b)
#define M33_DWT_FUNCTION0_ID_BITS   _u(0xf8000000)
#define M33_DWT_FUNCTION0_ID_MSB    _u(31)
#define M33_DWT_FUNCTION0_ID_LSB    _u(27)
#define M33_DWT_FUNCTION0_ID_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FUNCTION0_MATCHED
// Description : Set to 1 when the comparator matches
#define M33_DWT_FUNCTION0_MATCHED_RESET  _u(0x0)
#define M33_DWT_FUNCTION0_MATCHED_BITS   _u(0x01000000)
#define M33_DWT_FUNCTION0_MATCHED_MSB    _u(24)
#define M33_DWT_FUNCTION0_MATCHED_LSB    _u(24)
#define M33_DWT_FUNCTION0_MATCHED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FUNCTION0_DATAVSIZE
// Description : Defines the size of the object being watched for by Data Value
//               and Data Address comparators
#define M33_DWT_FUNCTION0_DATAVSIZE_RESET  _u(0x0)
#define M33_DWT_FUNCTION0_DATAVSIZE_BITS   _u(0x00000c00)
#define M33_DWT_FUNCTION0_DATAVSIZE_MSB    _u(11)
#define M33_DWT_FUNCTION0_DATAVSIZE_LSB    _u(10)
#define M33_DWT_FUNCTION0_DATAVSIZE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FUNCTION0_ACTION
// Description : Defines the action on a match. This field is ignored and the
//               comparator generates no actions if it is disabled by MATCH
#define M33_DWT_FUNCTION0_ACTION_RESET  _u(0x0)
#define M33_DWT_FUNCTION0_ACTION_BITS   _u(0x00000030)
#define M33_DWT_FUNCTION0_ACTION_MSB    _u(5)
#define M33_DWT_FUNCTION0_ACTION_LSB    _u(4)
#define M33_DWT_FUNCTION0_ACTION_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FUNCTION0_MATCH
// Description : Controls the type of match generated by this comparator
#define M33_DWT_FUNCTION0_MATCH_RESET  _u(0x0)
#define M33_DWT_FUNCTION0_MATCH_BITS   _u(0x0000000f)
#define M33_DWT_FUNCTION0_MATCH_MSB    _u(3)
#define M33_DWT_FUNCTION0_MATCH_LSB    _u(0)
#define M33_DWT_FUNCTION0_MATCH_ACCESS "RW"
// =============================================================================
// Register    : M33_DWT_COMP1
// Description : Provides a reference value for use by watchpoint comparator 1
#define M33_DWT_COMP1_OFFSET _u(0x00001030)
#define M33_DWT_COMP1_BITS   _u(0xffffffff)
#define M33_DWT_COMP1_RESET  _u(0x00000000)
#define M33_DWT_COMP1_MSB    _u(31)
#define M33_DWT_COMP1_LSB    _u(0)
#define M33_DWT_COMP1_ACCESS "RW"
// =============================================================================
// Register    : M33_DWT_FUNCTION1
// Description : Controls the operation of watchpoint comparator 1
#define M33_DWT_FUNCTION1_OFFSET _u(0x00001038)
#define M33_DWT_FUNCTION1_BITS   _u(0xf9000c3f)
#define M33_DWT_FUNCTION1_RESET  _u(0x89000828)
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FUNCTION1_ID
// Description : Identifies the capabilities for MATCH for comparator *n
#define M33_DWT_FUNCTION1_ID_RESET  _u(0x11)
#define M33_DWT_FUNCTION1_ID_BITS   _u(0xf8000000)
#define M33_DWT_FUNCTION1_ID_MSB    _u(31)
#define M33_DWT_FUNCTION1_ID_LSB    _u(27)
#define M33_DWT_FUNCTION1_ID_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FUNCTION1_MATCHED
// Description : Set to 1 when the comparator matches
#define M33_DWT_FUNCTION1_MATCHED_RESET  _u(0x1)
#define M33_DWT_FUNCTION1_MATCHED_BITS   _u(0x01000000)
#define M33_DWT_FUNCTION1_MATCHED_MSB    _u(24)
#define M33_DWT_FUNCTION1_MATCHED_LSB    _u(24)
#define M33_DWT_FUNCTION1_MATCHED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FUNCTION1_DATAVSIZE
// Description : Defines the size of the object being watched for by Data Value
//               and Data Address comparators
#define M33_DWT_FUNCTION1_DATAVSIZE_RESET  _u(0x2)
#define M33_DWT_FUNCTION1_DATAVSIZE_BITS   _u(0x00000c00)
#define M33_DWT_FUNCTION1_DATAVSIZE_MSB    _u(11)
#define M33_DWT_FUNCTION1_DATAVSIZE_LSB    _u(10)
#define M33_DWT_FUNCTION1_DATAVSIZE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FUNCTION1_ACTION
// Description : Defines the action on a match. This field is ignored and the
//               comparator generates no actions if it is disabled by MATCH
#define M33_DWT_FUNCTION1_ACTION_RESET  _u(0x2)
#define M33_DWT_FUNCTION1_ACTION_BITS   _u(0x00000030)
#define M33_DWT_FUNCTION1_ACTION_MSB    _u(5)
#define M33_DWT_FUNCTION1_ACTION_LSB    _u(4)
#define M33_DWT_FUNCTION1_ACTION_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FUNCTION1_MATCH
// Description : Controls the type of match generated by this comparator
#define M33_DWT_FUNCTION1_MATCH_RESET  _u(0x8)
#define M33_DWT_FUNCTION1_MATCH_BITS   _u(0x0000000f)
#define M33_DWT_FUNCTION1_MATCH_MSB    _u(3)
#define M33_DWT_FUNCTION1_MATCH_LSB    _u(0)
#define M33_DWT_FUNCTION1_MATCH_ACCESS "RW"
// =============================================================================
// Register    : M33_DWT_COMP2
// Description : Provides a reference value for use by watchpoint comparator 2
#define M33_DWT_COMP2_OFFSET _u(0x00001040)
