Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/m33.h
#define M33_DWT_COMP2_BITS   _u(0xffffffff)
#define M33_DWT_COMP2_RESET  _u(0x00000000)
#define M33_DWT_COMP2_MSB    _u(31)
#define M33_DWT_COMP2_LSB    _u(0)
#define M33_DWT_COMP2_ACCESS "RW"
// =============================================================================
// Register    : M33_DWT_FUNCTION2
// Description : Controls the operation of watchpoint comparator 2
#define M33_DWT_FUNCTION2_OFFSET _u(0x00001048)
#define M33_DWT_FUNCTION2_BITS   _u(0xf9000c3f)
#define M33_DWT_FUNCTION2_RESET  _u(0x50000000)
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FUNCTION2_ID
// Description : Identifies the capabilities for MATCH for comparator *n
#define M33_DWT_FUNCTION2_ID_RESET  _u(0x0a)
#define M33_DWT_FUNCTION2_ID_BITS   _u(0xf8000000)
#define M33_DWT_FUNCTION2_ID_MSB    _u(31)
#define M33_DWT_FUNCTION2_ID_LSB    _u(27)
#define M33_DWT_FUNCTION2_ID_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FUNCTION2_MATCHED
// Description : Set to 1 when the comparator matches
#define M33_DWT_FUNCTION2_MATCHED_RESET  _u(0x0)
#define M33_DWT_FUNCTION2_MATCHED_BITS   _u(0x01000000)
#define M33_DWT_FUNCTION2_MATCHED_MSB    _u(24)
#define M33_DWT_FUNCTION2_MATCHED_LSB    _u(24)
#define M33_DWT_FUNCTION2_MATCHED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FUNCTION2_DATAVSIZE
// Description : Defines the size of the object being watched for by Data Value
//               and Data Address comparators
#define M33_DWT_FUNCTION2_DATAVSIZE_RESET  _u(0x0)
#define M33_DWT_FUNCTION2_DATAVSIZE_BITS   _u(0x00000c00)
#define M33_DWT_FUNCTION2_DATAVSIZE_MSB    _u(11)
#define M33_DWT_FUNCTION2_DATAVSIZE_LSB    _u(10)
#define M33_DWT_FUNCTION2_DATAVSIZE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FUNCTION2_ACTION
// Description : Defines the action on a match. This field is ignored and the
//               comparator generates no actions if it is disabled by MATCH
#define M33_DWT_FUNCTION2_ACTION_RESET  _u(0x0)
#define M33_DWT_FUNCTION2_ACTION_BITS   _u(0x00000030)
#define M33_DWT_FUNCTION2_ACTION_MSB    _u(5)
#define M33_DWT_FUNCTION2_ACTION_LSB    _u(4)
#define M33_DWT_FUNCTION2_ACTION_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FUNCTION2_MATCH
// Description : Controls the type of match generated by this comparator
#define M33_DWT_FUNCTION2_MATCH_RESET  _u(0x0)
#define M33_DWT_FUNCTION2_MATCH_BITS   _u(0x0000000f)
#define M33_DWT_FUNCTION2_MATCH_MSB    _u(3)
#define M33_DWT_FUNCTION2_MATCH_LSB    _u(0)
#define M33_DWT_FUNCTION2_MATCH_ACCESS "RW"
// =============================================================================
// Register    : M33_DWT_COMP3
// Description : Provides a reference value for use by watchpoint comparator 3
#define M33_DWT_COMP3_OFFSET _u(0x00001050)
#define M33_DWT_COMP3_BITS   _u(0xffffffff)
#define M33_DWT_COMP3_RESET  _u(0x00000000)
#define M33_DWT_COMP3_MSB    _u(31)
#define M33_DWT_COMP3_LSB    _u(0)
#define M33_DWT_COMP3_ACCESS "RW"
// =============================================================================
// Register    : M33_DWT_FUNCTION3
// Description : Controls the operation of watchpoint comparator 3
#define M33_DWT_FUNCTION3_OFFSET _u(0x00001058)
#define M33_DWT_FUNCTION3_BITS   _u(0xf9000c3f)
#define M33_DWT_FUNCTION3_RESET  _u(0x20000800)
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FUNCTION3_ID
// Description : Identifies the capabilities for MATCH for comparator *n
#define M33_DWT_FUNCTION3_ID_RESET  _u(0x04)
#define M33_DWT_FUNCTION3_ID_BITS   _u(0xf8000000)
#define M33_DWT_FUNCTION3_ID_MSB    _u(31)
#define M33_DWT_FUNCTION3_ID_LSB    _u(27)
#define M33_DWT_FUNCTION3_ID_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FUNCTION3_MATCHED
// Description : Set to 1 when the comparator matches
#define M33_DWT_FUNCTION3_MATCHED_RESET  _u(0x0)
#define M33_DWT_FUNCTION3_MATCHED_BITS   _u(0x01000000)
#define M33_DWT_FUNCTION3_MATCHED_MSB    _u(24)
#define M33_DWT_FUNCTION3_MATCHED_LSB    _u(24)
#define M33_DWT_FUNCTION3_MATCHED_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FUNCTION3_DATAVSIZE
// Description : Defines the size of the object being watched for by Data Value
//               and Data Address comparators
#define M33_DWT_FUNCTION3_DATAVSIZE_RESET  _u(0x2)
#define M33_DWT_FUNCTION3_DATAVSIZE_BITS   _u(0x00000c00)
#define M33_DWT_FUNCTION3_DATAVSIZE_MSB    _u(11)
#define M33_DWT_FUNCTION3_DATAVSIZE_LSB    _u(10)
#define M33_DWT_FUNCTION3_DATAVSIZE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FUNCTION3_ACTION
// Description : Defines the action on a match. This field is ignored and the
//               comparator generates no actions if it is disabled by MATCH
#define M33_DWT_FUNCTION3_ACTION_RESET  _u(0x0)
#define M33_DWT_FUNCTION3_ACTION_BITS   _u(0x00000030)
#define M33_DWT_FUNCTION3_ACTION_MSB    _u(5)
#define M33_DWT_FUNCTION3_ACTION_LSB    _u(4)
#define M33_DWT_FUNCTION3_ACTION_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_FUNCTION3_MATCH
// Description : Controls the type of match generated by this comparator
#define M33_DWT_FUNCTION3_MATCH_RESET  _u(0x0)
#define M33_DWT_FUNCTION3_MATCH_BITS   _u(0x0000000f)
#define M33_DWT_FUNCTION3_MATCH_MSB    _u(3)
#define M33_DWT_FUNCTION3_MATCH_LSB    _u(0)
#define M33_DWT_FUNCTION3_MATCH_ACCESS "RW"
// =============================================================================
// Register    : M33_DWT_DEVARCH
// Description : Provides CoreSight discovery information for the DWT
#define M33_DWT_DEVARCH_OFFSET _u(0x00001fbc)
#define M33_DWT_DEVARCH_BITS   _u(0xffffffff)
#define M33_DWT_DEVARCH_RESET  _u(0x47701a02)
// -----------------------------------------------------------------------------
// Field       : M33_DWT_DEVARCH_ARCHITECT
// Description : Defines the architect of the component. Bits [31:28] are the
//               JEP106 continuation code (JEP106 bank ID, minus 1) and bits
//               [27:21] are the JEP106 ID code.
#define M33_DWT_DEVARCH_ARCHITECT_RESET  _u(0x23b)
#define M33_DWT_DEVARCH_ARCHITECT_BITS   _u(0xffe00000)
#define M33_DWT_DEVARCH_ARCHITECT_MSB    _u(31)
#define M33_DWT_DEVARCH_ARCHITECT_LSB    _u(21)
#define M33_DWT_DEVARCH_ARCHITECT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_DEVARCH_PRESENT
// Description : Defines that the DEVARCH register is present
#define M33_DWT_DEVARCH_PRESENT_RESET  _u(0x1)
#define M33_DWT_DEVARCH_PRESENT_BITS   _u(0x00100000)
#define M33_DWT_DEVARCH_PRESENT_MSB    _u(20)
#define M33_DWT_DEVARCH_PRESENT_LSB    _u(20)
#define M33_DWT_DEVARCH_PRESENT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_DEVARCH_REVISION
// Description : Defines the architecture revision of the component
#define M33_DWT_DEVARCH_REVISION_RESET  _u(0x0)
#define M33_DWT_DEVARCH_REVISION_BITS   _u(0x000f0000)
#define M33_DWT_DEVARCH_REVISION_MSB    _u(19)
#define M33_DWT_DEVARCH_REVISION_LSB    _u(16)
#define M33_DWT_DEVARCH_REVISION_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_DEVARCH_ARCHVER
// Description : Defines the architecture version of the component
#define M33_DWT_DEVARCH_ARCHVER_RESET  _u(0x1)
#define M33_DWT_DEVARCH_ARCHVER_BITS   _u(0x0000f000)
#define M33_DWT_DEVARCH_ARCHVER_MSB    _u(15)
#define M33_DWT_DEVARCH_ARCHVER_LSB    _u(12)
#define M33_DWT_DEVARCH_ARCHVER_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_DEVARCH_ARCHPART
// Description : Defines the architecture of the component
#define M33_DWT_DEVARCH_ARCHPART_RESET  _u(0xa02)
#define M33_DWT_DEVARCH_ARCHPART_BITS   _u(0x00000fff)
#define M33_DWT_DEVARCH_ARCHPART_MSB    _u(11)
#define M33_DWT_DEVARCH_ARCHPART_LSB    _u(0)
#define M33_DWT_DEVARCH_ARCHPART_ACCESS "RO"
// =============================================================================
// Register    : M33_DWT_DEVTYPE
// Description : Provides CoreSight discovery information for the DWT
#define M33_DWT_DEVTYPE_OFFSET _u(0x00001fcc)
#define M33_DWT_DEVTYPE_BITS   _u(0x000000ff)
#define M33_DWT_DEVTYPE_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_DWT_DEVTYPE_SUB
// Description : Component sub-type
#define M33_DWT_DEVTYPE_SUB_RESET  _u(0x0)
#define M33_DWT_DEVTYPE_SUB_BITS   _u(0x000000f0)
#define M33_DWT_DEVTYPE_SUB_MSB    _u(7)
#define M33_DWT_DEVTYPE_SUB_LSB    _u(4)
#define M33_DWT_DEVTYPE_SUB_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_DEVTYPE_MAJOR
// Description : Component major type
#define M33_DWT_DEVTYPE_MAJOR_RESET  _u(0x0)
#define M33_DWT_DEVTYPE_MAJOR_BITS   _u(0x0000000f)
#define M33_DWT_DEVTYPE_MAJOR_MSB    _u(3)
#define M33_DWT_DEVTYPE_MAJOR_LSB    _u(0)
#define M33_DWT_DEVTYPE_MAJOR_ACCESS "RO"
// =============================================================================
// Register    : M33_DWT_PIDR4
// Description : Provides CoreSight discovery information for the DWT
#define M33_DWT_PIDR4_OFFSET _u(0x00001fd0)
#define M33_DWT_PIDR4_BITS   _u(0x000000ff)
#define M33_DWT_PIDR4_RESET  _u(0x00000004)
// -----------------------------------------------------------------------------
// Field       : M33_DWT_PIDR4_SIZE
// Description : See CoreSight Architecture Specification
#define M33_DWT_PIDR4_SIZE_RESET  _u(0x0)
#define M33_DWT_PIDR4_SIZE_BITS   _u(0x000000f0)
#define M33_DWT_PIDR4_SIZE_MSB    _u(7)
#define M33_DWT_PIDR4_SIZE_LSB    _u(4)
#define M33_DWT_PIDR4_SIZE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_PIDR4_DES_2
// Description : See CoreSight Architecture Specification
#define M33_DWT_PIDR4_DES_2_RESET  _u(0x4)
#define M33_DWT_PIDR4_DES_2_BITS   _u(0x0000000f)
#define M33_DWT_PIDR4_DES_2_MSB    _u(3)
#define M33_DWT_PIDR4_DES_2_LSB    _u(0)
#define M33_DWT_PIDR4_DES_2_ACCESS "RO"
// =============================================================================
// Register    : M33_DWT_PIDR5
// Description : Provides CoreSight discovery information for the DWT
#define M33_DWT_PIDR5_OFFSET _u(0x00001fd4)
#define M33_DWT_PIDR5_BITS   _u(0x00000000)
#define M33_DWT_PIDR5_RESET  _u(0x00000000)
#define M33_DWT_PIDR5_MSB    _u(31)
#define M33_DWT_PIDR5_LSB    _u(0)
#define M33_DWT_PIDR5_ACCESS "RW"
// =============================================================================
// Register    : M33_DWT_PIDR6
// Description : Provides CoreSight discovery information for the DWT
#define M33_DWT_PIDR6_OFFSET _u(0x00001fd8)
#define M33_DWT_PIDR6_BITS   _u(0x00000000)
#define M33_DWT_PIDR6_RESET  _u(0x00000000)
#define M33_DWT_PIDR6_MSB    _u(31)
#define M33_DWT_PIDR6_LSB    _u(0)
#define M33_DWT_PIDR6_ACCESS "RW"
// =============================================================================
// Register    : M33_DWT_PIDR7
// Description : Provides CoreSight discovery information for the DWT
#define M33_DWT_PIDR7_OFFSET _u(0x00001fdc)
#define M33_DWT_PIDR7_BITS   _u(0x00000000)
#define M33_DWT_PIDR7_RESET  _u(0x00000000)
#define M33_DWT_PIDR7_MSB    _u(31)
#define M33_DWT_PIDR7_LSB    _u(0)
#define M33_DWT_PIDR7_ACCESS "RW"
// =============================================================================
// Register    : M33_DWT_PIDR0
// Description : Provides CoreSight discovery information for the DWT
#define M33_DWT_PIDR0_OFFSET _u(0x00001fe0)
#define M33_DWT_PIDR0_BITS   _u(0x000000ff)
#define M33_DWT_PIDR0_RESET  _u(0x00000021)
// -----------------------------------------------------------------------------
// Field       : M33_DWT_PIDR0_PART_0
// Description : See CoreSight Architecture Specification
#define M33_DWT_PIDR0_PART_0_RESET  _u(0x21)
#define M33_DWT_PIDR0_PART_0_BITS   _u(0x000000ff)
#define M33_DWT_PIDR0_PART_0_MSB    _u(7)
#define M33_DWT_PIDR0_PART_0_LSB    _u(0)
#define M33_DWT_PIDR0_PART_0_ACCESS "RO"
// =============================================================================
// Register    : M33_DWT_PIDR1
// Description : Provides CoreSight discovery information for the DWT
#define M33_DWT_PIDR1_OFFSET _u(0x00001fe4)
#define M33_DWT_PIDR1_BITS   _u(0x000000ff)
#define M33_DWT_PIDR1_RESET  _u(0x000000bd)
// -----------------------------------------------------------------------------
// Field       : M33_DWT_PIDR1_DES_0
// Description : See CoreSight Architecture Specification
#define M33_DWT_PIDR1_DES_0_RESET  _u(0xb)
#define M33_DWT_PIDR1_DES_0_BITS   _u(0x000000f0)
#define M33_DWT_PIDR1_DES_0_MSB    _u(7)
#define M33_DWT_PIDR1_DES_0_LSB    _u(4)
#define M33_DWT_PIDR1_DES_0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_PIDR1_PART_1
// Description : See CoreSight Architecture Specification
#define M33_DWT_PIDR1_PART_1_RESET  _u(0xd)
#define M33_DWT_PIDR1_PART_1_BITS   _u(0x0000000f)
#define M33_DWT_PIDR1_PART_1_MSB    _u(3)
#define M33_DWT_PIDR1_PART_1_LSB    _u(0)
#define M33_DWT_PIDR1_PART_1_ACCESS "RO"
// =============================================================================
// Register    : M33_DWT_PIDR2
// Description : Provides CoreSight discovery information for the DWT
#define M33_DWT_PIDR2_OFFSET _u(0x00001fe8)
#define M33_DWT_PIDR2_BITS   _u(0x000000ff)
#define M33_DWT_PIDR2_RESET  _u(0x0000000b)
// -----------------------------------------------------------------------------
// Field       : M33_DWT_PIDR2_REVISION
// Description : See CoreSight Architecture Specification
#define M33_DWT_PIDR2_REVISION_RESET  _u(0x0)
#define M33_DWT_PIDR2_REVISION_BITS   _u(0x000000f0)
#define M33_DWT_PIDR2_REVISION_MSB    _u(7)
#define M33_DWT_PIDR2_REVISION_LSB    _u(4)
#define M33_DWT_PIDR2_REVISION_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_PIDR2_JEDEC
// Description : See CoreSight Architecture Specification
#define M33_DWT_PIDR2_JEDEC_RESET  _u(0x1)
#define M33_DWT_PIDR2_JEDEC_BITS   _u(0x00000008)
#define M33_DWT_PIDR2_JEDEC_MSB    _u(3)
#define M33_DWT_PIDR2_JEDEC_LSB    _u(3)
#define M33_DWT_PIDR2_JEDEC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_PIDR2_DES_1
// Description : See CoreSight Architecture Specification
#define M33_DWT_PIDR2_DES_1_RESET  _u(0x3)
#define M33_DWT_PIDR2_DES_1_BITS   _u(0x00000007)
#define M33_DWT_PIDR2_DES_1_MSB    _u(2)
#define M33_DWT_PIDR2_DES_1_LSB    _u(0)
#define M33_DWT_PIDR2_DES_1_ACCESS "RO"
// =============================================================================
// Register    : M33_DWT_PIDR3
// Description : Provides CoreSight discovery information for the DWT
#define M33_DWT_PIDR3_OFFSET _u(0x00001fec)
#define M33_DWT_PIDR3_BITS   _u(0x000000ff)
#define M33_DWT_PIDR3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_DWT_PIDR3_REVAND
// Description : See CoreSight Architecture Specification
#define M33_DWT_PIDR3_REVAND_RESET  _u(0x0)
#define M33_DWT_PIDR3_REVAND_BITS   _u(0x000000f0)
#define M33_DWT_PIDR3_REVAND_MSB    _u(7)
#define M33_DWT_PIDR3_REVAND_LSB    _u(4)
#define M33_DWT_PIDR3_REVAND_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_PIDR3_CMOD
// Description : See CoreSight Architecture Specification
#define M33_DWT_PIDR3_CMOD_RESET  _u(0x0)
#define M33_DWT_PIDR3_CMOD_BITS   _u(0x0000000f)
#define M33_DWT_PIDR3_CMOD_MSB    _u(3)
#define M33_DWT_PIDR3_CMOD_LSB    _u(0)
#define M33_DWT_PIDR3_CMOD_ACCESS "RO"
// =============================================================================
// Register    : M33_DWT_CIDR0
// Description : Provides CoreSight discovery information for the DWT
#define M33_DWT_CIDR0_OFFSET _u(0x00001ff0)
#define M33_DWT_CIDR0_BITS   _u(0x000000ff)
#define M33_DWT_CIDR0_RESET  _u(0x0000000d)
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CIDR0_PRMBL_0
// Description : See CoreSight Architecture Specification
#define M33_DWT_CIDR0_PRMBL_0_RESET  _u(0x0d)
#define M33_DWT_CIDR0_PRMBL_0_BITS   _u(0x000000ff)
#define M33_DWT_CIDR0_PRMBL_0_MSB    _u(7)
#define M33_DWT_CIDR0_PRMBL_0_LSB    _u(0)
#define M33_DWT_CIDR0_PRMBL_0_ACCESS "RO"
// =============================================================================
// Register    : M33_DWT_CIDR1
// Description : Provides CoreSight discovery information for the DWT
#define M33_DWT_CIDR1_OFFSET _u(0x00001ff4)
#define M33_DWT_CIDR1_BITS   _u(0x000000ff)
#define M33_DWT_CIDR1_RESET  _u(0x00000090)
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CIDR1_CLASS
// Description : See CoreSight Architecture Specification
#define M33_DWT_CIDR1_CLASS_RESET  _u(0x9)
#define M33_DWT_CIDR1_CLASS_BITS   _u(0x000000f0)
#define M33_DWT_CIDR1_CLASS_MSB    _u(7)
#define M33_DWT_CIDR1_CLASS_LSB    _u(4)
#define M33_DWT_CIDR1_CLASS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CIDR1_PRMBL_1
// Description : See CoreSight Architecture Specification
#define M33_DWT_CIDR1_PRMBL_1_RESET  _u(0x0)
#define M33_DWT_CIDR1_PRMBL_1_BITS   _u(0x0000000f)
#define M33_DWT_CIDR1_PRMBL_1_MSB    _u(3)
#define M33_DWT_CIDR1_PRMBL_1_LSB    _u(0)
#define M33_DWT_CIDR1_PRMBL_1_ACCESS "RO"
// =============================================================================
// Register    : M33_DWT_CIDR2
// Description : Provides CoreSight discovery information for the DWT
#define M33_DWT_CIDR2_OFFSET _u(0x00001ff8)
#define M33_DWT_CIDR2_BITS   _u(0x000000ff)
#define M33_DWT_CIDR2_RESET  _u(0x00000005)
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CIDR2_PRMBL_2
// Description : See CoreSight Architecture Specification
#define M33_DWT_CIDR2_PRMBL_2_RESET  _u(0x05)
#define M33_DWT_CIDR2_PRMBL_2_BITS   _u(0x000000ff)
#define M33_DWT_CIDR2_PRMBL_2_MSB    _u(7)
#define M33_DWT_CIDR2_PRMBL_2_LSB    _u(0)
#define M33_DWT_CIDR2_PRMBL_2_ACCESS "RO"
// =============================================================================
// Register    : M33_DWT_CIDR3
// Description : Provides CoreSight discovery information for the DWT
#define M33_DWT_CIDR3_OFFSET _u(0x00001ffc)
#define M33_DWT_CIDR3_BITS   _u(0x000000ff)
#define M33_DWT_CIDR3_RESET  _u(0x000000b1)
// -----------------------------------------------------------------------------
// Field       : M33_DWT_CIDR3_PRMBL_3
// Description : See CoreSight Architecture Specification
#define M33_DWT_CIDR3_PRMBL_3_RESET  _u(0xb1)
#define M33_DWT_CIDR3_PRMBL_3_BITS   _u(0x000000ff)
#define M33_DWT_CIDR3_PRMBL_3_MSB    _u(7)
#define M33_DWT_CIDR3_PRMBL_3_LSB    _u(0)
#define M33_DWT_CIDR3_PRMBL_3_ACCESS "RO"
// =============================================================================
// Register    : M33_FP_CTRL
// Description : Provides FPB implementation information, and the global enable
//               for the FPB unit
#define M33_FP_CTRL_OFFSET _u(0x00002000)
#define M33_FP_CTRL_BITS   _u(0xf0007ff3)
#define M33_FP_CTRL_RESET  _u(0x60005580)
// -----------------------------------------------------------------------------
// Field       : M33_FP_CTRL_REV
// Description : Flash Patch and Breakpoint Unit architecture revision
#define M33_FP_CTRL_REV_RESET  _u(0x6)
#define M33_FP_CTRL_REV_BITS   _u(0xf0000000)
#define M33_FP_CTRL_REV_MSB    _u(31)
#define M33_FP_CTRL_REV_LSB    _u(28)
#define M33_FP_CTRL_REV_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_FP_CTRL_NUM_CODE_14_12_
// Description : Indicates the number of implemented instruction address
//               comparators. Zero indicates no Instruction Address comparators
//               are implemented. The Instruction Address comparators are
//               numbered from 0 to NUM_CODE - 1
#define M33_FP_CTRL_NUM_CODE_14_12__RESET  _u(0x5)
#define M33_FP_CTRL_NUM_CODE_14_12__BITS   _u(0x00007000)
#define M33_FP_CTRL_NUM_CODE_14_12__MSB    _u(14)
#define M33_FP_CTRL_NUM_CODE_14_12__LSB    _u(12)
#define M33_FP_CTRL_NUM_CODE_14_12__ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_FP_CTRL_NUM_LIT
// Description : Indicates the number of implemented literal address
//               comparators. The Literal Address comparators are numbered from
//               NUM_CODE to NUM_CODE + NUM_LIT - 1
#define M33_FP_CTRL_NUM_LIT_RESET  _u(0x5)
#define M33_FP_CTRL_NUM_LIT_BITS   _u(0x00000f00)
#define M33_FP_CTRL_NUM_LIT_MSB    _u(11)
#define M33_FP_CTRL_NUM_LIT_LSB    _u(8)
#define M33_FP_CTRL_NUM_LIT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_FP_CTRL_NUM_CODE_7_4_
// Description : Indicates the number of implemented instruction address
//               comparators. Zero indicates no Instruction Address comparators
//               are implemented. The Instruction Address comparators are
//               numbered from 0 to NUM_CODE - 1
#define M33_FP_CTRL_NUM_CODE_7_4__RESET  _u(0x8)
#define M33_FP_CTRL_NUM_CODE_7_4__BITS   _u(0x000000f0)
#define M33_FP_CTRL_NUM_CODE_7_4__MSB    _u(7)
#define M33_FP_CTRL_NUM_CODE_7_4__LSB    _u(4)
#define M33_FP_CTRL_NUM_CODE_7_4__ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_FP_CTRL_KEY
// Description : Writes to the FP_CTRL are ignored unless KEY is concurrently
//               written to one
#define M33_FP_CTRL_KEY_RESET  _u(0x0)
#define M33_FP_CTRL_KEY_BITS   _u(0x00000002)
#define M33_FP_CTRL_KEY_MSB    _u(1)
#define M33_FP_CTRL_KEY_LSB    _u(1)
#define M33_FP_CTRL_KEY_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_FP_CTRL_ENABLE
// Description : Enables the FPB
#define M33_FP_CTRL_ENABLE_RESET  _u(0x0)
#define M33_FP_CTRL_ENABLE_BITS   _u(0x00000001)
#define M33_FP_CTRL_ENABLE_MSB    _u(0)
#define M33_FP_CTRL_ENABLE_LSB    _u(0)
#define M33_FP_CTRL_ENABLE_ACCESS "RW"
// =============================================================================
// Register    : M33_FP_REMAP
// Description : Indicates whether the implementation supports Flash Patch remap
//               and, if it does, holds the target address for remap
#define M33_FP_REMAP_OFFSET _u(0x00002004)
#define M33_FP_REMAP_BITS   _u(0x3fffffe0)
#define M33_FP_REMAP_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_FP_REMAP_RMPSPT
// Description : Indicates whether the FPB unit supports the Flash Patch remap
//               function
#define M33_FP_REMAP_RMPSPT_RESET  _u(0x0)
#define M33_FP_REMAP_RMPSPT_BITS   _u(0x20000000)
#define M33_FP_REMAP_RMPSPT_MSB    _u(29)
#define M33_FP_REMAP_RMPSPT_LSB    _u(29)
#define M33_FP_REMAP_RMPSPT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_FP_REMAP_REMAP
// Description : Holds the bits[28:5] of the Flash Patch remap address
#define M33_FP_REMAP_REMAP_RESET  _u(0x000000)
