Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/m33.h
#define M33_FP_REMAP_REMAP_BITS   _u(0x1fffffe0)
#define M33_FP_REMAP_REMAP_MSB    _u(28)
#define M33_FP_REMAP_REMAP_LSB    _u(5)
#define M33_FP_REMAP_REMAP_ACCESS "RO"
// =============================================================================
// Register    : M33_FP_COMP0
// Description : Holds an address for comparison. The effect of the match
//               depends on the configuration of the FPB and whether the
//               comparator is an instruction address comparator or a literal
//               address comparator
#define M33_FP_COMP0_OFFSET _u(0x00002008)
#define M33_FP_COMP0_BITS   _u(0x00000001)
#define M33_FP_COMP0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_FP_COMP0_BE
// Description : Selects between flashpatch and breakpoint functionality
#define M33_FP_COMP0_BE_RESET  _u(0x0)
#define M33_FP_COMP0_BE_BITS   _u(0x00000001)
#define M33_FP_COMP0_BE_MSB    _u(0)
#define M33_FP_COMP0_BE_LSB    _u(0)
#define M33_FP_COMP0_BE_ACCESS "RW"
// =============================================================================
// Register    : M33_FP_COMP1
// Description : Holds an address for comparison. The effect of the match
//               depends on the configuration of the FPB and whether the
//               comparator is an instruction address comparator or a literal
//               address comparator
#define M33_FP_COMP1_OFFSET _u(0x0000200c)
#define M33_FP_COMP1_BITS   _u(0x00000001)
#define M33_FP_COMP1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_FP_COMP1_BE
// Description : Selects between flashpatch and breakpoint functionality
#define M33_FP_COMP1_BE_RESET  _u(0x0)
#define M33_FP_COMP1_BE_BITS   _u(0x00000001)
#define M33_FP_COMP1_BE_MSB    _u(0)
#define M33_FP_COMP1_BE_LSB    _u(0)
#define M33_FP_COMP1_BE_ACCESS "RW"
// =============================================================================
// Register    : M33_FP_COMP2
// Description : Holds an address for comparison. The effect of the match
//               depends on the configuration of the FPB and whether the
//               comparator is an instruction address comparator or a literal
//               address comparator
#define M33_FP_COMP2_OFFSET _u(0x00002010)
#define M33_FP_COMP2_BITS   _u(0x00000001)
#define M33_FP_COMP2_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_FP_COMP2_BE
// Description : Selects between flashpatch and breakpoint functionality
#define M33_FP_COMP2_BE_RESET  _u(0x0)
#define M33_FP_COMP2_BE_BITS   _u(0x00000001)
#define M33_FP_COMP2_BE_MSB    _u(0)
#define M33_FP_COMP2_BE_LSB    _u(0)
#define M33_FP_COMP2_BE_ACCESS "RW"
// =============================================================================
// Register    : M33_FP_COMP3
// Description : Holds an address for comparison. The effect of the match
//               depends on the configuration of the FPB and whether the
//               comparator is an instruction address comparator or a literal
//               address comparator
#define M33_FP_COMP3_OFFSET _u(0x00002014)
#define M33_FP_COMP3_BITS   _u(0x00000001)
#define M33_FP_COMP3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_FP_COMP3_BE
// Description : Selects between flashpatch and breakpoint functionality
#define M33_FP_COMP3_BE_RESET  _u(0x0)
#define M33_FP_COMP3_BE_BITS   _u(0x00000001)
#define M33_FP_COMP3_BE_MSB    _u(0)
#define M33_FP_COMP3_BE_LSB    _u(0)
#define M33_FP_COMP3_BE_ACCESS "RW"
// =============================================================================
// Register    : M33_FP_COMP4
// Description : Holds an address for comparison. The effect of the match
//               depends on the configuration of the FPB and whether the
//               comparator is an instruction address comparator or a literal
//               address comparator
#define M33_FP_COMP4_OFFSET _u(0x00002018)
#define M33_FP_COMP4_BITS   _u(0x00000001)
#define M33_FP_COMP4_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_FP_COMP4_BE
// Description : Selects between flashpatch and breakpoint functionality
#define M33_FP_COMP4_BE_RESET  _u(0x0)
#define M33_FP_COMP4_BE_BITS   _u(0x00000001)
#define M33_FP_COMP4_BE_MSB    _u(0)
#define M33_FP_COMP4_BE_LSB    _u(0)
#define M33_FP_COMP4_BE_ACCESS "RW"
// =============================================================================
// Register    : M33_FP_COMP5
// Description : Holds an address for comparison. The effect of the match
//               depends on the configuration of the FPB and whether the
//               comparator is an instruction address comparator or a literal
//               address comparator
#define M33_FP_COMP5_OFFSET _u(0x0000201c)
#define M33_FP_COMP5_BITS   _u(0x00000001)
#define M33_FP_COMP5_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_FP_COMP5_BE
// Description : Selects between flashpatch and breakpoint functionality
#define M33_FP_COMP5_BE_RESET  _u(0x0)
#define M33_FP_COMP5_BE_BITS   _u(0x00000001)
#define M33_FP_COMP5_BE_MSB    _u(0)
#define M33_FP_COMP5_BE_LSB    _u(0)
#define M33_FP_COMP5_BE_ACCESS "RW"
// =============================================================================
// Register    : M33_FP_COMP6
// Description : Holds an address for comparison. The effect of the match
//               depends on the configuration of the FPB and whether the
//               comparator is an instruction address comparator or a literal
//               address comparator
#define M33_FP_COMP6_OFFSET _u(0x00002020)
#define M33_FP_COMP6_BITS   _u(0x00000001)
#define M33_FP_COMP6_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_FP_COMP6_BE
// Description : Selects between flashpatch and breakpoint functionality
#define M33_FP_COMP6_BE_RESET  _u(0x0)
#define M33_FP_COMP6_BE_BITS   _u(0x00000001)
#define M33_FP_COMP6_BE_MSB    _u(0)
#define M33_FP_COMP6_BE_LSB    _u(0)
#define M33_FP_COMP6_BE_ACCESS "RW"
// =============================================================================
// Register    : M33_FP_COMP7
// Description : Holds an address for comparison. The effect of the match
//               depends on the configuration of the FPB and whether the
//               comparator is an instruction address comparator or a literal
//               address comparator
#define M33_FP_COMP7_OFFSET _u(0x00002024)
#define M33_FP_COMP7_BITS   _u(0x00000001)
#define M33_FP_COMP7_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_FP_COMP7_BE
// Description : Selects between flashpatch and breakpoint functionality
#define M33_FP_COMP7_BE_RESET  _u(0x0)
#define M33_FP_COMP7_BE_BITS   _u(0x00000001)
#define M33_FP_COMP7_BE_MSB    _u(0)
#define M33_FP_COMP7_BE_LSB    _u(0)
#define M33_FP_COMP7_BE_ACCESS "RW"
// =============================================================================
// Register    : M33_FP_DEVARCH
// Description : Provides CoreSight discovery information for the FPB
#define M33_FP_DEVARCH_OFFSET _u(0x00002fbc)
#define M33_FP_DEVARCH_BITS   _u(0xffffffff)
#define M33_FP_DEVARCH_RESET  _u(0x47701a03)
// -----------------------------------------------------------------------------
// Field       : M33_FP_DEVARCH_ARCHITECT
// Description : Defines the architect of the component. Bits [31:28] are the
//               JEP106 continuation code (JEP106 bank ID, minus 1) and bits
//               [27:21] are the JEP106 ID code.
#define M33_FP_DEVARCH_ARCHITECT_RESET  _u(0x23b)
#define M33_FP_DEVARCH_ARCHITECT_BITS   _u(0xffe00000)
#define M33_FP_DEVARCH_ARCHITECT_MSB    _u(31)
#define M33_FP_DEVARCH_ARCHITECT_LSB    _u(21)
#define M33_FP_DEVARCH_ARCHITECT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_FP_DEVARCH_PRESENT
// Description : Defines that the DEVARCH register is present
#define M33_FP_DEVARCH_PRESENT_RESET  _u(0x1)
#define M33_FP_DEVARCH_PRESENT_BITS   _u(0x00100000)
#define M33_FP_DEVARCH_PRESENT_MSB    _u(20)
#define M33_FP_DEVARCH_PRESENT_LSB    _u(20)
#define M33_FP_DEVARCH_PRESENT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_FP_DEVARCH_REVISION
// Description : Defines the architecture revision of the component
#define M33_FP_DEVARCH_REVISION_RESET  _u(0x0)
#define M33_FP_DEVARCH_REVISION_BITS   _u(0x000f0000)
#define M33_FP_DEVARCH_REVISION_MSB    _u(19)
#define M33_FP_DEVARCH_REVISION_LSB    _u(16)
#define M33_FP_DEVARCH_REVISION_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_FP_DEVARCH_ARCHVER
// Description : Defines the architecture version of the component
#define M33_FP_DEVARCH_ARCHVER_RESET  _u(0x1)
#define M33_FP_DEVARCH_ARCHVER_BITS   _u(0x0000f000)
#define M33_FP_DEVARCH_ARCHVER_MSB    _u(15)
#define M33_FP_DEVARCH_ARCHVER_LSB    _u(12)
#define M33_FP_DEVARCH_ARCHVER_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_FP_DEVARCH_ARCHPART
// Description : Defines the architecture of the component
#define M33_FP_DEVARCH_ARCHPART_RESET  _u(0xa03)
#define M33_FP_DEVARCH_ARCHPART_BITS   _u(0x00000fff)
#define M33_FP_DEVARCH_ARCHPART_MSB    _u(11)
#define M33_FP_DEVARCH_ARCHPART_LSB    _u(0)
#define M33_FP_DEVARCH_ARCHPART_ACCESS "RO"
// =============================================================================
// Register    : M33_FP_DEVTYPE
// Description : Provides CoreSight discovery information for the FPB
#define M33_FP_DEVTYPE_OFFSET _u(0x00002fcc)
#define M33_FP_DEVTYPE_BITS   _u(0x000000ff)
#define M33_FP_DEVTYPE_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_FP_DEVTYPE_SUB
// Description : Component sub-type
#define M33_FP_DEVTYPE_SUB_RESET  _u(0x0)
#define M33_FP_DEVTYPE_SUB_BITS   _u(0x000000f0)
#define M33_FP_DEVTYPE_SUB_MSB    _u(7)
#define M33_FP_DEVTYPE_SUB_LSB    _u(4)
#define M33_FP_DEVTYPE_SUB_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_FP_DEVTYPE_MAJOR
// Description : Component major type
#define M33_FP_DEVTYPE_MAJOR_RESET  _u(0x0)
#define M33_FP_DEVTYPE_MAJOR_BITS   _u(0x0000000f)
#define M33_FP_DEVTYPE_MAJOR_MSB    _u(3)
#define M33_FP_DEVTYPE_MAJOR_LSB    _u(0)
#define M33_FP_DEVTYPE_MAJOR_ACCESS "RO"
// =============================================================================
// Register    : M33_FP_PIDR4
// Description : Provides CoreSight discovery information for the FP
#define M33_FP_PIDR4_OFFSET _u(0x00002fd0)
#define M33_FP_PIDR4_BITS   _u(0x000000ff)
#define M33_FP_PIDR4_RESET  _u(0x00000004)
// -----------------------------------------------------------------------------
// Field       : M33_FP_PIDR4_SIZE
// Description : See CoreSight Architecture Specification
#define M33_FP_PIDR4_SIZE_RESET  _u(0x0)
#define M33_FP_PIDR4_SIZE_BITS   _u(0x000000f0)
#define M33_FP_PIDR4_SIZE_MSB    _u(7)
#define M33_FP_PIDR4_SIZE_LSB    _u(4)
#define M33_FP_PIDR4_SIZE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_FP_PIDR4_DES_2
// Description : See CoreSight Architecture Specification
#define M33_FP_PIDR4_DES_2_RESET  _u(0x4)
#define M33_FP_PIDR4_DES_2_BITS   _u(0x0000000f)
#define M33_FP_PIDR4_DES_2_MSB    _u(3)
#define M33_FP_PIDR4_DES_2_LSB    _u(0)
#define M33_FP_PIDR4_DES_2_ACCESS "RO"
// =============================================================================
// Register    : M33_FP_PIDR5
// Description : Provides CoreSight discovery information for the FP
#define M33_FP_PIDR5_OFFSET _u(0x00002fd4)
#define M33_FP_PIDR5_BITS   _u(0x00000000)
#define M33_FP_PIDR5_RESET  _u(0x00000000)
#define M33_FP_PIDR5_MSB    _u(31)
#define M33_FP_PIDR5_LSB    _u(0)
#define M33_FP_PIDR5_ACCESS "RW"
// =============================================================================
// Register    : M33_FP_PIDR6
// Description : Provides CoreSight discovery information for the FP
#define M33_FP_PIDR6_OFFSET _u(0x00002fd8)
#define M33_FP_PIDR6_BITS   _u(0x00000000)
#define M33_FP_PIDR6_RESET  _u(0x00000000)
#define M33_FP_PIDR6_MSB    _u(31)
#define M33_FP_PIDR6_LSB    _u(0)
#define M33_FP_PIDR6_ACCESS "RW"
// =============================================================================
// Register    : M33_FP_PIDR7
// Description : Provides CoreSight discovery information for the FP
#define M33_FP_PIDR7_OFFSET _u(0x00002fdc)
#define M33_FP_PIDR7_BITS   _u(0x00000000)
#define M33_FP_PIDR7_RESET  _u(0x00000000)
#define M33_FP_PIDR7_MSB    _u(31)
#define M33_FP_PIDR7_LSB    _u(0)
#define M33_FP_PIDR7_ACCESS "RW"
// =============================================================================
// Register    : M33_FP_PIDR0
// Description : Provides CoreSight discovery information for the FP
#define M33_FP_PIDR0_OFFSET _u(0x00002fe0)
#define M33_FP_PIDR0_BITS   _u(0x000000ff)
#define M33_FP_PIDR0_RESET  _u(0x00000021)
// -----------------------------------------------------------------------------
// Field       : M33_FP_PIDR0_PART_0
// Description : See CoreSight Architecture Specification
#define M33_FP_PIDR0_PART_0_RESET  _u(0x21)
#define M33_FP_PIDR0_PART_0_BITS   _u(0x000000ff)
#define M33_FP_PIDR0_PART_0_MSB    _u(7)
#define M33_FP_PIDR0_PART_0_LSB    _u(0)
#define M33_FP_PIDR0_PART_0_ACCESS "RO"
// =============================================================================
// Register    : M33_FP_PIDR1
// Description : Provides CoreSight discovery information for the FP
#define M33_FP_PIDR1_OFFSET _u(0x00002fe4)
#define M33_FP_PIDR1_BITS   _u(0x000000ff)
#define M33_FP_PIDR1_RESET  _u(0x000000bd)
// -----------------------------------------------------------------------------
// Field       : M33_FP_PIDR1_DES_0
// Description : See CoreSight Architecture Specification
#define M33_FP_PIDR1_DES_0_RESET  _u(0xb)
#define M33_FP_PIDR1_DES_0_BITS   _u(0x000000f0)
#define M33_FP_PIDR1_DES_0_MSB    _u(7)
#define M33_FP_PIDR1_DES_0_LSB    _u(4)
#define M33_FP_PIDR1_DES_0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_FP_PIDR1_PART_1
// Description : See CoreSight Architecture Specification
#define M33_FP_PIDR1_PART_1_RESET  _u(0xd)
#define M33_FP_PIDR1_PART_1_BITS   _u(0x0000000f)
#define M33_FP_PIDR1_PART_1_MSB    _u(3)
#define M33_FP_PIDR1_PART_1_LSB    _u(0)
#define M33_FP_PIDR1_PART_1_ACCESS "RO"
// =============================================================================
// Register    : M33_FP_PIDR2
// Description : Provides CoreSight discovery information for the FP
#define M33_FP_PIDR2_OFFSET _u(0x00002fe8)
#define M33_FP_PIDR2_BITS   _u(0x000000ff)
#define M33_FP_PIDR2_RESET  _u(0x0000000b)
// -----------------------------------------------------------------------------
// Field       : M33_FP_PIDR2_REVISION
// Description : See CoreSight Architecture Specification
#define M33_FP_PIDR2_REVISION_RESET  _u(0x0)
#define M33_FP_PIDR2_REVISION_BITS   _u(0x000000f0)
#define M33_FP_PIDR2_REVISION_MSB    _u(7)
#define M33_FP_PIDR2_REVISION_LSB    _u(4)
#define M33_FP_PIDR2_REVISION_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_FP_PIDR2_JEDEC
// Description : See CoreSight Architecture Specification
#define M33_FP_PIDR2_JEDEC_RESET  _u(0x1)
#define M33_FP_PIDR2_JEDEC_BITS   _u(0x00000008)
#define M33_FP_PIDR2_JEDEC_MSB    _u(3)
#define M33_FP_PIDR2_JEDEC_LSB    _u(3)
#define M33_FP_PIDR2_JEDEC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_FP_PIDR2_DES_1
// Description : See CoreSight Architecture Specification
#define M33_FP_PIDR2_DES_1_RESET  _u(0x3)
#define M33_FP_PIDR2_DES_1_BITS   _u(0x00000007)
#define M33_FP_PIDR2_DES_1_MSB    _u(2)
#define M33_FP_PIDR2_DES_1_LSB    _u(0)
#define M33_FP_PIDR2_DES_1_ACCESS "RO"
// =============================================================================
// Register    : M33_FP_PIDR3
// Description : Provides CoreSight discovery information for the FP
#define M33_FP_PIDR3_OFFSET _u(0x00002fec)
#define M33_FP_PIDR3_BITS   _u(0x000000ff)
#define M33_FP_PIDR3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_FP_PIDR3_REVAND
// Description : See CoreSight Architecture Specification
#define M33_FP_PIDR3_REVAND_RESET  _u(0x0)
#define M33_FP_PIDR3_REVAND_BITS   _u(0x000000f0)
#define M33_FP_PIDR3_REVAND_MSB    _u(7)
#define M33_FP_PIDR3_REVAND_LSB    _u(4)
#define M33_FP_PIDR3_REVAND_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_FP_PIDR3_CMOD
// Description : See CoreSight Architecture Specification
#define M33_FP_PIDR3_CMOD_RESET  _u(0x0)
#define M33_FP_PIDR3_CMOD_BITS   _u(0x0000000f)
#define M33_FP_PIDR3_CMOD_MSB    _u(3)
#define M33_FP_PIDR3_CMOD_LSB    _u(0)
#define M33_FP_PIDR3_CMOD_ACCESS "RO"
// =============================================================================
// Register    : M33_FP_CIDR0
// Description : Provides CoreSight discovery information for the FP
#define M33_FP_CIDR0_OFFSET _u(0x00002ff0)
#define M33_FP_CIDR0_BITS   _u(0x000000ff)
#define M33_FP_CIDR0_RESET  _u(0x0000000d)
// -----------------------------------------------------------------------------
// Field       : M33_FP_CIDR0_PRMBL_0
// Description : See CoreSight Architecture Specification
#define M33_FP_CIDR0_PRMBL_0_RESET  _u(0x0d)
#define M33_FP_CIDR0_PRMBL_0_BITS   _u(0x000000ff)
#define M33_FP_CIDR0_PRMBL_0_MSB    _u(7)
#define M33_FP_CIDR0_PRMBL_0_LSB    _u(0)
#define M33_FP_CIDR0_PRMBL_0_ACCESS "RO"
// =============================================================================
// Register    : M33_FP_CIDR1
// Description : Provides CoreSight discovery information for the FP
#define M33_FP_CIDR1_OFFSET _u(0x00002ff4)
#define M33_FP_CIDR1_BITS   _u(0x000000ff)
#define M33_FP_CIDR1_RESET  _u(0x00000090)
// -----------------------------------------------------------------------------
// Field       : M33_FP_CIDR1_CLASS
// Description : See CoreSight Architecture Specification
#define M33_FP_CIDR1_CLASS_RESET  _u(0x9)
#define M33_FP_CIDR1_CLASS_BITS   _u(0x000000f0)
#define M33_FP_CIDR1_CLASS_MSB    _u(7)
#define M33_FP_CIDR1_CLASS_LSB    _u(4)
#define M33_FP_CIDR1_CLASS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_FP_CIDR1_PRMBL_1
// Description : See CoreSight Architecture Specification
#define M33_FP_CIDR1_PRMBL_1_RESET  _u(0x0)
#define M33_FP_CIDR1_PRMBL_1_BITS   _u(0x0000000f)
#define M33_FP_CIDR1_PRMBL_1_MSB    _u(3)
#define M33_FP_CIDR1_PRMBL_1_LSB    _u(0)
#define M33_FP_CIDR1_PRMBL_1_ACCESS "RO"
// =============================================================================
// Register    : M33_FP_CIDR2
// Description : Provides CoreSight discovery information for the FP
#define M33_FP_CIDR2_OFFSET _u(0x00002ff8)
#define M33_FP_CIDR2_BITS   _u(0x000000ff)
#define M33_FP_CIDR2_RESET  _u(0x00000005)
// -----------------------------------------------------------------------------
// Field       : M33_FP_CIDR2_PRMBL_2
// Description : See CoreSight Architecture Specification
#define M33_FP_CIDR2_PRMBL_2_RESET  _u(0x05)
#define M33_FP_CIDR2_PRMBL_2_BITS   _u(0x000000ff)
#define M33_FP_CIDR2_PRMBL_2_MSB    _u(7)
#define M33_FP_CIDR2_PRMBL_2_LSB    _u(0)
#define M33_FP_CIDR2_PRMBL_2_ACCESS "RO"
// =============================================================================
// Register    : M33_FP_CIDR3
// Description : Provides CoreSight discovery information for the FP
#define M33_FP_CIDR3_OFFSET _u(0x00002ffc)
#define M33_FP_CIDR3_BITS   _u(0x000000ff)
#define M33_FP_CIDR3_RESET  _u(0x000000b1)
// -----------------------------------------------------------------------------
// Field       : M33_FP_CIDR3_PRMBL_3
// Description : See CoreSight Architecture Specification
#define M33_FP_CIDR3_PRMBL_3_RESET  _u(0xb1)
#define M33_FP_CIDR3_PRMBL_3_BITS   _u(0x000000ff)
#define M33_FP_CIDR3_PRMBL_3_MSB    _u(7)
#define M33_FP_CIDR3_PRMBL_3_LSB    _u(0)
#define M33_FP_CIDR3_PRMBL_3_ACCESS "RO"
// =============================================================================
// Register    : M33_ICTR
// Description : Provides information about the interrupt controller
#define M33_ICTR_OFFSET _u(0x0000e004)
#define M33_ICTR_BITS   _u(0x0000000f)
#define M33_ICTR_RESET  _u(0x00000001)
// -----------------------------------------------------------------------------
// Field       : M33_ICTR_INTLINESNUM
// Description : Indicates the number of the highest implemented register in
//               each of the NVIC control register sets, or in the case of
//               NVIC_IPR*n, 4×INTLINESNUM
#define M33_ICTR_INTLINESNUM_RESET  _u(0x1)
#define M33_ICTR_INTLINESNUM_BITS   _u(0x0000000f)
#define M33_ICTR_INTLINESNUM_MSB    _u(3)
#define M33_ICTR_INTLINESNUM_LSB    _u(0)
#define M33_ICTR_INTLINESNUM_ACCESS "RO"
// =============================================================================
// Register    : M33_ACTLR
// Description : Provides IMPLEMENTATION DEFINED configuration and control
//               options
#define M33_ACTLR_OFFSET _u(0x0000e008)
#define M33_ACTLR_BITS   _u(0x20001605)
#define M33_ACTLR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ACTLR_EXTEXCLALL
// Description : External Exclusives Allowed with no MPU
#define M33_ACTLR_EXTEXCLALL_RESET  _u(0x0)
#define M33_ACTLR_EXTEXCLALL_BITS   _u(0x20000000)
#define M33_ACTLR_EXTEXCLALL_MSB    _u(29)
#define M33_ACTLR_EXTEXCLALL_LSB    _u(29)
#define M33_ACTLR_EXTEXCLALL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_ACTLR_DISITMATBFLUSH
// Description : Disable ATB Flush
#define M33_ACTLR_DISITMATBFLUSH_RESET  _u(0x0)
#define M33_ACTLR_DISITMATBFLUSH_BITS   _u(0x00001000)
#define M33_ACTLR_DISITMATBFLUSH_MSB    _u(12)
#define M33_ACTLR_DISITMATBFLUSH_LSB    _u(12)
#define M33_ACTLR_DISITMATBFLUSH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_ACTLR_FPEXCODIS
// Description : Disable FPU exception outputs
#define M33_ACTLR_FPEXCODIS_RESET  _u(0x0)
#define M33_ACTLR_FPEXCODIS_BITS   _u(0x00000400)
#define M33_ACTLR_FPEXCODIS_MSB    _u(10)
#define M33_ACTLR_FPEXCODIS_LSB    _u(10)
#define M33_ACTLR_FPEXCODIS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_ACTLR_DISOOFP
// Description : Disable out-of-order FP instruction completion
#define M33_ACTLR_DISOOFP_RESET  _u(0x0)
#define M33_ACTLR_DISOOFP_BITS   _u(0x00000200)
#define M33_ACTLR_DISOOFP_MSB    _u(9)
#define M33_ACTLR_DISOOFP_LSB    _u(9)
#define M33_ACTLR_DISOOFP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_ACTLR_DISFOLD
// Description : Disable dual-issue.
#define M33_ACTLR_DISFOLD_RESET  _u(0x0)
#define M33_ACTLR_DISFOLD_BITS   _u(0x00000004)
#define M33_ACTLR_DISFOLD_MSB    _u(2)
#define M33_ACTLR_DISFOLD_LSB    _u(2)
#define M33_ACTLR_DISFOLD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_ACTLR_DISMCYCINT
// Description : Disable dual-issue.
