Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/m33.h
#define M33_ACTLR_DISMCYCINT_RESET  _u(0x0)
#define M33_ACTLR_DISMCYCINT_BITS   _u(0x00000001)
#define M33_ACTLR_DISMCYCINT_MSB    _u(0)
#define M33_ACTLR_DISMCYCINT_LSB    _u(0)
#define M33_ACTLR_DISMCYCINT_ACCESS "RW"
// =============================================================================
// Register    : M33_SYST_CSR
// Description : Use the SysTick Control and Status Register to enable the
//               SysTick features.
#define M33_SYST_CSR_OFFSET _u(0x0000e010)
#define M33_SYST_CSR_BITS   _u(0x00010007)
#define M33_SYST_CSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_SYST_CSR_COUNTFLAG
// Description : Returns 1 if timer counted to 0 since last time this was read.
//               Clears on read by application or debugger.
#define M33_SYST_CSR_COUNTFLAG_RESET  _u(0x0)
#define M33_SYST_CSR_COUNTFLAG_BITS   _u(0x00010000)
#define M33_SYST_CSR_COUNTFLAG_MSB    _u(16)
#define M33_SYST_CSR_COUNTFLAG_LSB    _u(16)
#define M33_SYST_CSR_COUNTFLAG_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_SYST_CSR_CLKSOURCE
// Description : SysTick clock source. Always reads as one if SYST_CALIB reports
//               NOREF.
//               Selects the SysTick timer clock source:
//               0 = External reference clock.
//               1 = Processor clock.
#define M33_SYST_CSR_CLKSOURCE_RESET  _u(0x0)
#define M33_SYST_CSR_CLKSOURCE_BITS   _u(0x00000004)
#define M33_SYST_CSR_CLKSOURCE_MSB    _u(2)
#define M33_SYST_CSR_CLKSOURCE_LSB    _u(2)
#define M33_SYST_CSR_CLKSOURCE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SYST_CSR_TICKINT
// Description : Enables SysTick exception request:
//               0 = Counting down to zero does not assert the SysTick exception
//               request.
//               1 = Counting down to zero to asserts the SysTick exception
//               request.
#define M33_SYST_CSR_TICKINT_RESET  _u(0x0)
#define M33_SYST_CSR_TICKINT_BITS   _u(0x00000002)
#define M33_SYST_CSR_TICKINT_MSB    _u(1)
#define M33_SYST_CSR_TICKINT_LSB    _u(1)
#define M33_SYST_CSR_TICKINT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SYST_CSR_ENABLE
// Description : Enable SysTick counter:
//               0 = Counter disabled.
//               1 = Counter enabled.
#define M33_SYST_CSR_ENABLE_RESET  _u(0x0)
#define M33_SYST_CSR_ENABLE_BITS   _u(0x00000001)
#define M33_SYST_CSR_ENABLE_MSB    _u(0)
#define M33_SYST_CSR_ENABLE_LSB    _u(0)
#define M33_SYST_CSR_ENABLE_ACCESS "RW"
// =============================================================================
// Register    : M33_SYST_RVR
// Description : Use the SysTick Reload Value Register to specify the start
//               value to load into the current value register when the counter
//               reaches 0. It can be any value between 0 and 0x00FFFFFF. A
//               start value of 0 is possible, but has no effect because the
//               SysTick interrupt and COUNTFLAG are activated when counting
//               from 1 to 0. The reset value of this register is UNKNOWN.
//               To generate a multi-shot timer with a period of N processor
//               clock cycles, use a RELOAD value of N-1. For example, if the
//               SysTick interrupt is required every 100 clock pulses, set
//               RELOAD to 99.
#define M33_SYST_RVR_OFFSET _u(0x0000e014)
#define M33_SYST_RVR_BITS   _u(0x00ffffff)
#define M33_SYST_RVR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_SYST_RVR_RELOAD
// Description : Value to load into the SysTick Current Value Register when the
//               counter reaches 0.
#define M33_SYST_RVR_RELOAD_RESET  _u(0x000000)
#define M33_SYST_RVR_RELOAD_BITS   _u(0x00ffffff)
#define M33_SYST_RVR_RELOAD_MSB    _u(23)
#define M33_SYST_RVR_RELOAD_LSB    _u(0)
#define M33_SYST_RVR_RELOAD_ACCESS "RW"
// =============================================================================
// Register    : M33_SYST_CVR
// Description : Use the SysTick Current Value Register to find the current
//               value in the register. The reset value of this register is
//               UNKNOWN.
#define M33_SYST_CVR_OFFSET _u(0x0000e018)
#define M33_SYST_CVR_BITS   _u(0x00ffffff)
#define M33_SYST_CVR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_SYST_CVR_CURRENT
// Description : Reads return the current value of the SysTick counter. This
//               register is write-clear. Writing to it with any value clears
//               the register to 0. Clearing this register also clears the
//               COUNTFLAG bit of the SysTick Control and Status Register.
#define M33_SYST_CVR_CURRENT_RESET  _u(0x000000)
#define M33_SYST_CVR_CURRENT_BITS   _u(0x00ffffff)
#define M33_SYST_CVR_CURRENT_MSB    _u(23)
#define M33_SYST_CVR_CURRENT_LSB    _u(0)
#define M33_SYST_CVR_CURRENT_ACCESS "RW"
// =============================================================================
// Register    : M33_SYST_CALIB
// Description : Use the SysTick Calibration Value Register to enable software
//               to scale to any required speed using divide and multiply.
#define M33_SYST_CALIB_OFFSET _u(0x0000e01c)
#define M33_SYST_CALIB_BITS   _u(0xc0ffffff)
#define M33_SYST_CALIB_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_SYST_CALIB_NOREF
// Description : If reads as 1, the Reference clock is not provided - the
//               CLKSOURCE bit of the SysTick Control and Status register will
//               be forced to 1 and cannot be cleared to 0.
#define M33_SYST_CALIB_NOREF_RESET  _u(0x0)
#define M33_SYST_CALIB_NOREF_BITS   _u(0x80000000)
#define M33_SYST_CALIB_NOREF_MSB    _u(31)
#define M33_SYST_CALIB_NOREF_LSB    _u(31)
#define M33_SYST_CALIB_NOREF_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_SYST_CALIB_SKEW
// Description : If reads as 1, the calibration value for 10ms is inexact (due
//               to clock frequency).
#define M33_SYST_CALIB_SKEW_RESET  _u(0x0)
#define M33_SYST_CALIB_SKEW_BITS   _u(0x40000000)
#define M33_SYST_CALIB_SKEW_MSB    _u(30)
#define M33_SYST_CALIB_SKEW_LSB    _u(30)
#define M33_SYST_CALIB_SKEW_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_SYST_CALIB_TENMS
// Description : An optional Reload value to be used for 10ms (100Hz) timing,
//               subject to system clock skew errors. If the value reads as 0,
//               the calibration value is not known.
#define M33_SYST_CALIB_TENMS_RESET  _u(0x000000)
#define M33_SYST_CALIB_TENMS_BITS   _u(0x00ffffff)
#define M33_SYST_CALIB_TENMS_MSB    _u(23)
#define M33_SYST_CALIB_TENMS_LSB    _u(0)
#define M33_SYST_CALIB_TENMS_ACCESS "RO"
// =============================================================================
// Register    : M33_NVIC_ISER0
// Description : Enables or reads the enabled state of each group of 32
//               interrupts
#define M33_NVIC_ISER0_OFFSET _u(0x0000e100)
#define M33_NVIC_ISER0_BITS   _u(0xffffffff)
#define M33_NVIC_ISER0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_ISER0_SETENA
// Description : For SETENA[m] in NVIC_ISER*n, indicates whether interrupt 32*n
//               + m is enabled
#define M33_NVIC_ISER0_SETENA_RESET  _u(0x00000000)
#define M33_NVIC_ISER0_SETENA_BITS   _u(0xffffffff)
#define M33_NVIC_ISER0_SETENA_MSB    _u(31)
#define M33_NVIC_ISER0_SETENA_LSB    _u(0)
#define M33_NVIC_ISER0_SETENA_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_ISER1
// Description : Enables or reads the enabled state of each group of 32
//               interrupts
#define M33_NVIC_ISER1_OFFSET _u(0x0000e104)
#define M33_NVIC_ISER1_BITS   _u(0xffffffff)
#define M33_NVIC_ISER1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_ISER1_SETENA
// Description : For SETENA[m] in NVIC_ISER*n, indicates whether interrupt 32*n
//               + m is enabled
#define M33_NVIC_ISER1_SETENA_RESET  _u(0x00000000)
#define M33_NVIC_ISER1_SETENA_BITS   _u(0xffffffff)
#define M33_NVIC_ISER1_SETENA_MSB    _u(31)
#define M33_NVIC_ISER1_SETENA_LSB    _u(0)
#define M33_NVIC_ISER1_SETENA_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_ICER0
// Description : Clears or reads the enabled state of each group of 32
//               interrupts
#define M33_NVIC_ICER0_OFFSET _u(0x0000e180)
#define M33_NVIC_ICER0_BITS   _u(0xffffffff)
#define M33_NVIC_ICER0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_ICER0_CLRENA
// Description : For CLRENA[m] in NVIC_ICER*n, indicates whether interrupt 32*n
//               + m is enabled
#define M33_NVIC_ICER0_CLRENA_RESET  _u(0x00000000)
#define M33_NVIC_ICER0_CLRENA_BITS   _u(0xffffffff)
#define M33_NVIC_ICER0_CLRENA_MSB    _u(31)
#define M33_NVIC_ICER0_CLRENA_LSB    _u(0)
#define M33_NVIC_ICER0_CLRENA_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_ICER1
// Description : Clears or reads the enabled state of each group of 32
//               interrupts
#define M33_NVIC_ICER1_OFFSET _u(0x0000e184)
#define M33_NVIC_ICER1_BITS   _u(0xffffffff)
#define M33_NVIC_ICER1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_ICER1_CLRENA
// Description : For CLRENA[m] in NVIC_ICER*n, indicates whether interrupt 32*n
//               + m is enabled
#define M33_NVIC_ICER1_CLRENA_RESET  _u(0x00000000)
#define M33_NVIC_ICER1_CLRENA_BITS   _u(0xffffffff)
#define M33_NVIC_ICER1_CLRENA_MSB    _u(31)
#define M33_NVIC_ICER1_CLRENA_LSB    _u(0)
#define M33_NVIC_ICER1_CLRENA_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_ISPR0
// Description : Enables or reads the pending state of each group of 32
//               interrupts
#define M33_NVIC_ISPR0_OFFSET _u(0x0000e200)
#define M33_NVIC_ISPR0_BITS   _u(0xffffffff)
#define M33_NVIC_ISPR0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_ISPR0_SETPEND
// Description : For SETPEND[m] in NVIC_ISPR*n, indicates whether interrupt 32*n
//               + m is pending
#define M33_NVIC_ISPR0_SETPEND_RESET  _u(0x00000000)
#define M33_NVIC_ISPR0_SETPEND_BITS   _u(0xffffffff)
#define M33_NVIC_ISPR0_SETPEND_MSB    _u(31)
#define M33_NVIC_ISPR0_SETPEND_LSB    _u(0)
#define M33_NVIC_ISPR0_SETPEND_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_ISPR1
// Description : Enables or reads the pending state of each group of 32
//               interrupts
#define M33_NVIC_ISPR1_OFFSET _u(0x0000e204)
#define M33_NVIC_ISPR1_BITS   _u(0xffffffff)
#define M33_NVIC_ISPR1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_ISPR1_SETPEND
// Description : For SETPEND[m] in NVIC_ISPR*n, indicates whether interrupt 32*n
//               + m is pending
#define M33_NVIC_ISPR1_SETPEND_RESET  _u(0x00000000)
#define M33_NVIC_ISPR1_SETPEND_BITS   _u(0xffffffff)
#define M33_NVIC_ISPR1_SETPEND_MSB    _u(31)
#define M33_NVIC_ISPR1_SETPEND_LSB    _u(0)
#define M33_NVIC_ISPR1_SETPEND_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_ICPR0
// Description : Clears or reads the pending state of each group of 32
//               interrupts
#define M33_NVIC_ICPR0_OFFSET _u(0x0000e280)
#define M33_NVIC_ICPR0_BITS   _u(0xffffffff)
#define M33_NVIC_ICPR0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_ICPR0_CLRPEND
// Description : For CLRPEND[m] in NVIC_ICPR*n, indicates whether interrupt 32*n
//               + m is pending
#define M33_NVIC_ICPR0_CLRPEND_RESET  _u(0x00000000)
#define M33_NVIC_ICPR0_CLRPEND_BITS   _u(0xffffffff)
#define M33_NVIC_ICPR0_CLRPEND_MSB    _u(31)
#define M33_NVIC_ICPR0_CLRPEND_LSB    _u(0)
#define M33_NVIC_ICPR0_CLRPEND_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_ICPR1
// Description : Clears or reads the pending state of each group of 32
//               interrupts
#define M33_NVIC_ICPR1_OFFSET _u(0x0000e284)
#define M33_NVIC_ICPR1_BITS   _u(0xffffffff)
#define M33_NVIC_ICPR1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_ICPR1_CLRPEND
// Description : For CLRPEND[m] in NVIC_ICPR*n, indicates whether interrupt 32*n
//               + m is pending
#define M33_NVIC_ICPR1_CLRPEND_RESET  _u(0x00000000)
#define M33_NVIC_ICPR1_CLRPEND_BITS   _u(0xffffffff)
#define M33_NVIC_ICPR1_CLRPEND_MSB    _u(31)
#define M33_NVIC_ICPR1_CLRPEND_LSB    _u(0)
#define M33_NVIC_ICPR1_CLRPEND_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_IABR0
// Description : For each group of 32 interrupts, shows the active state of each
//               interrupt
#define M33_NVIC_IABR0_OFFSET _u(0x0000e300)
#define M33_NVIC_IABR0_BITS   _u(0xffffffff)
#define M33_NVIC_IABR0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IABR0_ACTIVE
// Description : For ACTIVE[m] in NVIC_IABR*n, indicates the active state for
//               interrupt 32*n+m
#define M33_NVIC_IABR0_ACTIVE_RESET  _u(0x00000000)
#define M33_NVIC_IABR0_ACTIVE_BITS   _u(0xffffffff)
#define M33_NVIC_IABR0_ACTIVE_MSB    _u(31)
#define M33_NVIC_IABR0_ACTIVE_LSB    _u(0)
#define M33_NVIC_IABR0_ACTIVE_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_IABR1
// Description : For each group of 32 interrupts, shows the active state of each
//               interrupt
#define M33_NVIC_IABR1_OFFSET _u(0x0000e304)
#define M33_NVIC_IABR1_BITS   _u(0xffffffff)
#define M33_NVIC_IABR1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IABR1_ACTIVE
// Description : For ACTIVE[m] in NVIC_IABR*n, indicates the active state for
//               interrupt 32*n+m
#define M33_NVIC_IABR1_ACTIVE_RESET  _u(0x00000000)
#define M33_NVIC_IABR1_ACTIVE_BITS   _u(0xffffffff)
#define M33_NVIC_IABR1_ACTIVE_MSB    _u(31)
#define M33_NVIC_IABR1_ACTIVE_LSB    _u(0)
#define M33_NVIC_IABR1_ACTIVE_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_ITNS0
// Description : For each group of 32 interrupts, determines whether each
//               interrupt targets Non-secure or Secure state
#define M33_NVIC_ITNS0_OFFSET _u(0x0000e380)
#define M33_NVIC_ITNS0_BITS   _u(0xffffffff)
#define M33_NVIC_ITNS0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_ITNS0_ITNS
// Description : For ITNS[m] in NVIC_ITNS*n, `IAAMO the target Security state
//               for interrupt 32*n+m
#define M33_NVIC_ITNS0_ITNS_RESET  _u(0x00000000)
#define M33_NVIC_ITNS0_ITNS_BITS   _u(0xffffffff)
#define M33_NVIC_ITNS0_ITNS_MSB    _u(31)
#define M33_NVIC_ITNS0_ITNS_LSB    _u(0)
#define M33_NVIC_ITNS0_ITNS_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_ITNS1
// Description : For each group of 32 interrupts, determines whether each
//               interrupt targets Non-secure or Secure state
#define M33_NVIC_ITNS1_OFFSET _u(0x0000e384)
#define M33_NVIC_ITNS1_BITS   _u(0xffffffff)
#define M33_NVIC_ITNS1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_ITNS1_ITNS
// Description : For ITNS[m] in NVIC_ITNS*n, `IAAMO the target Security state
//               for interrupt 32*n+m
#define M33_NVIC_ITNS1_ITNS_RESET  _u(0x00000000)
#define M33_NVIC_ITNS1_ITNS_BITS   _u(0xffffffff)
#define M33_NVIC_ITNS1_ITNS_MSB    _u(31)
#define M33_NVIC_ITNS1_ITNS_LSB    _u(0)
#define M33_NVIC_ITNS1_ITNS_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_IPR0
// Description : Sets or reads interrupt priorities
#define M33_NVIC_IPR0_OFFSET _u(0x0000e400)
#define M33_NVIC_IPR0_BITS   _u(0xf0f0f0f0)
#define M33_NVIC_IPR0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR0_PRI_N3
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR0_PRI_N3_RESET  _u(0x0)
#define M33_NVIC_IPR0_PRI_N3_BITS   _u(0xf0000000)
#define M33_NVIC_IPR0_PRI_N3_MSB    _u(31)
#define M33_NVIC_IPR0_PRI_N3_LSB    _u(28)
#define M33_NVIC_IPR0_PRI_N3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR0_PRI_N2
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR0_PRI_N2_RESET  _u(0x0)
#define M33_NVIC_IPR0_PRI_N2_BITS   _u(0x00f00000)
#define M33_NVIC_IPR0_PRI_N2_MSB    _u(23)
#define M33_NVIC_IPR0_PRI_N2_LSB    _u(20)
#define M33_NVIC_IPR0_PRI_N2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR0_PRI_N1
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR0_PRI_N1_RESET  _u(0x0)
#define M33_NVIC_IPR0_PRI_N1_BITS   _u(0x0000f000)
#define M33_NVIC_IPR0_PRI_N1_MSB    _u(15)
#define M33_NVIC_IPR0_PRI_N1_LSB    _u(12)
#define M33_NVIC_IPR0_PRI_N1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR0_PRI_N0
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR0_PRI_N0_RESET  _u(0x0)
#define M33_NVIC_IPR0_PRI_N0_BITS   _u(0x000000f0)
#define M33_NVIC_IPR0_PRI_N0_MSB    _u(7)
#define M33_NVIC_IPR0_PRI_N0_LSB    _u(4)
#define M33_NVIC_IPR0_PRI_N0_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_IPR1
// Description : Sets or reads interrupt priorities
#define M33_NVIC_IPR1_OFFSET _u(0x0000e404)
#define M33_NVIC_IPR1_BITS   _u(0xf0f0f0f0)
#define M33_NVIC_IPR1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR1_PRI_N3
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR1_PRI_N3_RESET  _u(0x0)
#define M33_NVIC_IPR1_PRI_N3_BITS   _u(0xf0000000)
#define M33_NVIC_IPR1_PRI_N3_MSB    _u(31)
#define M33_NVIC_IPR1_PRI_N3_LSB    _u(28)
#define M33_NVIC_IPR1_PRI_N3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR1_PRI_N2
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR1_PRI_N2_RESET  _u(0x0)
#define M33_NVIC_IPR1_PRI_N2_BITS   _u(0x00f00000)
#define M33_NVIC_IPR1_PRI_N2_MSB    _u(23)
#define M33_NVIC_IPR1_PRI_N2_LSB    _u(20)
#define M33_NVIC_IPR1_PRI_N2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR1_PRI_N1
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR1_PRI_N1_RESET  _u(0x0)
#define M33_NVIC_IPR1_PRI_N1_BITS   _u(0x0000f000)
#define M33_NVIC_IPR1_PRI_N1_MSB    _u(15)
#define M33_NVIC_IPR1_PRI_N1_LSB    _u(12)
#define M33_NVIC_IPR1_PRI_N1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR1_PRI_N0
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR1_PRI_N0_RESET  _u(0x0)
#define M33_NVIC_IPR1_PRI_N0_BITS   _u(0x000000f0)
#define M33_NVIC_IPR1_PRI_N0_MSB    _u(7)
#define M33_NVIC_IPR1_PRI_N0_LSB    _u(4)
#define M33_NVIC_IPR1_PRI_N0_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_IPR2
// Description : Sets or reads interrupt priorities
#define M33_NVIC_IPR2_OFFSET _u(0x0000e408)
#define M33_NVIC_IPR2_BITS   _u(0xf0f0f0f0)
#define M33_NVIC_IPR2_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR2_PRI_N3
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR2_PRI_N3_RESET  _u(0x0)
#define M33_NVIC_IPR2_PRI_N3_BITS   _u(0xf0000000)
#define M33_NVIC_IPR2_PRI_N3_MSB    _u(31)
#define M33_NVIC_IPR2_PRI_N3_LSB    _u(28)
#define M33_NVIC_IPR2_PRI_N3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR2_PRI_N2
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR2_PRI_N2_RESET  _u(0x0)
#define M33_NVIC_IPR2_PRI_N2_BITS   _u(0x00f00000)
#define M33_NVIC_IPR2_PRI_N2_MSB    _u(23)
#define M33_NVIC_IPR2_PRI_N2_LSB    _u(20)
#define M33_NVIC_IPR2_PRI_N2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR2_PRI_N1
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR2_PRI_N1_RESET  _u(0x0)
#define M33_NVIC_IPR2_PRI_N1_BITS   _u(0x0000f000)
#define M33_NVIC_IPR2_PRI_N1_MSB    _u(15)
#define M33_NVIC_IPR2_PRI_N1_LSB    _u(12)
#define M33_NVIC_IPR2_PRI_N1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR2_PRI_N0
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR2_PRI_N0_RESET  _u(0x0)
#define M33_NVIC_IPR2_PRI_N0_BITS   _u(0x000000f0)
#define M33_NVIC_IPR2_PRI_N0_MSB    _u(7)
#define M33_NVIC_IPR2_PRI_N0_LSB    _u(4)
#define M33_NVIC_IPR2_PRI_N0_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_IPR3
// Description : Sets or reads interrupt priorities
#define M33_NVIC_IPR3_OFFSET _u(0x0000e40c)
