Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/m33.h
#define M33_NVIC_IPR3_BITS   _u(0xf0f0f0f0)
#define M33_NVIC_IPR3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR3_PRI_N3
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR3_PRI_N3_RESET  _u(0x0)
#define M33_NVIC_IPR3_PRI_N3_BITS   _u(0xf0000000)
#define M33_NVIC_IPR3_PRI_N3_MSB    _u(31)
#define M33_NVIC_IPR3_PRI_N3_LSB    _u(28)
#define M33_NVIC_IPR3_PRI_N3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR3_PRI_N2
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR3_PRI_N2_RESET  _u(0x0)
#define M33_NVIC_IPR3_PRI_N2_BITS   _u(0x00f00000)
#define M33_NVIC_IPR3_PRI_N2_MSB    _u(23)
#define M33_NVIC_IPR3_PRI_N2_LSB    _u(20)
#define M33_NVIC_IPR3_PRI_N2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR3_PRI_N1
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR3_PRI_N1_RESET  _u(0x0)
#define M33_NVIC_IPR3_PRI_N1_BITS   _u(0x0000f000)
#define M33_NVIC_IPR3_PRI_N1_MSB    _u(15)
#define M33_NVIC_IPR3_PRI_N1_LSB    _u(12)
#define M33_NVIC_IPR3_PRI_N1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR3_PRI_N0
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR3_PRI_N0_RESET  _u(0x0)
#define M33_NVIC_IPR3_PRI_N0_BITS   _u(0x000000f0)
#define M33_NVIC_IPR3_PRI_N0_MSB    _u(7)
#define M33_NVIC_IPR3_PRI_N0_LSB    _u(4)
#define M33_NVIC_IPR3_PRI_N0_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_IPR4
// Description : Sets or reads interrupt priorities
#define M33_NVIC_IPR4_OFFSET _u(0x0000e410)
#define M33_NVIC_IPR4_BITS   _u(0xf0f0f0f0)
#define M33_NVIC_IPR4_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR4_PRI_N3
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR4_PRI_N3_RESET  _u(0x0)
#define M33_NVIC_IPR4_PRI_N3_BITS   _u(0xf0000000)
#define M33_NVIC_IPR4_PRI_N3_MSB    _u(31)
#define M33_NVIC_IPR4_PRI_N3_LSB    _u(28)
#define M33_NVIC_IPR4_PRI_N3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR4_PRI_N2
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR4_PRI_N2_RESET  _u(0x0)
#define M33_NVIC_IPR4_PRI_N2_BITS   _u(0x00f00000)
#define M33_NVIC_IPR4_PRI_N2_MSB    _u(23)
#define M33_NVIC_IPR4_PRI_N2_LSB    _u(20)
#define M33_NVIC_IPR4_PRI_N2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR4_PRI_N1
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR4_PRI_N1_RESET  _u(0x0)
#define M33_NVIC_IPR4_PRI_N1_BITS   _u(0x0000f000)
#define M33_NVIC_IPR4_PRI_N1_MSB    _u(15)
#define M33_NVIC_IPR4_PRI_N1_LSB    _u(12)
#define M33_NVIC_IPR4_PRI_N1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR4_PRI_N0
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR4_PRI_N0_RESET  _u(0x0)
#define M33_NVIC_IPR4_PRI_N0_BITS   _u(0x000000f0)
#define M33_NVIC_IPR4_PRI_N0_MSB    _u(7)
#define M33_NVIC_IPR4_PRI_N0_LSB    _u(4)
#define M33_NVIC_IPR4_PRI_N0_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_IPR5
// Description : Sets or reads interrupt priorities
#define M33_NVIC_IPR5_OFFSET _u(0x0000e414)
#define M33_NVIC_IPR5_BITS   _u(0xf0f0f0f0)
#define M33_NVIC_IPR5_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR5_PRI_N3
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR5_PRI_N3_RESET  _u(0x0)
#define M33_NVIC_IPR5_PRI_N3_BITS   _u(0xf0000000)
#define M33_NVIC_IPR5_PRI_N3_MSB    _u(31)
#define M33_NVIC_IPR5_PRI_N3_LSB    _u(28)
#define M33_NVIC_IPR5_PRI_N3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR5_PRI_N2
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR5_PRI_N2_RESET  _u(0x0)
#define M33_NVIC_IPR5_PRI_N2_BITS   _u(0x00f00000)
#define M33_NVIC_IPR5_PRI_N2_MSB    _u(23)
#define M33_NVIC_IPR5_PRI_N2_LSB    _u(20)
#define M33_NVIC_IPR5_PRI_N2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR5_PRI_N1
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR5_PRI_N1_RESET  _u(0x0)
#define M33_NVIC_IPR5_PRI_N1_BITS   _u(0x0000f000)
#define M33_NVIC_IPR5_PRI_N1_MSB    _u(15)
#define M33_NVIC_IPR5_PRI_N1_LSB    _u(12)
#define M33_NVIC_IPR5_PRI_N1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR5_PRI_N0
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR5_PRI_N0_RESET  _u(0x0)
#define M33_NVIC_IPR5_PRI_N0_BITS   _u(0x000000f0)
#define M33_NVIC_IPR5_PRI_N0_MSB    _u(7)
#define M33_NVIC_IPR5_PRI_N0_LSB    _u(4)
#define M33_NVIC_IPR5_PRI_N0_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_IPR6
// Description : Sets or reads interrupt priorities
#define M33_NVIC_IPR6_OFFSET _u(0x0000e418)
#define M33_NVIC_IPR6_BITS   _u(0xf0f0f0f0)
#define M33_NVIC_IPR6_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR6_PRI_N3
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR6_PRI_N3_RESET  _u(0x0)
#define M33_NVIC_IPR6_PRI_N3_BITS   _u(0xf0000000)
#define M33_NVIC_IPR6_PRI_N3_MSB    _u(31)
#define M33_NVIC_IPR6_PRI_N3_LSB    _u(28)
#define M33_NVIC_IPR6_PRI_N3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR6_PRI_N2
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR6_PRI_N2_RESET  _u(0x0)
#define M33_NVIC_IPR6_PRI_N2_BITS   _u(0x00f00000)
#define M33_NVIC_IPR6_PRI_N2_MSB    _u(23)
#define M33_NVIC_IPR6_PRI_N2_LSB    _u(20)
#define M33_NVIC_IPR6_PRI_N2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR6_PRI_N1
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR6_PRI_N1_RESET  _u(0x0)
#define M33_NVIC_IPR6_PRI_N1_BITS   _u(0x0000f000)
#define M33_NVIC_IPR6_PRI_N1_MSB    _u(15)
#define M33_NVIC_IPR6_PRI_N1_LSB    _u(12)
#define M33_NVIC_IPR6_PRI_N1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR6_PRI_N0
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR6_PRI_N0_RESET  _u(0x0)
#define M33_NVIC_IPR6_PRI_N0_BITS   _u(0x000000f0)
#define M33_NVIC_IPR6_PRI_N0_MSB    _u(7)
#define M33_NVIC_IPR6_PRI_N0_LSB    _u(4)
#define M33_NVIC_IPR6_PRI_N0_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_IPR7
// Description : Sets or reads interrupt priorities
#define M33_NVIC_IPR7_OFFSET _u(0x0000e41c)
#define M33_NVIC_IPR7_BITS   _u(0xf0f0f0f0)
#define M33_NVIC_IPR7_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR7_PRI_N3
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR7_PRI_N3_RESET  _u(0x0)
#define M33_NVIC_IPR7_PRI_N3_BITS   _u(0xf0000000)
#define M33_NVIC_IPR7_PRI_N3_MSB    _u(31)
#define M33_NVIC_IPR7_PRI_N3_LSB    _u(28)
#define M33_NVIC_IPR7_PRI_N3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR7_PRI_N2
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR7_PRI_N2_RESET  _u(0x0)
#define M33_NVIC_IPR7_PRI_N2_BITS   _u(0x00f00000)
#define M33_NVIC_IPR7_PRI_N2_MSB    _u(23)
#define M33_NVIC_IPR7_PRI_N2_LSB    _u(20)
#define M33_NVIC_IPR7_PRI_N2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR7_PRI_N1
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR7_PRI_N1_RESET  _u(0x0)
#define M33_NVIC_IPR7_PRI_N1_BITS   _u(0x0000f000)
#define M33_NVIC_IPR7_PRI_N1_MSB    _u(15)
#define M33_NVIC_IPR7_PRI_N1_LSB    _u(12)
#define M33_NVIC_IPR7_PRI_N1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR7_PRI_N0
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR7_PRI_N0_RESET  _u(0x0)
#define M33_NVIC_IPR7_PRI_N0_BITS   _u(0x000000f0)
#define M33_NVIC_IPR7_PRI_N0_MSB    _u(7)
#define M33_NVIC_IPR7_PRI_N0_LSB    _u(4)
#define M33_NVIC_IPR7_PRI_N0_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_IPR8
// Description : Sets or reads interrupt priorities
#define M33_NVIC_IPR8_OFFSET _u(0x0000e420)
#define M33_NVIC_IPR8_BITS   _u(0xf0f0f0f0)
#define M33_NVIC_IPR8_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR8_PRI_N3
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR8_PRI_N3_RESET  _u(0x0)
#define M33_NVIC_IPR8_PRI_N3_BITS   _u(0xf0000000)
#define M33_NVIC_IPR8_PRI_N3_MSB    _u(31)
#define M33_NVIC_IPR8_PRI_N3_LSB    _u(28)
#define M33_NVIC_IPR8_PRI_N3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR8_PRI_N2
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR8_PRI_N2_RESET  _u(0x0)
#define M33_NVIC_IPR8_PRI_N2_BITS   _u(0x00f00000)
#define M33_NVIC_IPR8_PRI_N2_MSB    _u(23)
#define M33_NVIC_IPR8_PRI_N2_LSB    _u(20)
#define M33_NVIC_IPR8_PRI_N2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR8_PRI_N1
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR8_PRI_N1_RESET  _u(0x0)
#define M33_NVIC_IPR8_PRI_N1_BITS   _u(0x0000f000)
#define M33_NVIC_IPR8_PRI_N1_MSB    _u(15)
#define M33_NVIC_IPR8_PRI_N1_LSB    _u(12)
#define M33_NVIC_IPR8_PRI_N1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR8_PRI_N0
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR8_PRI_N0_RESET  _u(0x0)
#define M33_NVIC_IPR8_PRI_N0_BITS   _u(0x000000f0)
#define M33_NVIC_IPR8_PRI_N0_MSB    _u(7)
#define M33_NVIC_IPR8_PRI_N0_LSB    _u(4)
#define M33_NVIC_IPR8_PRI_N0_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_IPR9
// Description : Sets or reads interrupt priorities
#define M33_NVIC_IPR9_OFFSET _u(0x0000e424)
#define M33_NVIC_IPR9_BITS   _u(0xf0f0f0f0)
#define M33_NVIC_IPR9_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR9_PRI_N3
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR9_PRI_N3_RESET  _u(0x0)
#define M33_NVIC_IPR9_PRI_N3_BITS   _u(0xf0000000)
#define M33_NVIC_IPR9_PRI_N3_MSB    _u(31)
#define M33_NVIC_IPR9_PRI_N3_LSB    _u(28)
#define M33_NVIC_IPR9_PRI_N3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR9_PRI_N2
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR9_PRI_N2_RESET  _u(0x0)
#define M33_NVIC_IPR9_PRI_N2_BITS   _u(0x00f00000)
#define M33_NVIC_IPR9_PRI_N2_MSB    _u(23)
#define M33_NVIC_IPR9_PRI_N2_LSB    _u(20)
#define M33_NVIC_IPR9_PRI_N2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR9_PRI_N1
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR9_PRI_N1_RESET  _u(0x0)
#define M33_NVIC_IPR9_PRI_N1_BITS   _u(0x0000f000)
#define M33_NVIC_IPR9_PRI_N1_MSB    _u(15)
#define M33_NVIC_IPR9_PRI_N1_LSB    _u(12)
#define M33_NVIC_IPR9_PRI_N1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR9_PRI_N0
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR9_PRI_N0_RESET  _u(0x0)
#define M33_NVIC_IPR9_PRI_N0_BITS   _u(0x000000f0)
#define M33_NVIC_IPR9_PRI_N0_MSB    _u(7)
#define M33_NVIC_IPR9_PRI_N0_LSB    _u(4)
#define M33_NVIC_IPR9_PRI_N0_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_IPR10
// Description : Sets or reads interrupt priorities
#define M33_NVIC_IPR10_OFFSET _u(0x0000e428)
#define M33_NVIC_IPR10_BITS   _u(0xf0f0f0f0)
#define M33_NVIC_IPR10_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR10_PRI_N3
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR10_PRI_N3_RESET  _u(0x0)
#define M33_NVIC_IPR10_PRI_N3_BITS   _u(0xf0000000)
#define M33_NVIC_IPR10_PRI_N3_MSB    _u(31)
#define M33_NVIC_IPR10_PRI_N3_LSB    _u(28)
#define M33_NVIC_IPR10_PRI_N3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR10_PRI_N2
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR10_PRI_N2_RESET  _u(0x0)
#define M33_NVIC_IPR10_PRI_N2_BITS   _u(0x00f00000)
#define M33_NVIC_IPR10_PRI_N2_MSB    _u(23)
#define M33_NVIC_IPR10_PRI_N2_LSB    _u(20)
#define M33_NVIC_IPR10_PRI_N2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR10_PRI_N1
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR10_PRI_N1_RESET  _u(0x0)
#define M33_NVIC_IPR10_PRI_N1_BITS   _u(0x0000f000)
#define M33_NVIC_IPR10_PRI_N1_MSB    _u(15)
#define M33_NVIC_IPR10_PRI_N1_LSB    _u(12)
#define M33_NVIC_IPR10_PRI_N1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR10_PRI_N0
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR10_PRI_N0_RESET  _u(0x0)
#define M33_NVIC_IPR10_PRI_N0_BITS   _u(0x000000f0)
#define M33_NVIC_IPR10_PRI_N0_MSB    _u(7)
#define M33_NVIC_IPR10_PRI_N0_LSB    _u(4)
#define M33_NVIC_IPR10_PRI_N0_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_IPR11
// Description : Sets or reads interrupt priorities
#define M33_NVIC_IPR11_OFFSET _u(0x0000e42c)
#define M33_NVIC_IPR11_BITS   _u(0xf0f0f0f0)
#define M33_NVIC_IPR11_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR11_PRI_N3
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR11_PRI_N3_RESET  _u(0x0)
#define M33_NVIC_IPR11_PRI_N3_BITS   _u(0xf0000000)
#define M33_NVIC_IPR11_PRI_N3_MSB    _u(31)
#define M33_NVIC_IPR11_PRI_N3_LSB    _u(28)
#define M33_NVIC_IPR11_PRI_N3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR11_PRI_N2
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR11_PRI_N2_RESET  _u(0x0)
#define M33_NVIC_IPR11_PRI_N2_BITS   _u(0x00f00000)
#define M33_NVIC_IPR11_PRI_N2_MSB    _u(23)
#define M33_NVIC_IPR11_PRI_N2_LSB    _u(20)
#define M33_NVIC_IPR11_PRI_N2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR11_PRI_N1
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR11_PRI_N1_RESET  _u(0x0)
#define M33_NVIC_IPR11_PRI_N1_BITS   _u(0x0000f000)
#define M33_NVIC_IPR11_PRI_N1_MSB    _u(15)
#define M33_NVIC_IPR11_PRI_N1_LSB    _u(12)
#define M33_NVIC_IPR11_PRI_N1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR11_PRI_N0
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR11_PRI_N0_RESET  _u(0x0)
#define M33_NVIC_IPR11_PRI_N0_BITS   _u(0x000000f0)
#define M33_NVIC_IPR11_PRI_N0_MSB    _u(7)
#define M33_NVIC_IPR11_PRI_N0_LSB    _u(4)
#define M33_NVIC_IPR11_PRI_N0_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_IPR12
// Description : Sets or reads interrupt priorities
#define M33_NVIC_IPR12_OFFSET _u(0x0000e430)
#define M33_NVIC_IPR12_BITS   _u(0xf0f0f0f0)
#define M33_NVIC_IPR12_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR12_PRI_N3
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR12_PRI_N3_RESET  _u(0x0)
#define M33_NVIC_IPR12_PRI_N3_BITS   _u(0xf0000000)
#define M33_NVIC_IPR12_PRI_N3_MSB    _u(31)
#define M33_NVIC_IPR12_PRI_N3_LSB    _u(28)
#define M33_NVIC_IPR12_PRI_N3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR12_PRI_N2
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR12_PRI_N2_RESET  _u(0x0)
#define M33_NVIC_IPR12_PRI_N2_BITS   _u(0x00f00000)
#define M33_NVIC_IPR12_PRI_N2_MSB    _u(23)
#define M33_NVIC_IPR12_PRI_N2_LSB    _u(20)
#define M33_NVIC_IPR12_PRI_N2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR12_PRI_N1
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR12_PRI_N1_RESET  _u(0x0)
#define M33_NVIC_IPR12_PRI_N1_BITS   _u(0x0000f000)
#define M33_NVIC_IPR12_PRI_N1_MSB    _u(15)
#define M33_NVIC_IPR12_PRI_N1_LSB    _u(12)
#define M33_NVIC_IPR12_PRI_N1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR12_PRI_N0
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR12_PRI_N0_RESET  _u(0x0)
#define M33_NVIC_IPR12_PRI_N0_BITS   _u(0x000000f0)
#define M33_NVIC_IPR12_PRI_N0_MSB    _u(7)
#define M33_NVIC_IPR12_PRI_N0_LSB    _u(4)
#define M33_NVIC_IPR12_PRI_N0_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_IPR13
// Description : Sets or reads interrupt priorities
#define M33_NVIC_IPR13_OFFSET _u(0x0000e434)
#define M33_NVIC_IPR13_BITS   _u(0xf0f0f0f0)
#define M33_NVIC_IPR13_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR13_PRI_N3
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR13_PRI_N3_RESET  _u(0x0)
#define M33_NVIC_IPR13_PRI_N3_BITS   _u(0xf0000000)
#define M33_NVIC_IPR13_PRI_N3_MSB    _u(31)
#define M33_NVIC_IPR13_PRI_N3_LSB    _u(28)
#define M33_NVIC_IPR13_PRI_N3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR13_PRI_N2
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR13_PRI_N2_RESET  _u(0x0)
#define M33_NVIC_IPR13_PRI_N2_BITS   _u(0x00f00000)
#define M33_NVIC_IPR13_PRI_N2_MSB    _u(23)
#define M33_NVIC_IPR13_PRI_N2_LSB    _u(20)
#define M33_NVIC_IPR13_PRI_N2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR13_PRI_N1
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
