Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/m33.h
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR13_PRI_N1_RESET  _u(0x0)
#define M33_NVIC_IPR13_PRI_N1_BITS   _u(0x0000f000)
#define M33_NVIC_IPR13_PRI_N1_MSB    _u(15)
#define M33_NVIC_IPR13_PRI_N1_LSB    _u(12)
#define M33_NVIC_IPR13_PRI_N1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR13_PRI_N0
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR13_PRI_N0_RESET  _u(0x0)
#define M33_NVIC_IPR13_PRI_N0_BITS   _u(0x000000f0)
#define M33_NVIC_IPR13_PRI_N0_MSB    _u(7)
#define M33_NVIC_IPR13_PRI_N0_LSB    _u(4)
#define M33_NVIC_IPR13_PRI_N0_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_IPR14
// Description : Sets or reads interrupt priorities
#define M33_NVIC_IPR14_OFFSET _u(0x0000e438)
#define M33_NVIC_IPR14_BITS   _u(0xf0f0f0f0)
#define M33_NVIC_IPR14_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR14_PRI_N3
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR14_PRI_N3_RESET  _u(0x0)
#define M33_NVIC_IPR14_PRI_N3_BITS   _u(0xf0000000)
#define M33_NVIC_IPR14_PRI_N3_MSB    _u(31)
#define M33_NVIC_IPR14_PRI_N3_LSB    _u(28)
#define M33_NVIC_IPR14_PRI_N3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR14_PRI_N2
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR14_PRI_N2_RESET  _u(0x0)
#define M33_NVIC_IPR14_PRI_N2_BITS   _u(0x00f00000)
#define M33_NVIC_IPR14_PRI_N2_MSB    _u(23)
#define M33_NVIC_IPR14_PRI_N2_LSB    _u(20)
#define M33_NVIC_IPR14_PRI_N2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR14_PRI_N1
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR14_PRI_N1_RESET  _u(0x0)
#define M33_NVIC_IPR14_PRI_N1_BITS   _u(0x0000f000)
#define M33_NVIC_IPR14_PRI_N1_MSB    _u(15)
#define M33_NVIC_IPR14_PRI_N1_LSB    _u(12)
#define M33_NVIC_IPR14_PRI_N1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR14_PRI_N0
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR14_PRI_N0_RESET  _u(0x0)
#define M33_NVIC_IPR14_PRI_N0_BITS   _u(0x000000f0)
#define M33_NVIC_IPR14_PRI_N0_MSB    _u(7)
#define M33_NVIC_IPR14_PRI_N0_LSB    _u(4)
#define M33_NVIC_IPR14_PRI_N0_ACCESS "RW"
// =============================================================================
// Register    : M33_NVIC_IPR15
// Description : Sets or reads interrupt priorities
#define M33_NVIC_IPR15_OFFSET _u(0x0000e43c)
#define M33_NVIC_IPR15_BITS   _u(0xf0f0f0f0)
#define M33_NVIC_IPR15_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR15_PRI_N3
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR15_PRI_N3_RESET  _u(0x0)
#define M33_NVIC_IPR15_PRI_N3_BITS   _u(0xf0000000)
#define M33_NVIC_IPR15_PRI_N3_MSB    _u(31)
#define M33_NVIC_IPR15_PRI_N3_LSB    _u(28)
#define M33_NVIC_IPR15_PRI_N3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR15_PRI_N2
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR15_PRI_N2_RESET  _u(0x0)
#define M33_NVIC_IPR15_PRI_N2_BITS   _u(0x00f00000)
#define M33_NVIC_IPR15_PRI_N2_MSB    _u(23)
#define M33_NVIC_IPR15_PRI_N2_LSB    _u(20)
#define M33_NVIC_IPR15_PRI_N2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR15_PRI_N1
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR15_PRI_N1_RESET  _u(0x0)
#define M33_NVIC_IPR15_PRI_N1_BITS   _u(0x0000f000)
#define M33_NVIC_IPR15_PRI_N1_MSB    _u(15)
#define M33_NVIC_IPR15_PRI_N1_LSB    _u(12)
#define M33_NVIC_IPR15_PRI_N1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NVIC_IPR15_PRI_N0
// Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
//               or RES0 if the PE does not implement this interrupt
#define M33_NVIC_IPR15_PRI_N0_RESET  _u(0x0)
#define M33_NVIC_IPR15_PRI_N0_BITS   _u(0x000000f0)
#define M33_NVIC_IPR15_PRI_N0_MSB    _u(7)
#define M33_NVIC_IPR15_PRI_N0_LSB    _u(4)
#define M33_NVIC_IPR15_PRI_N0_ACCESS "RW"
// =============================================================================
// Register    : M33_CPUID
// Description : Provides identification information for the PE, including an
//               implementer code for the device and a device ID number
#define M33_CPUID_OFFSET _u(0x0000ed00)
#define M33_CPUID_BITS   _u(0xffffffff)
#define M33_CPUID_RESET  _u(0x411fd210)
// -----------------------------------------------------------------------------
// Field       : M33_CPUID_IMPLEMENTER
// Description : This field must hold an implementer code that has been assigned
//               by ARM
#define M33_CPUID_IMPLEMENTER_RESET  _u(0x41)
#define M33_CPUID_IMPLEMENTER_BITS   _u(0xff000000)
#define M33_CPUID_IMPLEMENTER_MSB    _u(31)
#define M33_CPUID_IMPLEMENTER_LSB    _u(24)
#define M33_CPUID_IMPLEMENTER_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_CPUID_VARIANT
// Description : IMPLEMENTATION DEFINED variant number. Typically, this field is
//               used to distinguish between different product variants, or
//               major revisions of a product
#define M33_CPUID_VARIANT_RESET  _u(0x1)
#define M33_CPUID_VARIANT_BITS   _u(0x00f00000)
#define M33_CPUID_VARIANT_MSB    _u(23)
#define M33_CPUID_VARIANT_LSB    _u(20)
#define M33_CPUID_VARIANT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_CPUID_ARCHITECTURE
// Description : Defines the Architecture implemented by the PE
#define M33_CPUID_ARCHITECTURE_RESET  _u(0xf)
#define M33_CPUID_ARCHITECTURE_BITS   _u(0x000f0000)
#define M33_CPUID_ARCHITECTURE_MSB    _u(19)
#define M33_CPUID_ARCHITECTURE_LSB    _u(16)
#define M33_CPUID_ARCHITECTURE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_CPUID_PARTNO
// Description : IMPLEMENTATION DEFINED primary part number for the device
#define M33_CPUID_PARTNO_RESET  _u(0xd21)
#define M33_CPUID_PARTNO_BITS   _u(0x0000fff0)
#define M33_CPUID_PARTNO_MSB    _u(15)
#define M33_CPUID_PARTNO_LSB    _u(4)
#define M33_CPUID_PARTNO_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_CPUID_REVISION
// Description : IMPLEMENTATION DEFINED revision number for the device
#define M33_CPUID_REVISION_RESET  _u(0x0)
#define M33_CPUID_REVISION_BITS   _u(0x0000000f)
#define M33_CPUID_REVISION_MSB    _u(3)
#define M33_CPUID_REVISION_LSB    _u(0)
#define M33_CPUID_REVISION_ACCESS "RO"
// =============================================================================
// Register    : M33_ICSR
// Description : Controls and provides status information for NMI, PendSV,
//               SysTick and interrupts
#define M33_ICSR_OFFSET _u(0x0000ed04)
#define M33_ICSR_BITS   _u(0xdfdff9ff)
#define M33_ICSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ICSR_PENDNMISET
// Description : Indicates whether the NMI exception is pending
#define M33_ICSR_PENDNMISET_RESET  _u(0x0)
#define M33_ICSR_PENDNMISET_BITS   _u(0x80000000)
#define M33_ICSR_PENDNMISET_MSB    _u(31)
#define M33_ICSR_PENDNMISET_LSB    _u(31)
#define M33_ICSR_PENDNMISET_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ICSR_PENDNMICLR
// Description : Allows the NMI exception pend state to be cleared
#define M33_ICSR_PENDNMICLR_RESET  _u(0x0)
#define M33_ICSR_PENDNMICLR_BITS   _u(0x40000000)
#define M33_ICSR_PENDNMICLR_MSB    _u(30)
#define M33_ICSR_PENDNMICLR_LSB    _u(30)
#define M33_ICSR_PENDNMICLR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_ICSR_PENDSVSET
// Description : Indicates whether the PendSV `FTSSS exception is pending
#define M33_ICSR_PENDSVSET_RESET  _u(0x0)
#define M33_ICSR_PENDSVSET_BITS   _u(0x10000000)
#define M33_ICSR_PENDSVSET_MSB    _u(28)
#define M33_ICSR_PENDSVSET_LSB    _u(28)
#define M33_ICSR_PENDSVSET_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ICSR_PENDSVCLR
// Description : Allows the PendSV exception pend state to be cleared `FTSSS
#define M33_ICSR_PENDSVCLR_RESET  _u(0x0)
#define M33_ICSR_PENDSVCLR_BITS   _u(0x08000000)
#define M33_ICSR_PENDSVCLR_MSB    _u(27)
#define M33_ICSR_PENDSVCLR_LSB    _u(27)
#define M33_ICSR_PENDSVCLR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_ICSR_PENDSTSET
// Description : Indicates whether the SysTick `FTSSS exception is pending
#define M33_ICSR_PENDSTSET_RESET  _u(0x0)
#define M33_ICSR_PENDSTSET_BITS   _u(0x04000000)
#define M33_ICSR_PENDSTSET_MSB    _u(26)
#define M33_ICSR_PENDSTSET_LSB    _u(26)
#define M33_ICSR_PENDSTSET_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ICSR_PENDSTCLR
// Description : Allows the SysTick exception pend state to be cleared `FTSSS
#define M33_ICSR_PENDSTCLR_RESET  _u(0x0)
#define M33_ICSR_PENDSTCLR_BITS   _u(0x02000000)
#define M33_ICSR_PENDSTCLR_MSB    _u(25)
#define M33_ICSR_PENDSTCLR_LSB    _u(25)
#define M33_ICSR_PENDSTCLR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_ICSR_STTNS
// Description : Controls whether in a single SysTick implementation, the
//               SysTick is Secure or Non-secure
#define M33_ICSR_STTNS_RESET  _u(0x0)
#define M33_ICSR_STTNS_BITS   _u(0x01000000)
#define M33_ICSR_STTNS_MSB    _u(24)
#define M33_ICSR_STTNS_LSB    _u(24)
#define M33_ICSR_STTNS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_ICSR_ISRPREEMPT
// Description : Indicates whether a pending exception will be serviced on exit
//               from debug halt state
#define M33_ICSR_ISRPREEMPT_RESET  _u(0x0)
#define M33_ICSR_ISRPREEMPT_BITS   _u(0x00800000)
#define M33_ICSR_ISRPREEMPT_MSB    _u(23)
#define M33_ICSR_ISRPREEMPT_LSB    _u(23)
#define M33_ICSR_ISRPREEMPT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ICSR_ISRPENDING
// Description : Indicates whether an external interrupt, generated by the NVIC,
//               is pending
#define M33_ICSR_ISRPENDING_RESET  _u(0x0)
#define M33_ICSR_ISRPENDING_BITS   _u(0x00400000)
#define M33_ICSR_ISRPENDING_MSB    _u(22)
#define M33_ICSR_ISRPENDING_LSB    _u(22)
#define M33_ICSR_ISRPENDING_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ICSR_VECTPENDING
// Description : The exception number of the highest priority pending and
//               enabled interrupt
#define M33_ICSR_VECTPENDING_RESET  _u(0x000)
#define M33_ICSR_VECTPENDING_BITS   _u(0x001ff000)
#define M33_ICSR_VECTPENDING_MSB    _u(20)
#define M33_ICSR_VECTPENDING_LSB    _u(12)
#define M33_ICSR_VECTPENDING_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ICSR_RETTOBASE
// Description : In Handler mode, indicates whether there is more than one
//               active exception
#define M33_ICSR_RETTOBASE_RESET  _u(0x0)
#define M33_ICSR_RETTOBASE_BITS   _u(0x00000800)
#define M33_ICSR_RETTOBASE_MSB    _u(11)
#define M33_ICSR_RETTOBASE_LSB    _u(11)
#define M33_ICSR_RETTOBASE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ICSR_VECTACTIVE
// Description : The exception number of the current executing exception
#define M33_ICSR_VECTACTIVE_RESET  _u(0x000)
#define M33_ICSR_VECTACTIVE_BITS   _u(0x000001ff)
#define M33_ICSR_VECTACTIVE_MSB    _u(8)
#define M33_ICSR_VECTACTIVE_LSB    _u(0)
#define M33_ICSR_VECTACTIVE_ACCESS "RO"
// =============================================================================
// Register    : M33_VTOR
// Description : The VTOR indicates the offset of the vector table base address
//               from memory address 0x00000000.
#define M33_VTOR_OFFSET _u(0x0000ed08)
#define M33_VTOR_BITS   _u(0xffffff80)
#define M33_VTOR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_VTOR_TBLOFF
// Description : Vector table base offset field. It contains bits[31:7] of the
//               offset of the table base from the bottom of the memory map.
#define M33_VTOR_TBLOFF_RESET  _u(0x0000000)
#define M33_VTOR_TBLOFF_BITS   _u(0xffffff80)
#define M33_VTOR_TBLOFF_MSB    _u(31)
#define M33_VTOR_TBLOFF_LSB    _u(7)
#define M33_VTOR_TBLOFF_ACCESS "RW"
// =============================================================================
// Register    : M33_AIRCR
// Description : Use the Application Interrupt and Reset Control Register to:
//               determine data endianness, clear all active state information
//               from debug halt mode, request a system reset.
#define M33_AIRCR_OFFSET _u(0x0000ed0c)
#define M33_AIRCR_BITS   _u(0xffffe70e)
#define M33_AIRCR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_AIRCR_VECTKEY
// Description : Register key:
//               Reads as Unknown
//               On writes, write 0x05FA to VECTKEY, otherwise the write is
//               ignored.
#define M33_AIRCR_VECTKEY_RESET  _u(0x0000)
#define M33_AIRCR_VECTKEY_BITS   _u(0xffff0000)
#define M33_AIRCR_VECTKEY_MSB    _u(31)
#define M33_AIRCR_VECTKEY_LSB    _u(16)
#define M33_AIRCR_VECTKEY_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_AIRCR_ENDIANESS
// Description : Data endianness implemented:
//               0 = Little-endian.
#define M33_AIRCR_ENDIANESS_RESET  _u(0x0)
#define M33_AIRCR_ENDIANESS_BITS   _u(0x00008000)
#define M33_AIRCR_ENDIANESS_MSB    _u(15)
#define M33_AIRCR_ENDIANESS_LSB    _u(15)
#define M33_AIRCR_ENDIANESS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_AIRCR_PRIS
// Description : Prioritize Secure exceptions. The value of this bit defines
//               whether Secure exception priority boosting is enabled.
//               0	Priority ranges of Secure and Non-secure exceptions are
//               identical.
//               1	Non-secure exceptions are de-prioritized.
#define M33_AIRCR_PRIS_RESET  _u(0x0)
#define M33_AIRCR_PRIS_BITS   _u(0x00004000)
#define M33_AIRCR_PRIS_MSB    _u(14)
#define M33_AIRCR_PRIS_LSB    _u(14)
#define M33_AIRCR_PRIS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_AIRCR_BFHFNMINS
// Description : BusFault, HardFault, and NMI Non-secure enable.
//               0	BusFault, HardFault, and NMI are Secure.
//               1	BusFault and NMI are Non-secure and exceptions can target
//               Non-secure HardFault.
#define M33_AIRCR_BFHFNMINS_RESET  _u(0x0)
#define M33_AIRCR_BFHFNMINS_BITS   _u(0x00002000)
#define M33_AIRCR_BFHFNMINS_MSB    _u(13)
#define M33_AIRCR_BFHFNMINS_LSB    _u(13)
#define M33_AIRCR_BFHFNMINS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_AIRCR_PRIGROUP
// Description : Interrupt priority grouping field. This field determines the
//               split of group priority from subpriority.
//               See https://developer.arm.com/documentation/100235/0004/the-
//               cortex-m33-peripherals/system-control-block/application-
//               interrupt-and-reset-control-register?lang=en
#define M33_AIRCR_PRIGROUP_RESET  _u(0x0)
#define M33_AIRCR_PRIGROUP_BITS   _u(0x00000700)
#define M33_AIRCR_PRIGROUP_MSB    _u(10)
#define M33_AIRCR_PRIGROUP_LSB    _u(8)
#define M33_AIRCR_PRIGROUP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_AIRCR_SYSRESETREQS
// Description : System reset request, Secure state only.
//               0	SYSRESETREQ functionality is available to both Security
//               states.
//               1 SYSRESETREQ functionality is only available to Secure state.
#define M33_AIRCR_SYSRESETREQS_RESET  _u(0x0)
#define M33_AIRCR_SYSRESETREQS_BITS   _u(0x00000008)
#define M33_AIRCR_SYSRESETREQS_MSB    _u(3)
#define M33_AIRCR_SYSRESETREQS_LSB    _u(3)
#define M33_AIRCR_SYSRESETREQS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_AIRCR_SYSRESETREQ
// Description : Writing 1 to this bit causes the SYSRESETREQ signal to the
//               outer system to be asserted to request a reset. The intention
//               is to force a large system reset of all major components except
//               for debug. The C_HALT bit in the DHCSR is cleared as a result
//               of the system reset requested. The debugger does not lose
//               contact with the device.
#define M33_AIRCR_SYSRESETREQ_RESET  _u(0x0)
#define M33_AIRCR_SYSRESETREQ_BITS   _u(0x00000004)
#define M33_AIRCR_SYSRESETREQ_MSB    _u(2)
#define M33_AIRCR_SYSRESETREQ_LSB    _u(2)
#define M33_AIRCR_SYSRESETREQ_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_AIRCR_VECTCLRACTIVE
// Description : Clears all active state information for fixed and configurable
//               exceptions. This bit: is self-clearing, can only be set by the
//               DAP when the core is halted.  When set: clears all active
//               exception status of the processor, forces a return to Thread
//               mode, forces an IPSR of 0. A debugger must re-initialize the
//               stack.
#define M33_AIRCR_VECTCLRACTIVE_RESET  _u(0x0)
#define M33_AIRCR_VECTCLRACTIVE_BITS   _u(0x00000002)
#define M33_AIRCR_VECTCLRACTIVE_MSB    _u(1)
#define M33_AIRCR_VECTCLRACTIVE_LSB    _u(1)
#define M33_AIRCR_VECTCLRACTIVE_ACCESS "RW"
// =============================================================================
// Register    : M33_SCR
// Description : System Control Register. Use the System Control Register for
//               power-management functions: signal to the system when the
//               processor can enter a low power state, control how the
//               processor enters and exits low power states.
#define M33_SCR_OFFSET _u(0x0000ed10)
#define M33_SCR_BITS   _u(0x0000001e)
#define M33_SCR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_SCR_SEVONPEND
// Description : Send Event on Pending bit:
//               0 = Only enabled interrupts or events can wakeup the processor,
//               disabled interrupts are excluded.
//               1 = Enabled events and all interrupts, including disabled
//               interrupts, can wakeup the processor.
//               When an event or interrupt becomes pending, the event signal
//               wakes up the processor from WFE. If the
//               processor is not waiting for an event, the event is registered
//               and affects the next WFE.
//               The processor also wakes up on execution of an SEV instruction
//               or an external event.
#define M33_SCR_SEVONPEND_RESET  _u(0x0)
#define M33_SCR_SEVONPEND_BITS   _u(0x00000010)
#define M33_SCR_SEVONPEND_MSB    _u(4)
#define M33_SCR_SEVONPEND_LSB    _u(4)
#define M33_SCR_SEVONPEND_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SCR_SLEEPDEEPS
// Description : 0 SLEEPDEEP is available to both security states
//               1 SLEEPDEEP is only available to Secure state
#define M33_SCR_SLEEPDEEPS_RESET  _u(0x0)
#define M33_SCR_SLEEPDEEPS_BITS   _u(0x00000008)
#define M33_SCR_SLEEPDEEPS_MSB    _u(3)
#define M33_SCR_SLEEPDEEPS_LSB    _u(3)
#define M33_SCR_SLEEPDEEPS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SCR_SLEEPDEEP
// Description : Controls whether the processor uses sleep or deep sleep as its
//               low power mode:
//               0 = Sleep.
//               1 = Deep sleep.
#define M33_SCR_SLEEPDEEP_RESET  _u(0x0)
#define M33_SCR_SLEEPDEEP_BITS   _u(0x00000004)
#define M33_SCR_SLEEPDEEP_MSB    _u(2)
#define M33_SCR_SLEEPDEEP_LSB    _u(2)
#define M33_SCR_SLEEPDEEP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SCR_SLEEPONEXIT
// Description : Indicates sleep-on-exit when returning from Handler mode to
//               Thread mode:
//               0 = Do not sleep when returning to Thread mode.
//               1 = Enter sleep, or deep sleep, on return from an ISR to Thread
//               mode.
//               Setting this bit to 1 enables an interrupt driven application
//               to avoid returning to an empty main application.
#define M33_SCR_SLEEPONEXIT_RESET  _u(0x0)
#define M33_SCR_SLEEPONEXIT_BITS   _u(0x00000002)
#define M33_SCR_SLEEPONEXIT_MSB    _u(1)
#define M33_SCR_SLEEPONEXIT_LSB    _u(1)
#define M33_SCR_SLEEPONEXIT_ACCESS "RW"
// =============================================================================
// Register    : M33_CCR
// Description : Sets or returns configuration and control data
#define M33_CCR_OFFSET _u(0x0000ed14)
#define M33_CCR_BITS   _u(0x0007071b)
#define M33_CCR_RESET  _u(0x00000201)
// -----------------------------------------------------------------------------
// Field       : M33_CCR_BP
// Description : Enables program flow prediction `FTSSS
#define M33_CCR_BP_RESET  _u(0x0)
#define M33_CCR_BP_BITS   _u(0x00040000)
#define M33_CCR_BP_MSB    _u(18)
#define M33_CCR_BP_LSB    _u(18)
#define M33_CCR_BP_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_CCR_IC
// Description : This is a global enable bit for instruction caches in the
//               selected Security state
#define M33_CCR_IC_RESET  _u(0x0)
#define M33_CCR_IC_BITS   _u(0x00020000)
#define M33_CCR_IC_MSB    _u(17)
#define M33_CCR_IC_LSB    _u(17)
#define M33_CCR_IC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_CCR_DC
// Description : Enables data caching of all data accesses to Normal memory
//               `FTSSS
#define M33_CCR_DC_RESET  _u(0x0)
