Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/m33.h
#define M33_CCR_DC_BITS   _u(0x00010000)
#define M33_CCR_DC_MSB    _u(16)
#define M33_CCR_DC_LSB    _u(16)
#define M33_CCR_DC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_CCR_STKOFHFNMIGN
// Description : Controls the effect of a stack limit violation while executing
//               at a requested priority less than 0
#define M33_CCR_STKOFHFNMIGN_RESET  _u(0x0)
#define M33_CCR_STKOFHFNMIGN_BITS   _u(0x00000400)
#define M33_CCR_STKOFHFNMIGN_MSB    _u(10)
#define M33_CCR_STKOFHFNMIGN_LSB    _u(10)
#define M33_CCR_STKOFHFNMIGN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CCR_RES1
// Description : Reserved, RES1
#define M33_CCR_RES1_RESET  _u(0x1)
#define M33_CCR_RES1_BITS   _u(0x00000200)
#define M33_CCR_RES1_MSB    _u(9)
#define M33_CCR_RES1_LSB    _u(9)
#define M33_CCR_RES1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_CCR_BFHFNMIGN
// Description : Determines the effect of precise BusFaults on handlers running
//               at a requested priority less than 0
#define M33_CCR_BFHFNMIGN_RESET  _u(0x0)
#define M33_CCR_BFHFNMIGN_BITS   _u(0x00000100)
#define M33_CCR_BFHFNMIGN_MSB    _u(8)
#define M33_CCR_BFHFNMIGN_LSB    _u(8)
#define M33_CCR_BFHFNMIGN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CCR_DIV_0_TRP
// Description : Controls the generation of a DIVBYZERO UsageFault when
//               attempting to perform integer division by zero
#define M33_CCR_DIV_0_TRP_RESET  _u(0x0)
#define M33_CCR_DIV_0_TRP_BITS   _u(0x00000010)
#define M33_CCR_DIV_0_TRP_MSB    _u(4)
#define M33_CCR_DIV_0_TRP_LSB    _u(4)
#define M33_CCR_DIV_0_TRP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CCR_UNALIGN_TRP
// Description : Controls the trapping of unaligned word or halfword accesses
#define M33_CCR_UNALIGN_TRP_RESET  _u(0x0)
#define M33_CCR_UNALIGN_TRP_BITS   _u(0x00000008)
#define M33_CCR_UNALIGN_TRP_MSB    _u(3)
#define M33_CCR_UNALIGN_TRP_LSB    _u(3)
#define M33_CCR_UNALIGN_TRP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CCR_USERSETMPEND
// Description : Determines whether unprivileged accesses are permitted to pend
//               interrupts via the STIR
#define M33_CCR_USERSETMPEND_RESET  _u(0x0)
#define M33_CCR_USERSETMPEND_BITS   _u(0x00000002)
#define M33_CCR_USERSETMPEND_MSB    _u(1)
#define M33_CCR_USERSETMPEND_LSB    _u(1)
#define M33_CCR_USERSETMPEND_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CCR_RES1_1
// Description : Reserved, RES1
#define M33_CCR_RES1_1_RESET  _u(0x1)
#define M33_CCR_RES1_1_BITS   _u(0x00000001)
#define M33_CCR_RES1_1_MSB    _u(0)
#define M33_CCR_RES1_1_LSB    _u(0)
#define M33_CCR_RES1_1_ACCESS "RO"
// =============================================================================
// Register    : M33_SHPR1
// Description : Sets or returns priority for system handlers 4 - 7
#define M33_SHPR1_OFFSET _u(0x0000ed18)
#define M33_SHPR1_BITS   _u(0xe0e0e0e0)
#define M33_SHPR1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_SHPR1_PRI_7_3
// Description : Priority of system handler 7, SecureFault
#define M33_SHPR1_PRI_7_3_RESET  _u(0x0)
#define M33_SHPR1_PRI_7_3_BITS   _u(0xe0000000)
#define M33_SHPR1_PRI_7_3_MSB    _u(31)
#define M33_SHPR1_PRI_7_3_LSB    _u(29)
#define M33_SHPR1_PRI_7_3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHPR1_PRI_6_3
// Description : Priority of system handler 6, SecureFault
#define M33_SHPR1_PRI_6_3_RESET  _u(0x0)
#define M33_SHPR1_PRI_6_3_BITS   _u(0x00e00000)
#define M33_SHPR1_PRI_6_3_MSB    _u(23)
#define M33_SHPR1_PRI_6_3_LSB    _u(21)
#define M33_SHPR1_PRI_6_3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHPR1_PRI_5_3
// Description : Priority of system handler 5, SecureFault
#define M33_SHPR1_PRI_5_3_RESET  _u(0x0)
#define M33_SHPR1_PRI_5_3_BITS   _u(0x0000e000)
#define M33_SHPR1_PRI_5_3_MSB    _u(15)
#define M33_SHPR1_PRI_5_3_LSB    _u(13)
#define M33_SHPR1_PRI_5_3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHPR1_PRI_4_3
// Description : Priority of system handler 4, SecureFault
#define M33_SHPR1_PRI_4_3_RESET  _u(0x0)
#define M33_SHPR1_PRI_4_3_BITS   _u(0x000000e0)
#define M33_SHPR1_PRI_4_3_MSB    _u(7)
#define M33_SHPR1_PRI_4_3_LSB    _u(5)
#define M33_SHPR1_PRI_4_3_ACCESS "RW"
// =============================================================================
// Register    : M33_SHPR2
// Description : Sets or returns priority for system handlers 8 - 11
#define M33_SHPR2_OFFSET _u(0x0000ed1c)
#define M33_SHPR2_BITS   _u(0xe0ffffff)
#define M33_SHPR2_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_SHPR2_PRI_11_3
// Description : Priority of system handler 11, SecureFault
#define M33_SHPR2_PRI_11_3_RESET  _u(0x0)
#define M33_SHPR2_PRI_11_3_BITS   _u(0xe0000000)
#define M33_SHPR2_PRI_11_3_MSB    _u(31)
#define M33_SHPR2_PRI_11_3_LSB    _u(29)
#define M33_SHPR2_PRI_11_3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHPR2_PRI_10
// Description : Reserved, RES0
#define M33_SHPR2_PRI_10_RESET  _u(0x00)
#define M33_SHPR2_PRI_10_BITS   _u(0x00ff0000)
#define M33_SHPR2_PRI_10_MSB    _u(23)
#define M33_SHPR2_PRI_10_LSB    _u(16)
#define M33_SHPR2_PRI_10_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_SHPR2_PRI_9
// Description : Reserved, RES0
#define M33_SHPR2_PRI_9_RESET  _u(0x00)
#define M33_SHPR2_PRI_9_BITS   _u(0x0000ff00)
#define M33_SHPR2_PRI_9_MSB    _u(15)
#define M33_SHPR2_PRI_9_LSB    _u(8)
#define M33_SHPR2_PRI_9_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_SHPR2_PRI_8
// Description : Reserved, RES0
#define M33_SHPR2_PRI_8_RESET  _u(0x00)
#define M33_SHPR2_PRI_8_BITS   _u(0x000000ff)
#define M33_SHPR2_PRI_8_MSB    _u(7)
#define M33_SHPR2_PRI_8_LSB    _u(0)
#define M33_SHPR2_PRI_8_ACCESS "RO"
// =============================================================================
// Register    : M33_SHPR3
// Description : Sets or returns priority for system handlers 12 - 15
#define M33_SHPR3_OFFSET _u(0x0000ed20)
#define M33_SHPR3_BITS   _u(0xe0e0ffe0)
#define M33_SHPR3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_SHPR3_PRI_15_3
// Description : Priority of system handler 15, SecureFault
#define M33_SHPR3_PRI_15_3_RESET  _u(0x0)
#define M33_SHPR3_PRI_15_3_BITS   _u(0xe0000000)
#define M33_SHPR3_PRI_15_3_MSB    _u(31)
#define M33_SHPR3_PRI_15_3_LSB    _u(29)
#define M33_SHPR3_PRI_15_3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHPR3_PRI_14_3
// Description : Priority of system handler 14, SecureFault
#define M33_SHPR3_PRI_14_3_RESET  _u(0x0)
#define M33_SHPR3_PRI_14_3_BITS   _u(0x00e00000)
#define M33_SHPR3_PRI_14_3_MSB    _u(23)
#define M33_SHPR3_PRI_14_3_LSB    _u(21)
#define M33_SHPR3_PRI_14_3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHPR3_PRI_13
// Description : Reserved, RES0
#define M33_SHPR3_PRI_13_RESET  _u(0x00)
#define M33_SHPR3_PRI_13_BITS   _u(0x0000ff00)
#define M33_SHPR3_PRI_13_MSB    _u(15)
#define M33_SHPR3_PRI_13_LSB    _u(8)
#define M33_SHPR3_PRI_13_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_SHPR3_PRI_12_3
// Description : Priority of system handler 12, SecureFault
#define M33_SHPR3_PRI_12_3_RESET  _u(0x0)
#define M33_SHPR3_PRI_12_3_BITS   _u(0x000000e0)
#define M33_SHPR3_PRI_12_3_MSB    _u(7)
#define M33_SHPR3_PRI_12_3_LSB    _u(5)
#define M33_SHPR3_PRI_12_3_ACCESS "RW"
// =============================================================================
// Register    : M33_SHCSR
// Description : Provides access to the active and pending status of system
//               exceptions
#define M33_SHCSR_OFFSET _u(0x0000ed24)
#define M33_SHCSR_BITS   _u(0x003ffdbf)
#define M33_SHCSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_SHCSR_HARDFAULTPENDED
// Description : `IAAMO the pending state of the HardFault exception `CTTSSS
#define M33_SHCSR_HARDFAULTPENDED_RESET  _u(0x0)
#define M33_SHCSR_HARDFAULTPENDED_BITS   _u(0x00200000)
#define M33_SHCSR_HARDFAULTPENDED_MSB    _u(21)
#define M33_SHCSR_HARDFAULTPENDED_LSB    _u(21)
#define M33_SHCSR_HARDFAULTPENDED_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHCSR_SECUREFAULTPENDED
// Description : `IAAMO the pending state of the SecureFault exception
#define M33_SHCSR_SECUREFAULTPENDED_RESET  _u(0x0)
#define M33_SHCSR_SECUREFAULTPENDED_BITS   _u(0x00100000)
#define M33_SHCSR_SECUREFAULTPENDED_MSB    _u(20)
#define M33_SHCSR_SECUREFAULTPENDED_LSB    _u(20)
#define M33_SHCSR_SECUREFAULTPENDED_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHCSR_SECUREFAULTENA
// Description : `DW the SecureFault exception is enabled
#define M33_SHCSR_SECUREFAULTENA_RESET  _u(0x0)
#define M33_SHCSR_SECUREFAULTENA_BITS   _u(0x00080000)
#define M33_SHCSR_SECUREFAULTENA_MSB    _u(19)
#define M33_SHCSR_SECUREFAULTENA_LSB    _u(19)
#define M33_SHCSR_SECUREFAULTENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHCSR_USGFAULTENA
// Description : `DW the UsageFault exception is enabled `FTSSS
#define M33_SHCSR_USGFAULTENA_RESET  _u(0x0)
#define M33_SHCSR_USGFAULTENA_BITS   _u(0x00040000)
#define M33_SHCSR_USGFAULTENA_MSB    _u(18)
#define M33_SHCSR_USGFAULTENA_LSB    _u(18)
#define M33_SHCSR_USGFAULTENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHCSR_BUSFAULTENA
// Description : `DW the BusFault exception is enabled
#define M33_SHCSR_BUSFAULTENA_RESET  _u(0x0)
#define M33_SHCSR_BUSFAULTENA_BITS   _u(0x00020000)
#define M33_SHCSR_BUSFAULTENA_MSB    _u(17)
#define M33_SHCSR_BUSFAULTENA_LSB    _u(17)
#define M33_SHCSR_BUSFAULTENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHCSR_MEMFAULTENA
// Description : `DW the MemManage exception is enabled `FTSSS
#define M33_SHCSR_MEMFAULTENA_RESET  _u(0x0)
#define M33_SHCSR_MEMFAULTENA_BITS   _u(0x00010000)
#define M33_SHCSR_MEMFAULTENA_MSB    _u(16)
#define M33_SHCSR_MEMFAULTENA_LSB    _u(16)
#define M33_SHCSR_MEMFAULTENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHCSR_SVCALLPENDED
// Description : `IAAMO the pending state of the SVCall exception `FTSSS
#define M33_SHCSR_SVCALLPENDED_RESET  _u(0x0)
#define M33_SHCSR_SVCALLPENDED_BITS   _u(0x00008000)
#define M33_SHCSR_SVCALLPENDED_MSB    _u(15)
#define M33_SHCSR_SVCALLPENDED_LSB    _u(15)
#define M33_SHCSR_SVCALLPENDED_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHCSR_BUSFAULTPENDED
// Description : `IAAMO the pending state of the BusFault exception
#define M33_SHCSR_BUSFAULTPENDED_RESET  _u(0x0)
#define M33_SHCSR_BUSFAULTPENDED_BITS   _u(0x00004000)
#define M33_SHCSR_BUSFAULTPENDED_MSB    _u(14)
#define M33_SHCSR_BUSFAULTPENDED_LSB    _u(14)
#define M33_SHCSR_BUSFAULTPENDED_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHCSR_MEMFAULTPENDED
// Description : `IAAMO the pending state of the MemManage exception `FTSSS
#define M33_SHCSR_MEMFAULTPENDED_RESET  _u(0x0)
#define M33_SHCSR_MEMFAULTPENDED_BITS   _u(0x00002000)
#define M33_SHCSR_MEMFAULTPENDED_MSB    _u(13)
#define M33_SHCSR_MEMFAULTPENDED_LSB    _u(13)
#define M33_SHCSR_MEMFAULTPENDED_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHCSR_USGFAULTPENDED
// Description : The UsageFault exception is banked between Security states,
//               `IAAMO the pending state of the UsageFault exception `FTSSS
#define M33_SHCSR_USGFAULTPENDED_RESET  _u(0x0)
#define M33_SHCSR_USGFAULTPENDED_BITS   _u(0x00001000)
#define M33_SHCSR_USGFAULTPENDED_MSB    _u(12)
#define M33_SHCSR_USGFAULTPENDED_LSB    _u(12)
#define M33_SHCSR_USGFAULTPENDED_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHCSR_SYSTICKACT
// Description : `IAAMO the active state of the SysTick exception `FTSSS
#define M33_SHCSR_SYSTICKACT_RESET  _u(0x0)
#define M33_SHCSR_SYSTICKACT_BITS   _u(0x00000800)
#define M33_SHCSR_SYSTICKACT_MSB    _u(11)
#define M33_SHCSR_SYSTICKACT_LSB    _u(11)
#define M33_SHCSR_SYSTICKACT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHCSR_PENDSVACT
// Description : `IAAMO the active state of the PendSV exception `FTSSS
#define M33_SHCSR_PENDSVACT_RESET  _u(0x0)
#define M33_SHCSR_PENDSVACT_BITS   _u(0x00000400)
#define M33_SHCSR_PENDSVACT_MSB    _u(10)
#define M33_SHCSR_PENDSVACT_LSB    _u(10)
#define M33_SHCSR_PENDSVACT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHCSR_MONITORACT
// Description : `IAAMO the active state of the DebugMonitor exception
#define M33_SHCSR_MONITORACT_RESET  _u(0x0)
#define M33_SHCSR_MONITORACT_BITS   _u(0x00000100)
#define M33_SHCSR_MONITORACT_MSB    _u(8)
#define M33_SHCSR_MONITORACT_LSB    _u(8)
#define M33_SHCSR_MONITORACT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHCSR_SVCALLACT
// Description : `IAAMO the active state of the SVCall exception `FTSSS
#define M33_SHCSR_SVCALLACT_RESET  _u(0x0)
#define M33_SHCSR_SVCALLACT_BITS   _u(0x00000080)
#define M33_SHCSR_SVCALLACT_MSB    _u(7)
#define M33_SHCSR_SVCALLACT_LSB    _u(7)
#define M33_SHCSR_SVCALLACT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHCSR_NMIACT
// Description : `IAAMO the active state of the NMI exception
#define M33_SHCSR_NMIACT_RESET  _u(0x0)
#define M33_SHCSR_NMIACT_BITS   _u(0x00000020)
#define M33_SHCSR_NMIACT_MSB    _u(5)
#define M33_SHCSR_NMIACT_LSB    _u(5)
#define M33_SHCSR_NMIACT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHCSR_SECUREFAULTACT
// Description : `IAAMO the active state of the SecureFault exception
#define M33_SHCSR_SECUREFAULTACT_RESET  _u(0x0)
#define M33_SHCSR_SECUREFAULTACT_BITS   _u(0x00000010)
#define M33_SHCSR_SECUREFAULTACT_MSB    _u(4)
#define M33_SHCSR_SECUREFAULTACT_LSB    _u(4)
#define M33_SHCSR_SECUREFAULTACT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHCSR_USGFAULTACT
// Description : `IAAMO the active state of the UsageFault exception `FTSSS
#define M33_SHCSR_USGFAULTACT_RESET  _u(0x0)
#define M33_SHCSR_USGFAULTACT_BITS   _u(0x00000008)
#define M33_SHCSR_USGFAULTACT_MSB    _u(3)
#define M33_SHCSR_USGFAULTACT_LSB    _u(3)
#define M33_SHCSR_USGFAULTACT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHCSR_HARDFAULTACT
// Description : Indicates and allows limited modification of the active state
//               of the HardFault exception `FTSSS
#define M33_SHCSR_HARDFAULTACT_RESET  _u(0x0)
#define M33_SHCSR_HARDFAULTACT_BITS   _u(0x00000004)
#define M33_SHCSR_HARDFAULTACT_MSB    _u(2)
#define M33_SHCSR_HARDFAULTACT_LSB    _u(2)
#define M33_SHCSR_HARDFAULTACT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHCSR_BUSFAULTACT
// Description : `IAAMO the active state of the BusFault exception
#define M33_SHCSR_BUSFAULTACT_RESET  _u(0x0)
#define M33_SHCSR_BUSFAULTACT_BITS   _u(0x00000002)
#define M33_SHCSR_BUSFAULTACT_MSB    _u(1)
#define M33_SHCSR_BUSFAULTACT_LSB    _u(1)
#define M33_SHCSR_BUSFAULTACT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SHCSR_MEMFAULTACT
// Description : `IAAMO the active state of the MemManage exception `FTSSS
#define M33_SHCSR_MEMFAULTACT_RESET  _u(0x0)
#define M33_SHCSR_MEMFAULTACT_BITS   _u(0x00000001)
#define M33_SHCSR_MEMFAULTACT_MSB    _u(0)
#define M33_SHCSR_MEMFAULTACT_LSB    _u(0)
#define M33_SHCSR_MEMFAULTACT_ACCESS "RW"
// =============================================================================
// Register    : M33_CFSR
// Description : Contains the three Configurable Fault Status Registers.
//
//               31:16 UFSR: Provides information on UsageFault exceptions
//
//               15:8 BFSR: Provides information on BusFault exceptions
//
//               7:0 MMFSR: Provides information on MemManage exceptions
#define M33_CFSR_OFFSET _u(0x0000ed28)
#define M33_CFSR_BITS   _u(0x031fbfff)
#define M33_CFSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CFSR_UFSR_DIVBYZERO
// Description : Sticky flag indicating whether an integer division by zero
//               error has occurred
#define M33_CFSR_UFSR_DIVBYZERO_RESET  _u(0x0)
#define M33_CFSR_UFSR_DIVBYZERO_BITS   _u(0x02000000)
#define M33_CFSR_UFSR_DIVBYZERO_MSB    _u(25)
#define M33_CFSR_UFSR_DIVBYZERO_LSB    _u(25)
#define M33_CFSR_UFSR_DIVBYZERO_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CFSR_UFSR_UNALIGNED
// Description : Sticky flag indicating whether an unaligned access error has
//               occurred
#define M33_CFSR_UFSR_UNALIGNED_RESET  _u(0x0)
#define M33_CFSR_UFSR_UNALIGNED_BITS   _u(0x01000000)
#define M33_CFSR_UFSR_UNALIGNED_MSB    _u(24)
#define M33_CFSR_UFSR_UNALIGNED_LSB    _u(24)
#define M33_CFSR_UFSR_UNALIGNED_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CFSR_UFSR_STKOF
// Description : Sticky flag indicating whether a stack overflow error has
//               occurred
#define M33_CFSR_UFSR_STKOF_RESET  _u(0x0)
#define M33_CFSR_UFSR_STKOF_BITS   _u(0x00100000)
#define M33_CFSR_UFSR_STKOF_MSB    _u(20)
#define M33_CFSR_UFSR_STKOF_LSB    _u(20)
#define M33_CFSR_UFSR_STKOF_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CFSR_UFSR_NOCP
// Description : Sticky flag indicating whether a coprocessor disabled or not
//               present error has occurred
#define M33_CFSR_UFSR_NOCP_RESET  _u(0x0)
#define M33_CFSR_UFSR_NOCP_BITS   _u(0x00080000)
#define M33_CFSR_UFSR_NOCP_MSB    _u(19)
#define M33_CFSR_UFSR_NOCP_LSB    _u(19)
#define M33_CFSR_UFSR_NOCP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CFSR_UFSR_INVPC
// Description : Sticky flag indicating whether an integrity check error has
//               occurred
#define M33_CFSR_UFSR_INVPC_RESET  _u(0x0)
#define M33_CFSR_UFSR_INVPC_BITS   _u(0x00040000)
#define M33_CFSR_UFSR_INVPC_MSB    _u(18)
#define M33_CFSR_UFSR_INVPC_LSB    _u(18)
#define M33_CFSR_UFSR_INVPC_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CFSR_UFSR_INVSTATE
// Description : Sticky flag indicating whether an EPSR.T or EPSR.IT validity
//               error has occurred
#define M33_CFSR_UFSR_INVSTATE_RESET  _u(0x0)
#define M33_CFSR_UFSR_INVSTATE_BITS   _u(0x00020000)
#define M33_CFSR_UFSR_INVSTATE_MSB    _u(17)
#define M33_CFSR_UFSR_INVSTATE_LSB    _u(17)
#define M33_CFSR_UFSR_INVSTATE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CFSR_UFSR_UNDEFINSTR
// Description : Sticky flag indicating whether an undefined instruction error
//               has occurred
#define M33_CFSR_UFSR_UNDEFINSTR_RESET  _u(0x0)
#define M33_CFSR_UFSR_UNDEFINSTR_BITS   _u(0x00010000)
#define M33_CFSR_UFSR_UNDEFINSTR_MSB    _u(16)
#define M33_CFSR_UFSR_UNDEFINSTR_LSB    _u(16)
#define M33_CFSR_UFSR_UNDEFINSTR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CFSR_BFSR_BFARVALID
// Description : Indicates validity of the contents of the BFAR register
#define M33_CFSR_BFSR_BFARVALID_RESET  _u(0x0)
#define M33_CFSR_BFSR_BFARVALID_BITS   _u(0x00008000)
#define M33_CFSR_BFSR_BFARVALID_MSB    _u(15)
#define M33_CFSR_BFSR_BFARVALID_LSB    _u(15)
#define M33_CFSR_BFSR_BFARVALID_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CFSR_BFSR_LSPERR
// Description : Records whether a BusFault occurred during FP lazy state
//               preservation
#define M33_CFSR_BFSR_LSPERR_RESET  _u(0x0)
#define M33_CFSR_BFSR_LSPERR_BITS   _u(0x00002000)
#define M33_CFSR_BFSR_LSPERR_MSB    _u(13)
#define M33_CFSR_BFSR_LSPERR_LSB    _u(13)
#define M33_CFSR_BFSR_LSPERR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CFSR_BFSR_STKERR
// Description : Records whether a derived BusFault occurred during exception
//               entry stacking
#define M33_CFSR_BFSR_STKERR_RESET  _u(0x0)
#define M33_CFSR_BFSR_STKERR_BITS   _u(0x00001000)
#define M33_CFSR_BFSR_STKERR_MSB    _u(12)
#define M33_CFSR_BFSR_STKERR_LSB    _u(12)
#define M33_CFSR_BFSR_STKERR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CFSR_BFSR_UNSTKERR
// Description : Records whether a derived BusFault occurred during exception
//               return unstacking
#define M33_CFSR_BFSR_UNSTKERR_RESET  _u(0x0)
#define M33_CFSR_BFSR_UNSTKERR_BITS   _u(0x00000800)
#define M33_CFSR_BFSR_UNSTKERR_MSB    _u(11)
#define M33_CFSR_BFSR_UNSTKERR_LSB    _u(11)
#define M33_CFSR_BFSR_UNSTKERR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CFSR_BFSR_IMPRECISERR
// Description : Records whether an imprecise data access error has occurred
#define M33_CFSR_BFSR_IMPRECISERR_RESET  _u(0x0)
#define M33_CFSR_BFSR_IMPRECISERR_BITS   _u(0x00000400)
#define M33_CFSR_BFSR_IMPRECISERR_MSB    _u(10)
#define M33_CFSR_BFSR_IMPRECISERR_LSB    _u(10)
#define M33_CFSR_BFSR_IMPRECISERR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CFSR_BFSR_PRECISERR
// Description : Records whether a precise data access error has occurred
#define M33_CFSR_BFSR_PRECISERR_RESET  _u(0x0)
#define M33_CFSR_BFSR_PRECISERR_BITS   _u(0x00000200)
#define M33_CFSR_BFSR_PRECISERR_MSB    _u(9)
#define M33_CFSR_BFSR_PRECISERR_LSB    _u(9)
#define M33_CFSR_BFSR_PRECISERR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CFSR_BFSR_IBUSERR
// Description : Records whether a BusFault on an instruction prefetch has
//               occurred
#define M33_CFSR_BFSR_IBUSERR_RESET  _u(0x0)
