Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/m33.h
#define M33_CFSR_BFSR_IBUSERR_BITS   _u(0x00000100)
#define M33_CFSR_BFSR_IBUSERR_MSB    _u(8)
#define M33_CFSR_BFSR_IBUSERR_LSB    _u(8)
#define M33_CFSR_BFSR_IBUSERR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CFSR_MMFSR
// Description : Provides information on MemManage exceptions
#define M33_CFSR_MMFSR_RESET  _u(0x00)
#define M33_CFSR_MMFSR_BITS   _u(0x000000ff)
#define M33_CFSR_MMFSR_MSB    _u(7)
#define M33_CFSR_MMFSR_LSB    _u(0)
#define M33_CFSR_MMFSR_ACCESS "RW"
// =============================================================================
// Register    : M33_HFSR
// Description : Shows the cause of any HardFaults
#define M33_HFSR_OFFSET _u(0x0000ed2c)
#define M33_HFSR_BITS   _u(0xc0000002)
#define M33_HFSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_HFSR_DEBUGEVT
// Description : Indicates when a Debug event has occurred
#define M33_HFSR_DEBUGEVT_RESET  _u(0x0)
#define M33_HFSR_DEBUGEVT_BITS   _u(0x80000000)
#define M33_HFSR_DEBUGEVT_MSB    _u(31)
#define M33_HFSR_DEBUGEVT_LSB    _u(31)
#define M33_HFSR_DEBUGEVT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_HFSR_FORCED
// Description : Indicates that a fault with configurable priority has been
//               escalated to a HardFault exception, because it could not be
//               made active, because of priority, or because it was disabled
#define M33_HFSR_FORCED_RESET  _u(0x0)
#define M33_HFSR_FORCED_BITS   _u(0x40000000)
#define M33_HFSR_FORCED_MSB    _u(30)
#define M33_HFSR_FORCED_LSB    _u(30)
#define M33_HFSR_FORCED_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_HFSR_VECTTBL
// Description : Indicates when a fault has occurred because of a vector table
//               read error on exception processing
#define M33_HFSR_VECTTBL_RESET  _u(0x0)
#define M33_HFSR_VECTTBL_BITS   _u(0x00000002)
#define M33_HFSR_VECTTBL_MSB    _u(1)
#define M33_HFSR_VECTTBL_LSB    _u(1)
#define M33_HFSR_VECTTBL_ACCESS "RW"
// =============================================================================
// Register    : M33_DFSR
// Description : Shows which debug event occurred
#define M33_DFSR_OFFSET _u(0x0000ed30)
#define M33_DFSR_BITS   _u(0x0000001f)
#define M33_DFSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_DFSR_EXTERNAL
// Description : Sticky flag indicating whether an External debug request debug
//               event has occurred
#define M33_DFSR_EXTERNAL_RESET  _u(0x0)
#define M33_DFSR_EXTERNAL_BITS   _u(0x00000010)
#define M33_DFSR_EXTERNAL_MSB    _u(4)
#define M33_DFSR_EXTERNAL_LSB    _u(4)
#define M33_DFSR_EXTERNAL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DFSR_VCATCH
// Description : Sticky flag indicating whether a Vector catch debug event has
//               occurred
#define M33_DFSR_VCATCH_RESET  _u(0x0)
#define M33_DFSR_VCATCH_BITS   _u(0x00000008)
#define M33_DFSR_VCATCH_MSB    _u(3)
#define M33_DFSR_VCATCH_LSB    _u(3)
#define M33_DFSR_VCATCH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DFSR_DWTTRAP
// Description : Sticky flag indicating whether a Watchpoint debug event has
//               occurred
#define M33_DFSR_DWTTRAP_RESET  _u(0x0)
#define M33_DFSR_DWTTRAP_BITS   _u(0x00000004)
#define M33_DFSR_DWTTRAP_MSB    _u(2)
#define M33_DFSR_DWTTRAP_LSB    _u(2)
#define M33_DFSR_DWTTRAP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DFSR_BKPT
// Description : Sticky flag indicating whether a Breakpoint debug event has
//               occurred
#define M33_DFSR_BKPT_RESET  _u(0x0)
#define M33_DFSR_BKPT_BITS   _u(0x00000002)
#define M33_DFSR_BKPT_MSB    _u(1)
#define M33_DFSR_BKPT_LSB    _u(1)
#define M33_DFSR_BKPT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DFSR_HALTED
// Description : Sticky flag indicating that a Halt request debug event or Step
//               debug event has occurred
#define M33_DFSR_HALTED_RESET  _u(0x0)
#define M33_DFSR_HALTED_BITS   _u(0x00000001)
#define M33_DFSR_HALTED_MSB    _u(0)
#define M33_DFSR_HALTED_LSB    _u(0)
#define M33_DFSR_HALTED_ACCESS "RW"
// =============================================================================
// Register    : M33_MMFAR
// Description : Shows the address of the memory location that caused an MPU
//               fault
#define M33_MMFAR_OFFSET _u(0x0000ed34)
#define M33_MMFAR_BITS   _u(0xffffffff)
#define M33_MMFAR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_MMFAR_ADDRESS
// Description : This register is updated with the address of a location that
//               produced a MemManage fault. The MMFSR shows the cause of the
//               fault, and whether this field is valid. This field is valid
//               only when MMFSR.MMARVALID is set, otherwise it is UNKNOWN
#define M33_MMFAR_ADDRESS_RESET  _u(0x00000000)
#define M33_MMFAR_ADDRESS_BITS   _u(0xffffffff)
#define M33_MMFAR_ADDRESS_MSB    _u(31)
#define M33_MMFAR_ADDRESS_LSB    _u(0)
#define M33_MMFAR_ADDRESS_ACCESS "RW"
// =============================================================================
// Register    : M33_BFAR
// Description : Shows the address associated with a precise data access
//               BusFault
#define M33_BFAR_OFFSET _u(0x0000ed38)
#define M33_BFAR_BITS   _u(0xffffffff)
#define M33_BFAR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_BFAR_ADDRESS
// Description : This register is updated with the address of a location that
//               produced a BusFault. The BFSR shows the reason for the fault.
//               This field is valid only when BFSR.BFARVALID is set, otherwise
//               it is UNKNOWN
#define M33_BFAR_ADDRESS_RESET  _u(0x00000000)
#define M33_BFAR_ADDRESS_BITS   _u(0xffffffff)
#define M33_BFAR_ADDRESS_MSB    _u(31)
#define M33_BFAR_ADDRESS_LSB    _u(0)
#define M33_BFAR_ADDRESS_ACCESS "RW"
// =============================================================================
// Register    : M33_ID_PFR0
// Description : Gives top-level information about the instruction set supported
//               by the PE
#define M33_ID_PFR0_OFFSET _u(0x0000ed40)
#define M33_ID_PFR0_BITS   _u(0x000000ff)
#define M33_ID_PFR0_RESET  _u(0x00000030)
// -----------------------------------------------------------------------------
// Field       : M33_ID_PFR0_STATE1
// Description : T32 instruction set support
#define M33_ID_PFR0_STATE1_RESET  _u(0x3)
#define M33_ID_PFR0_STATE1_BITS   _u(0x000000f0)
#define M33_ID_PFR0_STATE1_MSB    _u(7)
#define M33_ID_PFR0_STATE1_LSB    _u(4)
#define M33_ID_PFR0_STATE1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_PFR0_STATE0
// Description : A32 instruction set support
#define M33_ID_PFR0_STATE0_RESET  _u(0x0)
#define M33_ID_PFR0_STATE0_BITS   _u(0x0000000f)
#define M33_ID_PFR0_STATE0_MSB    _u(3)
#define M33_ID_PFR0_STATE0_LSB    _u(0)
#define M33_ID_PFR0_STATE0_ACCESS "RO"
// =============================================================================
// Register    : M33_ID_PFR1
// Description : Gives information about the programmers' model and Extensions
//               support
#define M33_ID_PFR1_OFFSET _u(0x0000ed44)
#define M33_ID_PFR1_BITS   _u(0x00000ff0)
#define M33_ID_PFR1_RESET  _u(0x00000520)
// -----------------------------------------------------------------------------
// Field       : M33_ID_PFR1_MPROGMOD
// Description : Identifies support for the M-Profile programmers' model support
#define M33_ID_PFR1_MPROGMOD_RESET  _u(0x5)
#define M33_ID_PFR1_MPROGMOD_BITS   _u(0x00000f00)
#define M33_ID_PFR1_MPROGMOD_MSB    _u(11)
#define M33_ID_PFR1_MPROGMOD_LSB    _u(8)
#define M33_ID_PFR1_MPROGMOD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_PFR1_SECURITY
// Description : Identifies whether the Security Extension is implemented
#define M33_ID_PFR1_SECURITY_RESET  _u(0x2)
#define M33_ID_PFR1_SECURITY_BITS   _u(0x000000f0)
#define M33_ID_PFR1_SECURITY_MSB    _u(7)
#define M33_ID_PFR1_SECURITY_LSB    _u(4)
#define M33_ID_PFR1_SECURITY_ACCESS "RO"
// =============================================================================
// Register    : M33_ID_DFR0
// Description : Provides top level information about the debug system
#define M33_ID_DFR0_OFFSET _u(0x0000ed48)
#define M33_ID_DFR0_BITS   _u(0x00f00000)
#define M33_ID_DFR0_RESET  _u(0x00200000)
// -----------------------------------------------------------------------------
// Field       : M33_ID_DFR0_MPROFDBG
// Description : Indicates the supported M-profile debug architecture
#define M33_ID_DFR0_MPROFDBG_RESET  _u(0x2)
#define M33_ID_DFR0_MPROFDBG_BITS   _u(0x00f00000)
#define M33_ID_DFR0_MPROFDBG_MSB    _u(23)
#define M33_ID_DFR0_MPROFDBG_LSB    _u(20)
#define M33_ID_DFR0_MPROFDBG_ACCESS "RO"
// =============================================================================
// Register    : M33_ID_AFR0
// Description : Provides information about the IMPLEMENTATION DEFINED features
//               of the PE
#define M33_ID_AFR0_OFFSET _u(0x0000ed4c)
#define M33_ID_AFR0_BITS   _u(0x0000ffff)
#define M33_ID_AFR0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ID_AFR0_IMPDEF3
// Description : IMPLEMENTATION DEFINED meaning
#define M33_ID_AFR0_IMPDEF3_RESET  _u(0x0)
#define M33_ID_AFR0_IMPDEF3_BITS   _u(0x0000f000)
#define M33_ID_AFR0_IMPDEF3_MSB    _u(15)
#define M33_ID_AFR0_IMPDEF3_LSB    _u(12)
#define M33_ID_AFR0_IMPDEF3_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_AFR0_IMPDEF2
// Description : IMPLEMENTATION DEFINED meaning
#define M33_ID_AFR0_IMPDEF2_RESET  _u(0x0)
#define M33_ID_AFR0_IMPDEF2_BITS   _u(0x00000f00)
#define M33_ID_AFR0_IMPDEF2_MSB    _u(11)
#define M33_ID_AFR0_IMPDEF2_LSB    _u(8)
#define M33_ID_AFR0_IMPDEF2_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_AFR0_IMPDEF1
// Description : IMPLEMENTATION DEFINED meaning
#define M33_ID_AFR0_IMPDEF1_RESET  _u(0x0)
#define M33_ID_AFR0_IMPDEF1_BITS   _u(0x000000f0)
#define M33_ID_AFR0_IMPDEF1_MSB    _u(7)
#define M33_ID_AFR0_IMPDEF1_LSB    _u(4)
#define M33_ID_AFR0_IMPDEF1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_AFR0_IMPDEF0
// Description : IMPLEMENTATION DEFINED meaning
#define M33_ID_AFR0_IMPDEF0_RESET  _u(0x0)
#define M33_ID_AFR0_IMPDEF0_BITS   _u(0x0000000f)
#define M33_ID_AFR0_IMPDEF0_MSB    _u(3)
#define M33_ID_AFR0_IMPDEF0_LSB    _u(0)
#define M33_ID_AFR0_IMPDEF0_ACCESS "RO"
// =============================================================================
// Register    : M33_ID_MMFR0
// Description : Provides information about the implemented memory model and
//               memory management support
#define M33_ID_MMFR0_OFFSET _u(0x0000ed50)
#define M33_ID_MMFR0_BITS   _u(0x00fffff0)
#define M33_ID_MMFR0_RESET  _u(0x00101f40)
// -----------------------------------------------------------------------------
// Field       : M33_ID_MMFR0_AUXREG
// Description : Indicates support for Auxiliary Control Registers
#define M33_ID_MMFR0_AUXREG_RESET  _u(0x1)
#define M33_ID_MMFR0_AUXREG_BITS   _u(0x00f00000)
#define M33_ID_MMFR0_AUXREG_MSB    _u(23)
#define M33_ID_MMFR0_AUXREG_LSB    _u(20)
#define M33_ID_MMFR0_AUXREG_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_MMFR0_TCM
// Description : Indicates support for tightly coupled memories (TCMs)
#define M33_ID_MMFR0_TCM_RESET  _u(0x0)
#define M33_ID_MMFR0_TCM_BITS   _u(0x000f0000)
#define M33_ID_MMFR0_TCM_MSB    _u(19)
#define M33_ID_MMFR0_TCM_LSB    _u(16)
#define M33_ID_MMFR0_TCM_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_MMFR0_SHARELVL
// Description : Indicates the number of shareability levels implemented
#define M33_ID_MMFR0_SHARELVL_RESET  _u(0x1)
#define M33_ID_MMFR0_SHARELVL_BITS   _u(0x0000f000)
#define M33_ID_MMFR0_SHARELVL_MSB    _u(15)
#define M33_ID_MMFR0_SHARELVL_LSB    _u(12)
#define M33_ID_MMFR0_SHARELVL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_MMFR0_OUTERSHR
// Description : Indicates the outermost shareability domain implemented
#define M33_ID_MMFR0_OUTERSHR_RESET  _u(0xf)
#define M33_ID_MMFR0_OUTERSHR_BITS   _u(0x00000f00)
#define M33_ID_MMFR0_OUTERSHR_MSB    _u(11)
#define M33_ID_MMFR0_OUTERSHR_LSB    _u(8)
#define M33_ID_MMFR0_OUTERSHR_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_MMFR0_PMSA
// Description : Indicates support for the protected memory system architecture
//               (PMSA)
#define M33_ID_MMFR0_PMSA_RESET  _u(0x4)
#define M33_ID_MMFR0_PMSA_BITS   _u(0x000000f0)
#define M33_ID_MMFR0_PMSA_MSB    _u(7)
#define M33_ID_MMFR0_PMSA_LSB    _u(4)
#define M33_ID_MMFR0_PMSA_ACCESS "RO"
// =============================================================================
// Register    : M33_ID_MMFR1
// Description : Provides information about the implemented memory model and
//               memory management support
#define M33_ID_MMFR1_OFFSET _u(0x0000ed54)
#define M33_ID_MMFR1_BITS   _u(0x00000000)
#define M33_ID_MMFR1_RESET  _u(0x00000000)
#define M33_ID_MMFR1_MSB    _u(31)
#define M33_ID_MMFR1_LSB    _u(0)
#define M33_ID_MMFR1_ACCESS "RW"
// =============================================================================
// Register    : M33_ID_MMFR2
// Description : Provides information about the implemented memory model and
//               memory management support
#define M33_ID_MMFR2_OFFSET _u(0x0000ed58)
#define M33_ID_MMFR2_BITS   _u(0x0f000000)
#define M33_ID_MMFR2_RESET  _u(0x01000000)
// -----------------------------------------------------------------------------
// Field       : M33_ID_MMFR2_WFISTALL
// Description : Indicates the support for Wait For Interrupt (WFI) stalling
#define M33_ID_MMFR2_WFISTALL_RESET  _u(0x1)
#define M33_ID_MMFR2_WFISTALL_BITS   _u(0x0f000000)
#define M33_ID_MMFR2_WFISTALL_MSB    _u(27)
#define M33_ID_MMFR2_WFISTALL_LSB    _u(24)
#define M33_ID_MMFR2_WFISTALL_ACCESS "RO"
// =============================================================================
// Register    : M33_ID_MMFR3
// Description : Provides information about the implemented memory model and
//               memory management support
#define M33_ID_MMFR3_OFFSET _u(0x0000ed5c)
#define M33_ID_MMFR3_BITS   _u(0x00000fff)
#define M33_ID_MMFR3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ID_MMFR3_BPMAINT
// Description : Indicates the supported branch predictor maintenance
#define M33_ID_MMFR3_BPMAINT_RESET  _u(0x0)
#define M33_ID_MMFR3_BPMAINT_BITS   _u(0x00000f00)
#define M33_ID_MMFR3_BPMAINT_MSB    _u(11)
#define M33_ID_MMFR3_BPMAINT_LSB    _u(8)
#define M33_ID_MMFR3_BPMAINT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_MMFR3_CMAINTSW
// Description : Indicates the supported cache maintenance operations by set/way
#define M33_ID_MMFR3_CMAINTSW_RESET  _u(0x0)
#define M33_ID_MMFR3_CMAINTSW_BITS   _u(0x000000f0)
#define M33_ID_MMFR3_CMAINTSW_MSB    _u(7)
#define M33_ID_MMFR3_CMAINTSW_LSB    _u(4)
#define M33_ID_MMFR3_CMAINTSW_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_MMFR3_CMAINTVA
// Description : Indicates the supported cache maintenance operations by address
#define M33_ID_MMFR3_CMAINTVA_RESET  _u(0x0)
#define M33_ID_MMFR3_CMAINTVA_BITS   _u(0x0000000f)
#define M33_ID_MMFR3_CMAINTVA_MSB    _u(3)
#define M33_ID_MMFR3_CMAINTVA_LSB    _u(0)
#define M33_ID_MMFR3_CMAINTVA_ACCESS "RO"
// =============================================================================
// Register    : M33_ID_ISAR0
// Description : Provides information about the instruction set implemented by
//               the PE
#define M33_ID_ISAR0_OFFSET _u(0x0000ed60)
#define M33_ID_ISAR0_BITS   _u(0x0ffffff0)
#define M33_ID_ISAR0_RESET  _u(0x08092300)
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR0_DIVIDE
// Description : Indicates the supported Divide instructions
#define M33_ID_ISAR0_DIVIDE_RESET  _u(0x8)
#define M33_ID_ISAR0_DIVIDE_BITS   _u(0x0f000000)
#define M33_ID_ISAR0_DIVIDE_MSB    _u(27)
#define M33_ID_ISAR0_DIVIDE_LSB    _u(24)
#define M33_ID_ISAR0_DIVIDE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR0_DEBUG
// Description : Indicates the implemented Debug instructions
#define M33_ID_ISAR0_DEBUG_RESET  _u(0x0)
#define M33_ID_ISAR0_DEBUG_BITS   _u(0x00f00000)
#define M33_ID_ISAR0_DEBUG_MSB    _u(23)
#define M33_ID_ISAR0_DEBUG_LSB    _u(20)
#define M33_ID_ISAR0_DEBUG_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR0_COPROC
// Description : Indicates the supported Coprocessor instructions
#define M33_ID_ISAR0_COPROC_RESET  _u(0x9)
#define M33_ID_ISAR0_COPROC_BITS   _u(0x000f0000)
#define M33_ID_ISAR0_COPROC_MSB    _u(19)
#define M33_ID_ISAR0_COPROC_LSB    _u(16)
#define M33_ID_ISAR0_COPROC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR0_CMPBRANCH
// Description : Indicates the supported combined Compare and Branch
//               instructions
#define M33_ID_ISAR0_CMPBRANCH_RESET  _u(0x2)
#define M33_ID_ISAR0_CMPBRANCH_BITS   _u(0x0000f000)
#define M33_ID_ISAR0_CMPBRANCH_MSB    _u(15)
#define M33_ID_ISAR0_CMPBRANCH_LSB    _u(12)
#define M33_ID_ISAR0_CMPBRANCH_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR0_BITFIELD
// Description : Indicates the supported bit field instructions
#define M33_ID_ISAR0_BITFIELD_RESET  _u(0x3)
#define M33_ID_ISAR0_BITFIELD_BITS   _u(0x00000f00)
#define M33_ID_ISAR0_BITFIELD_MSB    _u(11)
#define M33_ID_ISAR0_BITFIELD_LSB    _u(8)
#define M33_ID_ISAR0_BITFIELD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR0_BITCOUNT
// Description : Indicates the supported bit count instructions
#define M33_ID_ISAR0_BITCOUNT_RESET  _u(0x0)
#define M33_ID_ISAR0_BITCOUNT_BITS   _u(0x000000f0)
#define M33_ID_ISAR0_BITCOUNT_MSB    _u(7)
#define M33_ID_ISAR0_BITCOUNT_LSB    _u(4)
#define M33_ID_ISAR0_BITCOUNT_ACCESS "RO"
// =============================================================================
// Register    : M33_ID_ISAR1
// Description : Provides information about the instruction set implemented by
//               the PE
#define M33_ID_ISAR1_OFFSET _u(0x0000ed64)
#define M33_ID_ISAR1_BITS   _u(0x0ffff000)
#define M33_ID_ISAR1_RESET  _u(0x05725000)
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR1_INTERWORK
// Description : Indicates the implemented Interworking instructions
#define M33_ID_ISAR1_INTERWORK_RESET  _u(0x5)
#define M33_ID_ISAR1_INTERWORK_BITS   _u(0x0f000000)
#define M33_ID_ISAR1_INTERWORK_MSB    _u(27)
#define M33_ID_ISAR1_INTERWORK_LSB    _u(24)
#define M33_ID_ISAR1_INTERWORK_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR1_IMMEDIATE
// Description : Indicates the implemented for data-processing instructions with
//               long immediates
#define M33_ID_ISAR1_IMMEDIATE_RESET  _u(0x7)
#define M33_ID_ISAR1_IMMEDIATE_BITS   _u(0x00f00000)
#define M33_ID_ISAR1_IMMEDIATE_MSB    _u(23)
#define M33_ID_ISAR1_IMMEDIATE_LSB    _u(20)
#define M33_ID_ISAR1_IMMEDIATE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR1_IFTHEN
// Description : Indicates the implemented If-Then instructions
#define M33_ID_ISAR1_IFTHEN_RESET  _u(0x2)
#define M33_ID_ISAR1_IFTHEN_BITS   _u(0x000f0000)
#define M33_ID_ISAR1_IFTHEN_MSB    _u(19)
#define M33_ID_ISAR1_IFTHEN_LSB    _u(16)
#define M33_ID_ISAR1_IFTHEN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR1_EXTEND
// Description : Indicates the implemented Extend instructions
#define M33_ID_ISAR1_EXTEND_RESET  _u(0x5)
#define M33_ID_ISAR1_EXTEND_BITS   _u(0x0000f000)
#define M33_ID_ISAR1_EXTEND_MSB    _u(15)
#define M33_ID_ISAR1_EXTEND_LSB    _u(12)
#define M33_ID_ISAR1_EXTEND_ACCESS "RO"
// =============================================================================
// Register    : M33_ID_ISAR2
// Description : Provides information about the instruction set implemented by
//               the PE
#define M33_ID_ISAR2_OFFSET _u(0x0000ed68)
#define M33_ID_ISAR2_BITS   _u(0xf0ffffff)
#define M33_ID_ISAR2_RESET  _u(0x30173426)
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR2_REVERSAL
// Description : Indicates the implemented Reversal instructions
#define M33_ID_ISAR2_REVERSAL_RESET  _u(0x3)
#define M33_ID_ISAR2_REVERSAL_BITS   _u(0xf0000000)
#define M33_ID_ISAR2_REVERSAL_MSB    _u(31)
#define M33_ID_ISAR2_REVERSAL_LSB    _u(28)
#define M33_ID_ISAR2_REVERSAL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR2_MULTU
// Description : Indicates the implemented advanced unsigned Multiply
//               instructions
#define M33_ID_ISAR2_MULTU_RESET  _u(0x1)
#define M33_ID_ISAR2_MULTU_BITS   _u(0x00f00000)
#define M33_ID_ISAR2_MULTU_MSB    _u(23)
#define M33_ID_ISAR2_MULTU_LSB    _u(20)
#define M33_ID_ISAR2_MULTU_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR2_MULTS
// Description : Indicates the implemented advanced signed Multiply instructions
#define M33_ID_ISAR2_MULTS_RESET  _u(0x7)
#define M33_ID_ISAR2_MULTS_BITS   _u(0x000f0000)
#define M33_ID_ISAR2_MULTS_MSB    _u(19)
#define M33_ID_ISAR2_MULTS_LSB    _u(16)
#define M33_ID_ISAR2_MULTS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR2_MULT
// Description : Indicates the implemented additional Multiply instructions
#define M33_ID_ISAR2_MULT_RESET  _u(0x3)
#define M33_ID_ISAR2_MULT_BITS   _u(0x0000f000)
#define M33_ID_ISAR2_MULT_MSB    _u(15)
#define M33_ID_ISAR2_MULT_LSB    _u(12)
#define M33_ID_ISAR2_MULT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR2_MULTIACCESSINT
// Description : Indicates the support for interruptible multi-access
//               instructions
#define M33_ID_ISAR2_MULTIACCESSINT_RESET  _u(0x4)
#define M33_ID_ISAR2_MULTIACCESSINT_BITS   _u(0x00000f00)
#define M33_ID_ISAR2_MULTIACCESSINT_MSB    _u(11)
#define M33_ID_ISAR2_MULTIACCESSINT_LSB    _u(8)
#define M33_ID_ISAR2_MULTIACCESSINT_ACCESS "RO"
// -----------------------------------------------------------------------------
