Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/m33.h
// Field       : M33_ID_ISAR2_MEMHINT
// Description : Indicates the implemented Memory Hint instructions
#define M33_ID_ISAR2_MEMHINT_RESET  _u(0x2)
#define M33_ID_ISAR2_MEMHINT_BITS   _u(0x000000f0)
#define M33_ID_ISAR2_MEMHINT_MSB    _u(7)
#define M33_ID_ISAR2_MEMHINT_LSB    _u(4)
#define M33_ID_ISAR2_MEMHINT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR2_LOADSTORE
// Description : Indicates the implemented additional load/store instructions
#define M33_ID_ISAR2_LOADSTORE_RESET  _u(0x6)
#define M33_ID_ISAR2_LOADSTORE_BITS   _u(0x0000000f)
#define M33_ID_ISAR2_LOADSTORE_MSB    _u(3)
#define M33_ID_ISAR2_LOADSTORE_LSB    _u(0)
#define M33_ID_ISAR2_LOADSTORE_ACCESS "RO"
// =============================================================================
// Register    : M33_ID_ISAR3
// Description : Provides information about the instruction set implemented by
//               the PE
#define M33_ID_ISAR3_OFFSET _u(0x0000ed6c)
#define M33_ID_ISAR3_BITS   _u(0x0fffffff)
#define M33_ID_ISAR3_RESET  _u(0x07895729)
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR3_TRUENOP
// Description : Indicates the implemented true NOP instructions
#define M33_ID_ISAR3_TRUENOP_RESET  _u(0x7)
#define M33_ID_ISAR3_TRUENOP_BITS   _u(0x0f000000)
#define M33_ID_ISAR3_TRUENOP_MSB    _u(27)
#define M33_ID_ISAR3_TRUENOP_LSB    _u(24)
#define M33_ID_ISAR3_TRUENOP_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR3_T32COPY
// Description : Indicates the support for T32 non flag-setting MOV instructions
#define M33_ID_ISAR3_T32COPY_RESET  _u(0x8)
#define M33_ID_ISAR3_T32COPY_BITS   _u(0x00f00000)
#define M33_ID_ISAR3_T32COPY_MSB    _u(23)
#define M33_ID_ISAR3_T32COPY_LSB    _u(20)
#define M33_ID_ISAR3_T32COPY_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR3_TABBRANCH
// Description : Indicates the implemented Table Branch instructions
#define M33_ID_ISAR3_TABBRANCH_RESET  _u(0x9)
#define M33_ID_ISAR3_TABBRANCH_BITS   _u(0x000f0000)
#define M33_ID_ISAR3_TABBRANCH_MSB    _u(19)
#define M33_ID_ISAR3_TABBRANCH_LSB    _u(16)
#define M33_ID_ISAR3_TABBRANCH_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR3_SYNCHPRIM
// Description : Used in conjunction with ID_ISAR4.SynchPrim_frac to indicate
//               the implemented Synchronization Primitive instructions
#define M33_ID_ISAR3_SYNCHPRIM_RESET  _u(0x5)
#define M33_ID_ISAR3_SYNCHPRIM_BITS   _u(0x0000f000)
#define M33_ID_ISAR3_SYNCHPRIM_MSB    _u(15)
#define M33_ID_ISAR3_SYNCHPRIM_LSB    _u(12)
#define M33_ID_ISAR3_SYNCHPRIM_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR3_SVC
// Description : Indicates the implemented SVC instructions
#define M33_ID_ISAR3_SVC_RESET  _u(0x7)
#define M33_ID_ISAR3_SVC_BITS   _u(0x00000f00)
#define M33_ID_ISAR3_SVC_MSB    _u(11)
#define M33_ID_ISAR3_SVC_LSB    _u(8)
#define M33_ID_ISAR3_SVC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR3_SIMD
// Description : Indicates the implemented SIMD instructions
#define M33_ID_ISAR3_SIMD_RESET  _u(0x2)
#define M33_ID_ISAR3_SIMD_BITS   _u(0x000000f0)
#define M33_ID_ISAR3_SIMD_MSB    _u(7)
#define M33_ID_ISAR3_SIMD_LSB    _u(4)
#define M33_ID_ISAR3_SIMD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR3_SATURATE
// Description : Indicates the implemented saturating instructions
#define M33_ID_ISAR3_SATURATE_RESET  _u(0x9)
#define M33_ID_ISAR3_SATURATE_BITS   _u(0x0000000f)
#define M33_ID_ISAR3_SATURATE_MSB    _u(3)
#define M33_ID_ISAR3_SATURATE_LSB    _u(0)
#define M33_ID_ISAR3_SATURATE_ACCESS "RO"
// =============================================================================
// Register    : M33_ID_ISAR4
// Description : Provides information about the instruction set implemented by
//               the PE
#define M33_ID_ISAR4_OFFSET _u(0x0000ed70)
#define M33_ID_ISAR4_BITS   _u(0x0fff0fff)
#define M33_ID_ISAR4_RESET  _u(0x01310132)
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR4_PSR_M
// Description : Indicates the implemented M profile instructions to modify the
//               PSRs
#define M33_ID_ISAR4_PSR_M_RESET  _u(0x1)
#define M33_ID_ISAR4_PSR_M_BITS   _u(0x0f000000)
#define M33_ID_ISAR4_PSR_M_MSB    _u(27)
#define M33_ID_ISAR4_PSR_M_LSB    _u(24)
#define M33_ID_ISAR4_PSR_M_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR4_SYNCPRIM_FRAC
// Description : Used in conjunction with ID_ISAR3.SynchPrim to indicate the
//               implemented Synchronization Primitive instructions
#define M33_ID_ISAR4_SYNCPRIM_FRAC_RESET  _u(0x3)
#define M33_ID_ISAR4_SYNCPRIM_FRAC_BITS   _u(0x00f00000)
#define M33_ID_ISAR4_SYNCPRIM_FRAC_MSB    _u(23)
#define M33_ID_ISAR4_SYNCPRIM_FRAC_LSB    _u(20)
#define M33_ID_ISAR4_SYNCPRIM_FRAC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR4_BARRIER
// Description : Indicates the implemented Barrier instructions
#define M33_ID_ISAR4_BARRIER_RESET  _u(0x1)
#define M33_ID_ISAR4_BARRIER_BITS   _u(0x000f0000)
#define M33_ID_ISAR4_BARRIER_MSB    _u(19)
#define M33_ID_ISAR4_BARRIER_LSB    _u(16)
#define M33_ID_ISAR4_BARRIER_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR4_WRITEBACK
// Description : Indicates the support for writeback addressing modes
#define M33_ID_ISAR4_WRITEBACK_RESET  _u(0x1)
#define M33_ID_ISAR4_WRITEBACK_BITS   _u(0x00000f00)
#define M33_ID_ISAR4_WRITEBACK_MSB    _u(11)
#define M33_ID_ISAR4_WRITEBACK_LSB    _u(8)
#define M33_ID_ISAR4_WRITEBACK_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR4_WITHSHIFTS
// Description : Indicates the support for writeback addressing modes
#define M33_ID_ISAR4_WITHSHIFTS_RESET  _u(0x3)
#define M33_ID_ISAR4_WITHSHIFTS_BITS   _u(0x000000f0)
#define M33_ID_ISAR4_WITHSHIFTS_MSB    _u(7)
#define M33_ID_ISAR4_WITHSHIFTS_LSB    _u(4)
#define M33_ID_ISAR4_WITHSHIFTS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_ID_ISAR4_UNPRIV
// Description : Indicates the implemented unprivileged instructions
#define M33_ID_ISAR4_UNPRIV_RESET  _u(0x2)
#define M33_ID_ISAR4_UNPRIV_BITS   _u(0x0000000f)
#define M33_ID_ISAR4_UNPRIV_MSB    _u(3)
#define M33_ID_ISAR4_UNPRIV_LSB    _u(0)
#define M33_ID_ISAR4_UNPRIV_ACCESS "RO"
// =============================================================================
// Register    : M33_ID_ISAR5
// Description : Provides information about the instruction set implemented by
//               the PE
#define M33_ID_ISAR5_OFFSET _u(0x0000ed74)
#define M33_ID_ISAR5_BITS   _u(0x00000000)
#define M33_ID_ISAR5_RESET  _u(0x00000000)
#define M33_ID_ISAR5_MSB    _u(31)
#define M33_ID_ISAR5_LSB    _u(0)
#define M33_ID_ISAR5_ACCESS "RW"
// =============================================================================
// Register    : M33_CTR
// Description : Provides information about the architecture of the caches. CTR
//               is RES0 if CLIDR is zero.
#define M33_CTR_OFFSET _u(0x0000ed7c)
#define M33_CTR_BITS   _u(0x8fffc00f)
#define M33_CTR_RESET  _u(0x8000c000)
// -----------------------------------------------------------------------------
// Field       : M33_CTR_RES1
// Description : Reserved, RES1
#define M33_CTR_RES1_RESET  _u(0x1)
#define M33_CTR_RES1_BITS   _u(0x80000000)
#define M33_CTR_RES1_MSB    _u(31)
#define M33_CTR_RES1_LSB    _u(31)
#define M33_CTR_RES1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_CTR_CWG
// Description : Log2 of the number of words of the maximum size of memory that
//               can be overwritten as a result of the eviction of a cache entry
//               that has had a memory location in it modified
#define M33_CTR_CWG_RESET  _u(0x0)
#define M33_CTR_CWG_BITS   _u(0x0f000000)
#define M33_CTR_CWG_MSB    _u(27)
#define M33_CTR_CWG_LSB    _u(24)
#define M33_CTR_CWG_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_CTR_ERG
// Description : Log2 of the number of words of the maximum size of the
//               reservation granule that has been implemented for the Load-
//               Exclusive and Store-Exclusive instructions
#define M33_CTR_ERG_RESET  _u(0x0)
#define M33_CTR_ERG_BITS   _u(0x00f00000)
#define M33_CTR_ERG_MSB    _u(23)
#define M33_CTR_ERG_LSB    _u(20)
#define M33_CTR_ERG_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_CTR_DMINLINE
// Description : Log2 of the number of words in the smallest cache line of all
//               the data caches and unified caches that are controlled by the
//               PE
#define M33_CTR_DMINLINE_RESET  _u(0x0)
#define M33_CTR_DMINLINE_BITS   _u(0x000f0000)
#define M33_CTR_DMINLINE_MSB    _u(19)
#define M33_CTR_DMINLINE_LSB    _u(16)
#define M33_CTR_DMINLINE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_CTR_RES1_1
// Description : Reserved, RES1
#define M33_CTR_RES1_1_RESET  _u(0x3)
#define M33_CTR_RES1_1_BITS   _u(0x0000c000)
#define M33_CTR_RES1_1_MSB    _u(15)
#define M33_CTR_RES1_1_LSB    _u(14)
#define M33_CTR_RES1_1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_CTR_IMINLINE
// Description : Log2 of the number of words in the smallest cache line of all
//               the instruction caches that are controlled by the PE
#define M33_CTR_IMINLINE_RESET  _u(0x0)
#define M33_CTR_IMINLINE_BITS   _u(0x0000000f)
#define M33_CTR_IMINLINE_MSB    _u(3)
#define M33_CTR_IMINLINE_LSB    _u(0)
#define M33_CTR_IMINLINE_ACCESS "RO"
// =============================================================================
// Register    : M33_CPACR
// Description : Specifies the access privileges for coprocessors and the FP
//               Extension
#define M33_CPACR_OFFSET _u(0x0000ed88)
#define M33_CPACR_BITS   _u(0x00f0ffff)
#define M33_CPACR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CPACR_CP11
// Description : The value in this field is ignored. If the implementation does
//               not include the FP Extension, this field is RAZ/WI. If the
//               value of this bit is not programmed to the same value as the
//               CP10 field, then the value is UNKNOWN
#define M33_CPACR_CP11_RESET  _u(0x0)
#define M33_CPACR_CP11_BITS   _u(0x00c00000)
#define M33_CPACR_CP11_MSB    _u(23)
#define M33_CPACR_CP11_LSB    _u(22)
#define M33_CPACR_CP11_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CPACR_CP10
// Description : Defines the access rights for the floating-point functionality
#define M33_CPACR_CP10_RESET  _u(0x0)
#define M33_CPACR_CP10_BITS   _u(0x00300000)
#define M33_CPACR_CP10_MSB    _u(21)
#define M33_CPACR_CP10_LSB    _u(20)
#define M33_CPACR_CP10_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CPACR_CP7
// Description : Controls access privileges for coprocessor 7
#define M33_CPACR_CP7_RESET  _u(0x0)
#define M33_CPACR_CP7_BITS   _u(0x0000c000)
#define M33_CPACR_CP7_MSB    _u(15)
#define M33_CPACR_CP7_LSB    _u(14)
#define M33_CPACR_CP7_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CPACR_CP6
// Description : Controls access privileges for coprocessor 6
#define M33_CPACR_CP6_RESET  _u(0x0)
#define M33_CPACR_CP6_BITS   _u(0x00003000)
#define M33_CPACR_CP6_MSB    _u(13)
#define M33_CPACR_CP6_LSB    _u(12)
#define M33_CPACR_CP6_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CPACR_CP5
// Description : Controls access privileges for coprocessor 5
#define M33_CPACR_CP5_RESET  _u(0x0)
#define M33_CPACR_CP5_BITS   _u(0x00000c00)
#define M33_CPACR_CP5_MSB    _u(11)
#define M33_CPACR_CP5_LSB    _u(10)
#define M33_CPACR_CP5_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CPACR_CP4
// Description : Controls access privileges for coprocessor 4
#define M33_CPACR_CP4_RESET  _u(0x0)
#define M33_CPACR_CP4_BITS   _u(0x00000300)
#define M33_CPACR_CP4_MSB    _u(9)
#define M33_CPACR_CP4_LSB    _u(8)
#define M33_CPACR_CP4_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CPACR_CP3
// Description : Controls access privileges for coprocessor 3
#define M33_CPACR_CP3_RESET  _u(0x0)
#define M33_CPACR_CP3_BITS   _u(0x000000c0)
#define M33_CPACR_CP3_MSB    _u(7)
#define M33_CPACR_CP3_LSB    _u(6)
#define M33_CPACR_CP3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CPACR_CP2
// Description : Controls access privileges for coprocessor 2
#define M33_CPACR_CP2_RESET  _u(0x0)
#define M33_CPACR_CP2_BITS   _u(0x00000030)
#define M33_CPACR_CP2_MSB    _u(5)
#define M33_CPACR_CP2_LSB    _u(4)
#define M33_CPACR_CP2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CPACR_CP1
// Description : Controls access privileges for coprocessor 1
#define M33_CPACR_CP1_RESET  _u(0x0)
#define M33_CPACR_CP1_BITS   _u(0x0000000c)
#define M33_CPACR_CP1_MSB    _u(3)
#define M33_CPACR_CP1_LSB    _u(2)
#define M33_CPACR_CP1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CPACR_CP0
// Description : Controls access privileges for coprocessor 0
#define M33_CPACR_CP0_RESET  _u(0x0)
#define M33_CPACR_CP0_BITS   _u(0x00000003)
#define M33_CPACR_CP0_MSB    _u(1)
#define M33_CPACR_CP0_LSB    _u(0)
#define M33_CPACR_CP0_ACCESS "RW"
// =============================================================================
// Register    : M33_NSACR
// Description : Defines the Non-secure access permissions for both the FP
//               Extension and coprocessors CP0 to CP7
#define M33_NSACR_OFFSET _u(0x0000ed8c)
#define M33_NSACR_BITS   _u(0x00000cff)
#define M33_NSACR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_NSACR_CP11
// Description : Enables Non-secure access to the Floating-point Extension
#define M33_NSACR_CP11_RESET  _u(0x0)
#define M33_NSACR_CP11_BITS   _u(0x00000800)
#define M33_NSACR_CP11_MSB    _u(11)
#define M33_NSACR_CP11_LSB    _u(11)
#define M33_NSACR_CP11_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NSACR_CP10
// Description : Enables Non-secure access to the Floating-point Extension
#define M33_NSACR_CP10_RESET  _u(0x0)
#define M33_NSACR_CP10_BITS   _u(0x00000400)
#define M33_NSACR_CP10_MSB    _u(10)
#define M33_NSACR_CP10_LSB    _u(10)
#define M33_NSACR_CP10_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NSACR_CP7
// Description : Enables Non-secure access to coprocessor CP7
#define M33_NSACR_CP7_RESET  _u(0x0)
#define M33_NSACR_CP7_BITS   _u(0x00000080)
#define M33_NSACR_CP7_MSB    _u(7)
#define M33_NSACR_CP7_LSB    _u(7)
#define M33_NSACR_CP7_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NSACR_CP6
// Description : Enables Non-secure access to coprocessor CP6
#define M33_NSACR_CP6_RESET  _u(0x0)
#define M33_NSACR_CP6_BITS   _u(0x00000040)
#define M33_NSACR_CP6_MSB    _u(6)
#define M33_NSACR_CP6_LSB    _u(6)
#define M33_NSACR_CP6_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NSACR_CP5
// Description : Enables Non-secure access to coprocessor CP5
#define M33_NSACR_CP5_RESET  _u(0x0)
#define M33_NSACR_CP5_BITS   _u(0x00000020)
#define M33_NSACR_CP5_MSB    _u(5)
#define M33_NSACR_CP5_LSB    _u(5)
#define M33_NSACR_CP5_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NSACR_CP4
// Description : Enables Non-secure access to coprocessor CP4
#define M33_NSACR_CP4_RESET  _u(0x0)
#define M33_NSACR_CP4_BITS   _u(0x00000010)
#define M33_NSACR_CP4_MSB    _u(4)
#define M33_NSACR_CP4_LSB    _u(4)
#define M33_NSACR_CP4_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NSACR_CP3
// Description : Enables Non-secure access to coprocessor CP3
#define M33_NSACR_CP3_RESET  _u(0x0)
#define M33_NSACR_CP3_BITS   _u(0x00000008)
#define M33_NSACR_CP3_MSB    _u(3)
#define M33_NSACR_CP3_LSB    _u(3)
#define M33_NSACR_CP3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NSACR_CP2
// Description : Enables Non-secure access to coprocessor CP2
#define M33_NSACR_CP2_RESET  _u(0x0)
#define M33_NSACR_CP2_BITS   _u(0x00000004)
#define M33_NSACR_CP2_MSB    _u(2)
#define M33_NSACR_CP2_LSB    _u(2)
#define M33_NSACR_CP2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NSACR_CP1
// Description : Enables Non-secure access to coprocessor CP1
#define M33_NSACR_CP1_RESET  _u(0x0)
#define M33_NSACR_CP1_BITS   _u(0x00000002)
#define M33_NSACR_CP1_MSB    _u(1)
#define M33_NSACR_CP1_LSB    _u(1)
#define M33_NSACR_CP1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_NSACR_CP0
// Description : Enables Non-secure access to coprocessor CP0
#define M33_NSACR_CP0_RESET  _u(0x0)
#define M33_NSACR_CP0_BITS   _u(0x00000001)
#define M33_NSACR_CP0_MSB    _u(0)
#define M33_NSACR_CP0_LSB    _u(0)
#define M33_NSACR_CP0_ACCESS "RW"
// =============================================================================
// Register    : M33_MPU_TYPE
// Description : The MPU Type Register indicates how many regions the MPU `FTSSS
//               supports
#define M33_MPU_TYPE_OFFSET _u(0x0000ed90)
#define M33_MPU_TYPE_BITS   _u(0x0000ff01)
#define M33_MPU_TYPE_RESET  _u(0x00000800)
// -----------------------------------------------------------------------------
// Field       : M33_MPU_TYPE_DREGION
// Description : Number of regions supported by the MPU
#define M33_MPU_TYPE_DREGION_RESET  _u(0x08)
#define M33_MPU_TYPE_DREGION_BITS   _u(0x0000ff00)
#define M33_MPU_TYPE_DREGION_MSB    _u(15)
#define M33_MPU_TYPE_DREGION_LSB    _u(8)
#define M33_MPU_TYPE_DREGION_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_TYPE_SEPARATE
// Description : Indicates support for separate instructions and data address
//               regions
#define M33_MPU_TYPE_SEPARATE_RESET  _u(0x0)
#define M33_MPU_TYPE_SEPARATE_BITS   _u(0x00000001)
#define M33_MPU_TYPE_SEPARATE_MSB    _u(0)
#define M33_MPU_TYPE_SEPARATE_LSB    _u(0)
#define M33_MPU_TYPE_SEPARATE_ACCESS "RO"
// =============================================================================
// Register    : M33_MPU_CTRL
// Description : Enables the MPU and, when the MPU is enabled, controls whether
//               the default memory map is enabled as a background region for
//               privileged accesses, and whether the MPU is enabled for
//               HardFaults, NMIs, and exception handlers when FAULTMASK is set
//               to 1
#define M33_MPU_CTRL_OFFSET _u(0x0000ed94)
#define M33_MPU_CTRL_BITS   _u(0x00000007)
#define M33_MPU_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_MPU_CTRL_PRIVDEFENA
// Description : Controls whether the default memory map is enabled for
//               privileged software
#define M33_MPU_CTRL_PRIVDEFENA_RESET  _u(0x0)
#define M33_MPU_CTRL_PRIVDEFENA_BITS   _u(0x00000004)
#define M33_MPU_CTRL_PRIVDEFENA_MSB    _u(2)
#define M33_MPU_CTRL_PRIVDEFENA_LSB    _u(2)
#define M33_MPU_CTRL_PRIVDEFENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_CTRL_HFNMIENA
// Description : Controls whether handlers executing with priority less than 0
//               access memory with the MPU enabled or disabled. This applies to
//               HardFaults, NMIs, and exception handlers when FAULTMASK is set
//               to 1
#define M33_MPU_CTRL_HFNMIENA_RESET  _u(0x0)
#define M33_MPU_CTRL_HFNMIENA_BITS   _u(0x00000002)
#define M33_MPU_CTRL_HFNMIENA_MSB    _u(1)
#define M33_MPU_CTRL_HFNMIENA_LSB    _u(1)
#define M33_MPU_CTRL_HFNMIENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_CTRL_ENABLE
// Description : Enables the MPU
#define M33_MPU_CTRL_ENABLE_RESET  _u(0x0)
#define M33_MPU_CTRL_ENABLE_BITS   _u(0x00000001)
#define M33_MPU_CTRL_ENABLE_MSB    _u(0)
#define M33_MPU_CTRL_ENABLE_LSB    _u(0)
#define M33_MPU_CTRL_ENABLE_ACCESS "RW"
// =============================================================================
// Register    : M33_MPU_RNR
// Description : Selects the region currently accessed by MPU_RBAR and MPU_RLAR
#define M33_MPU_RNR_OFFSET _u(0x0000ed98)
#define M33_MPU_RNR_BITS   _u(0x00000007)
#define M33_MPU_RNR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RNR_REGION
// Description : Indicates the memory region accessed by MPU_RBAR and MPU_RLAR
#define M33_MPU_RNR_REGION_RESET  _u(0x0)
#define M33_MPU_RNR_REGION_BITS   _u(0x00000007)
#define M33_MPU_RNR_REGION_MSB    _u(2)
#define M33_MPU_RNR_REGION_LSB    _u(0)
#define M33_MPU_RNR_REGION_ACCESS "RW"
// =============================================================================
// Register    : M33_MPU_RBAR
// Description : Provides indirect read and write access to the base address of
//               the currently selected MPU region `FTSSS
#define M33_MPU_RBAR_OFFSET _u(0x0000ed9c)
#define M33_MPU_RBAR_BITS   _u(0xffffffff)
#define M33_MPU_RBAR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RBAR_BASE
// Description : Contains bits [31:5] of the lower inclusive limit of the
//               selected MPU memory region. This value is zero extended to
//               provide the base address to be checked against
#define M33_MPU_RBAR_BASE_RESET  _u(0x0000000)
#define M33_MPU_RBAR_BASE_BITS   _u(0xffffffe0)
#define M33_MPU_RBAR_BASE_MSB    _u(31)
#define M33_MPU_RBAR_BASE_LSB    _u(5)
#define M33_MPU_RBAR_BASE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RBAR_SH
// Description : Defines the Shareability domain of this region for Normal
//               memory
#define M33_MPU_RBAR_SH_RESET  _u(0x0)
#define M33_MPU_RBAR_SH_BITS   _u(0x00000018)
#define M33_MPU_RBAR_SH_MSB    _u(4)
#define M33_MPU_RBAR_SH_LSB    _u(3)
#define M33_MPU_RBAR_SH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RBAR_AP
// Description : Defines the access permissions for this region
