Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/m33.h
#define M33_MPU_RBAR_AP_RESET  _u(0x0)
#define M33_MPU_RBAR_AP_BITS   _u(0x00000006)
#define M33_MPU_RBAR_AP_MSB    _u(2)
#define M33_MPU_RBAR_AP_LSB    _u(1)
#define M33_MPU_RBAR_AP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RBAR_XN
// Description : Defines whether code can be executed from this region
#define M33_MPU_RBAR_XN_RESET  _u(0x0)
#define M33_MPU_RBAR_XN_BITS   _u(0x00000001)
#define M33_MPU_RBAR_XN_MSB    _u(0)
#define M33_MPU_RBAR_XN_LSB    _u(0)
#define M33_MPU_RBAR_XN_ACCESS "RW"
// =============================================================================
// Register    : M33_MPU_RLAR
// Description : Provides indirect read and write access to the limit address of
//               the currently selected MPU region `FTSSS
#define M33_MPU_RLAR_OFFSET _u(0x0000eda0)
#define M33_MPU_RLAR_BITS   _u(0xffffffef)
#define M33_MPU_RLAR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RLAR_LIMIT
// Description : Contains bits [31:5] of the upper inclusive limit of the
//               selected MPU memory region. This value is postfixed with 0x1F
//               to provide the limit address to be checked against
#define M33_MPU_RLAR_LIMIT_RESET  _u(0x0000000)
#define M33_MPU_RLAR_LIMIT_BITS   _u(0xffffffe0)
#define M33_MPU_RLAR_LIMIT_MSB    _u(31)
#define M33_MPU_RLAR_LIMIT_LSB    _u(5)
#define M33_MPU_RLAR_LIMIT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RLAR_ATTRINDX
// Description : Associates a set of attributes in the MPU_MAIR0 and MPU_MAIR1
//               fields
#define M33_MPU_RLAR_ATTRINDX_RESET  _u(0x0)
#define M33_MPU_RLAR_ATTRINDX_BITS   _u(0x0000000e)
#define M33_MPU_RLAR_ATTRINDX_MSB    _u(3)
#define M33_MPU_RLAR_ATTRINDX_LSB    _u(1)
#define M33_MPU_RLAR_ATTRINDX_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RLAR_EN
// Description : Region enable
#define M33_MPU_RLAR_EN_RESET  _u(0x0)
#define M33_MPU_RLAR_EN_BITS   _u(0x00000001)
#define M33_MPU_RLAR_EN_MSB    _u(0)
#define M33_MPU_RLAR_EN_LSB    _u(0)
#define M33_MPU_RLAR_EN_ACCESS "RW"
// =============================================================================
// Register    : M33_MPU_RBAR_A1
// Description : Provides indirect read and write access to the base address of
//               the MPU region selected by MPU_RNR[7:2]:(1[1:0]) `FTSSS
#define M33_MPU_RBAR_A1_OFFSET _u(0x0000eda4)
#define M33_MPU_RBAR_A1_BITS   _u(0xffffffff)
#define M33_MPU_RBAR_A1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RBAR_A1_BASE
// Description : Contains bits [31:5] of the lower inclusive limit of the
//               selected MPU memory region. This value is zero extended to
//               provide the base address to be checked against
#define M33_MPU_RBAR_A1_BASE_RESET  _u(0x0000000)
#define M33_MPU_RBAR_A1_BASE_BITS   _u(0xffffffe0)
#define M33_MPU_RBAR_A1_BASE_MSB    _u(31)
#define M33_MPU_RBAR_A1_BASE_LSB    _u(5)
#define M33_MPU_RBAR_A1_BASE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RBAR_A1_SH
// Description : Defines the Shareability domain of this region for Normal
//               memory
#define M33_MPU_RBAR_A1_SH_RESET  _u(0x0)
#define M33_MPU_RBAR_A1_SH_BITS   _u(0x00000018)
#define M33_MPU_RBAR_A1_SH_MSB    _u(4)
#define M33_MPU_RBAR_A1_SH_LSB    _u(3)
#define M33_MPU_RBAR_A1_SH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RBAR_A1_AP
// Description : Defines the access permissions for this region
#define M33_MPU_RBAR_A1_AP_RESET  _u(0x0)
#define M33_MPU_RBAR_A1_AP_BITS   _u(0x00000006)
#define M33_MPU_RBAR_A1_AP_MSB    _u(2)
#define M33_MPU_RBAR_A1_AP_LSB    _u(1)
#define M33_MPU_RBAR_A1_AP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RBAR_A1_XN
// Description : Defines whether code can be executed from this region
#define M33_MPU_RBAR_A1_XN_RESET  _u(0x0)
#define M33_MPU_RBAR_A1_XN_BITS   _u(0x00000001)
#define M33_MPU_RBAR_A1_XN_MSB    _u(0)
#define M33_MPU_RBAR_A1_XN_LSB    _u(0)
#define M33_MPU_RBAR_A1_XN_ACCESS "RW"
// =============================================================================
// Register    : M33_MPU_RLAR_A1
// Description : Provides indirect read and write access to the limit address of
//               the currently selected MPU region selected by
//               MPU_RNR[7:2]:(1[1:0]) `FTSSS
#define M33_MPU_RLAR_A1_OFFSET _u(0x0000eda8)
#define M33_MPU_RLAR_A1_BITS   _u(0xffffffef)
#define M33_MPU_RLAR_A1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RLAR_A1_LIMIT
// Description : Contains bits [31:5] of the upper inclusive limit of the
//               selected MPU memory region. This value is postfixed with 0x1F
//               to provide the limit address to be checked against
#define M33_MPU_RLAR_A1_LIMIT_RESET  _u(0x0000000)
#define M33_MPU_RLAR_A1_LIMIT_BITS   _u(0xffffffe0)
#define M33_MPU_RLAR_A1_LIMIT_MSB    _u(31)
#define M33_MPU_RLAR_A1_LIMIT_LSB    _u(5)
#define M33_MPU_RLAR_A1_LIMIT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RLAR_A1_ATTRINDX
// Description : Associates a set of attributes in the MPU_MAIR0 and MPU_MAIR1
//               fields
#define M33_MPU_RLAR_A1_ATTRINDX_RESET  _u(0x0)
#define M33_MPU_RLAR_A1_ATTRINDX_BITS   _u(0x0000000e)
#define M33_MPU_RLAR_A1_ATTRINDX_MSB    _u(3)
#define M33_MPU_RLAR_A1_ATTRINDX_LSB    _u(1)
#define M33_MPU_RLAR_A1_ATTRINDX_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RLAR_A1_EN
// Description : Region enable
#define M33_MPU_RLAR_A1_EN_RESET  _u(0x0)
#define M33_MPU_RLAR_A1_EN_BITS   _u(0x00000001)
#define M33_MPU_RLAR_A1_EN_MSB    _u(0)
#define M33_MPU_RLAR_A1_EN_LSB    _u(0)
#define M33_MPU_RLAR_A1_EN_ACCESS "RW"
// =============================================================================
// Register    : M33_MPU_RBAR_A2
// Description : Provides indirect read and write access to the base address of
//               the MPU region selected by MPU_RNR[7:2]:(2[1:0]) `FTSSS
#define M33_MPU_RBAR_A2_OFFSET _u(0x0000edac)
#define M33_MPU_RBAR_A2_BITS   _u(0xffffffff)
#define M33_MPU_RBAR_A2_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RBAR_A2_BASE
// Description : Contains bits [31:5] of the lower inclusive limit of the
//               selected MPU memory region. This value is zero extended to
//               provide the base address to be checked against
#define M33_MPU_RBAR_A2_BASE_RESET  _u(0x0000000)
#define M33_MPU_RBAR_A2_BASE_BITS   _u(0xffffffe0)
#define M33_MPU_RBAR_A2_BASE_MSB    _u(31)
#define M33_MPU_RBAR_A2_BASE_LSB    _u(5)
#define M33_MPU_RBAR_A2_BASE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RBAR_A2_SH
// Description : Defines the Shareability domain of this region for Normal
//               memory
#define M33_MPU_RBAR_A2_SH_RESET  _u(0x0)
#define M33_MPU_RBAR_A2_SH_BITS   _u(0x00000018)
#define M33_MPU_RBAR_A2_SH_MSB    _u(4)
#define M33_MPU_RBAR_A2_SH_LSB    _u(3)
#define M33_MPU_RBAR_A2_SH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RBAR_A2_AP
// Description : Defines the access permissions for this region
#define M33_MPU_RBAR_A2_AP_RESET  _u(0x0)
#define M33_MPU_RBAR_A2_AP_BITS   _u(0x00000006)
#define M33_MPU_RBAR_A2_AP_MSB    _u(2)
#define M33_MPU_RBAR_A2_AP_LSB    _u(1)
#define M33_MPU_RBAR_A2_AP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RBAR_A2_XN
// Description : Defines whether code can be executed from this region
#define M33_MPU_RBAR_A2_XN_RESET  _u(0x0)
#define M33_MPU_RBAR_A2_XN_BITS   _u(0x00000001)
#define M33_MPU_RBAR_A2_XN_MSB    _u(0)
#define M33_MPU_RBAR_A2_XN_LSB    _u(0)
#define M33_MPU_RBAR_A2_XN_ACCESS "RW"
// =============================================================================
// Register    : M33_MPU_RLAR_A2
// Description : Provides indirect read and write access to the limit address of
//               the currently selected MPU region selected by
//               MPU_RNR[7:2]:(2[1:0]) `FTSSS
#define M33_MPU_RLAR_A2_OFFSET _u(0x0000edb0)
#define M33_MPU_RLAR_A2_BITS   _u(0xffffffef)
#define M33_MPU_RLAR_A2_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RLAR_A2_LIMIT
// Description : Contains bits [31:5] of the upper inclusive limit of the
//               selected MPU memory region. This value is postfixed with 0x1F
//               to provide the limit address to be checked against
#define M33_MPU_RLAR_A2_LIMIT_RESET  _u(0x0000000)
#define M33_MPU_RLAR_A2_LIMIT_BITS   _u(0xffffffe0)
#define M33_MPU_RLAR_A2_LIMIT_MSB    _u(31)
#define M33_MPU_RLAR_A2_LIMIT_LSB    _u(5)
#define M33_MPU_RLAR_A2_LIMIT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RLAR_A2_ATTRINDX
// Description : Associates a set of attributes in the MPU_MAIR0 and MPU_MAIR1
//               fields
#define M33_MPU_RLAR_A2_ATTRINDX_RESET  _u(0x0)
#define M33_MPU_RLAR_A2_ATTRINDX_BITS   _u(0x0000000e)
#define M33_MPU_RLAR_A2_ATTRINDX_MSB    _u(3)
#define M33_MPU_RLAR_A2_ATTRINDX_LSB    _u(1)
#define M33_MPU_RLAR_A2_ATTRINDX_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RLAR_A2_EN
// Description : Region enable
#define M33_MPU_RLAR_A2_EN_RESET  _u(0x0)
#define M33_MPU_RLAR_A2_EN_BITS   _u(0x00000001)
#define M33_MPU_RLAR_A2_EN_MSB    _u(0)
#define M33_MPU_RLAR_A2_EN_LSB    _u(0)
#define M33_MPU_RLAR_A2_EN_ACCESS "RW"
// =============================================================================
// Register    : M33_MPU_RBAR_A3
// Description : Provides indirect read and write access to the base address of
//               the MPU region selected by MPU_RNR[7:2]:(3[1:0]) `FTSSS
#define M33_MPU_RBAR_A3_OFFSET _u(0x0000edb4)
#define M33_MPU_RBAR_A3_BITS   _u(0xffffffff)
#define M33_MPU_RBAR_A3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RBAR_A3_BASE
// Description : Contains bits [31:5] of the lower inclusive limit of the
//               selected MPU memory region. This value is zero extended to
//               provide the base address to be checked against
#define M33_MPU_RBAR_A3_BASE_RESET  _u(0x0000000)
#define M33_MPU_RBAR_A3_BASE_BITS   _u(0xffffffe0)
#define M33_MPU_RBAR_A3_BASE_MSB    _u(31)
#define M33_MPU_RBAR_A3_BASE_LSB    _u(5)
#define M33_MPU_RBAR_A3_BASE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RBAR_A3_SH
// Description : Defines the Shareability domain of this region for Normal
//               memory
#define M33_MPU_RBAR_A3_SH_RESET  _u(0x0)
#define M33_MPU_RBAR_A3_SH_BITS   _u(0x00000018)
#define M33_MPU_RBAR_A3_SH_MSB    _u(4)
#define M33_MPU_RBAR_A3_SH_LSB    _u(3)
#define M33_MPU_RBAR_A3_SH_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RBAR_A3_AP
// Description : Defines the access permissions for this region
#define M33_MPU_RBAR_A3_AP_RESET  _u(0x0)
#define M33_MPU_RBAR_A3_AP_BITS   _u(0x00000006)
#define M33_MPU_RBAR_A3_AP_MSB    _u(2)
#define M33_MPU_RBAR_A3_AP_LSB    _u(1)
#define M33_MPU_RBAR_A3_AP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RBAR_A3_XN
// Description : Defines whether code can be executed from this region
#define M33_MPU_RBAR_A3_XN_RESET  _u(0x0)
#define M33_MPU_RBAR_A3_XN_BITS   _u(0x00000001)
#define M33_MPU_RBAR_A3_XN_MSB    _u(0)
#define M33_MPU_RBAR_A3_XN_LSB    _u(0)
#define M33_MPU_RBAR_A3_XN_ACCESS "RW"
// =============================================================================
// Register    : M33_MPU_RLAR_A3
// Description : Provides indirect read and write access to the limit address of
//               the currently selected MPU region selected by
//               MPU_RNR[7:2]:(3[1:0]) `FTSSS
#define M33_MPU_RLAR_A3_OFFSET _u(0x0000edb8)
#define M33_MPU_RLAR_A3_BITS   _u(0xffffffef)
#define M33_MPU_RLAR_A3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RLAR_A3_LIMIT
// Description : Contains bits [31:5] of the upper inclusive limit of the
//               selected MPU memory region. This value is postfixed with 0x1F
//               to provide the limit address to be checked against
#define M33_MPU_RLAR_A3_LIMIT_RESET  _u(0x0000000)
#define M33_MPU_RLAR_A3_LIMIT_BITS   _u(0xffffffe0)
#define M33_MPU_RLAR_A3_LIMIT_MSB    _u(31)
#define M33_MPU_RLAR_A3_LIMIT_LSB    _u(5)
#define M33_MPU_RLAR_A3_LIMIT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RLAR_A3_ATTRINDX
// Description : Associates a set of attributes in the MPU_MAIR0 and MPU_MAIR1
//               fields
#define M33_MPU_RLAR_A3_ATTRINDX_RESET  _u(0x0)
#define M33_MPU_RLAR_A3_ATTRINDX_BITS   _u(0x0000000e)
#define M33_MPU_RLAR_A3_ATTRINDX_MSB    _u(3)
#define M33_MPU_RLAR_A3_ATTRINDX_LSB    _u(1)
#define M33_MPU_RLAR_A3_ATTRINDX_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_RLAR_A3_EN
// Description : Region enable
#define M33_MPU_RLAR_A3_EN_RESET  _u(0x0)
#define M33_MPU_RLAR_A3_EN_BITS   _u(0x00000001)
#define M33_MPU_RLAR_A3_EN_MSB    _u(0)
#define M33_MPU_RLAR_A3_EN_LSB    _u(0)
#define M33_MPU_RLAR_A3_EN_ACCESS "RW"
// =============================================================================
// Register    : M33_MPU_MAIR0
// Description : Along with MPU_MAIR1, provides the memory attribute encodings
//               corresponding to the AttrIndex values
#define M33_MPU_MAIR0_OFFSET _u(0x0000edc0)
#define M33_MPU_MAIR0_BITS   _u(0xffffffff)
#define M33_MPU_MAIR0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_MPU_MAIR0_ATTR3
// Description : Memory attribute encoding for MPU regions with an AttrIndex of
//               3
#define M33_MPU_MAIR0_ATTR3_RESET  _u(0x00)
#define M33_MPU_MAIR0_ATTR3_BITS   _u(0xff000000)
#define M33_MPU_MAIR0_ATTR3_MSB    _u(31)
#define M33_MPU_MAIR0_ATTR3_LSB    _u(24)
#define M33_MPU_MAIR0_ATTR3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_MAIR0_ATTR2
// Description : Memory attribute encoding for MPU regions with an AttrIndex of
//               2
#define M33_MPU_MAIR0_ATTR2_RESET  _u(0x00)
#define M33_MPU_MAIR0_ATTR2_BITS   _u(0x00ff0000)
#define M33_MPU_MAIR0_ATTR2_MSB    _u(23)
#define M33_MPU_MAIR0_ATTR2_LSB    _u(16)
#define M33_MPU_MAIR0_ATTR2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_MAIR0_ATTR1
// Description : Memory attribute encoding for MPU regions with an AttrIndex of
//               1
#define M33_MPU_MAIR0_ATTR1_RESET  _u(0x00)
#define M33_MPU_MAIR0_ATTR1_BITS   _u(0x0000ff00)
#define M33_MPU_MAIR0_ATTR1_MSB    _u(15)
#define M33_MPU_MAIR0_ATTR1_LSB    _u(8)
#define M33_MPU_MAIR0_ATTR1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_MAIR0_ATTR0
// Description : Memory attribute encoding for MPU regions with an AttrIndex of
//               0
#define M33_MPU_MAIR0_ATTR0_RESET  _u(0x00)
#define M33_MPU_MAIR0_ATTR0_BITS   _u(0x000000ff)
#define M33_MPU_MAIR0_ATTR0_MSB    _u(7)
#define M33_MPU_MAIR0_ATTR0_LSB    _u(0)
#define M33_MPU_MAIR0_ATTR0_ACCESS "RW"
// =============================================================================
// Register    : M33_MPU_MAIR1
// Description : Along with MPU_MAIR0, provides the memory attribute encodings
//               corresponding to the AttrIndex values
#define M33_MPU_MAIR1_OFFSET _u(0x0000edc4)
#define M33_MPU_MAIR1_BITS   _u(0xffffffff)
#define M33_MPU_MAIR1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_MPU_MAIR1_ATTR7
// Description : Memory attribute encoding for MPU regions with an AttrIndex of
//               7
#define M33_MPU_MAIR1_ATTR7_RESET  _u(0x00)
#define M33_MPU_MAIR1_ATTR7_BITS   _u(0xff000000)
#define M33_MPU_MAIR1_ATTR7_MSB    _u(31)
#define M33_MPU_MAIR1_ATTR7_LSB    _u(24)
#define M33_MPU_MAIR1_ATTR7_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_MAIR1_ATTR6
// Description : Memory attribute encoding for MPU regions with an AttrIndex of
//               6
#define M33_MPU_MAIR1_ATTR6_RESET  _u(0x00)
#define M33_MPU_MAIR1_ATTR6_BITS   _u(0x00ff0000)
#define M33_MPU_MAIR1_ATTR6_MSB    _u(23)
#define M33_MPU_MAIR1_ATTR6_LSB    _u(16)
#define M33_MPU_MAIR1_ATTR6_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_MAIR1_ATTR5
// Description : Memory attribute encoding for MPU regions with an AttrIndex of
//               5
#define M33_MPU_MAIR1_ATTR5_RESET  _u(0x00)
#define M33_MPU_MAIR1_ATTR5_BITS   _u(0x0000ff00)
#define M33_MPU_MAIR1_ATTR5_MSB    _u(15)
#define M33_MPU_MAIR1_ATTR5_LSB    _u(8)
#define M33_MPU_MAIR1_ATTR5_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_MPU_MAIR1_ATTR4
// Description : Memory attribute encoding for MPU regions with an AttrIndex of
//               4
#define M33_MPU_MAIR1_ATTR4_RESET  _u(0x00)
#define M33_MPU_MAIR1_ATTR4_BITS   _u(0x000000ff)
#define M33_MPU_MAIR1_ATTR4_MSB    _u(7)
#define M33_MPU_MAIR1_ATTR4_LSB    _u(0)
#define M33_MPU_MAIR1_ATTR4_ACCESS "RW"
// =============================================================================
// Register    : M33_SAU_CTRL
// Description : Allows enabling of the Security Attribution Unit
#define M33_SAU_CTRL_OFFSET _u(0x0000edd0)
#define M33_SAU_CTRL_BITS   _u(0x00000003)
#define M33_SAU_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_SAU_CTRL_ALLNS
// Description : When SAU_CTRL.ENABLE is 0 this bit controls if the memory is
//               marked as Non-secure or Secure
#define M33_SAU_CTRL_ALLNS_RESET  _u(0x0)
#define M33_SAU_CTRL_ALLNS_BITS   _u(0x00000002)
#define M33_SAU_CTRL_ALLNS_MSB    _u(1)
#define M33_SAU_CTRL_ALLNS_LSB    _u(1)
#define M33_SAU_CTRL_ALLNS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SAU_CTRL_ENABLE
// Description : Enables the SAU
#define M33_SAU_CTRL_ENABLE_RESET  _u(0x0)
#define M33_SAU_CTRL_ENABLE_BITS   _u(0x00000001)
#define M33_SAU_CTRL_ENABLE_MSB    _u(0)
#define M33_SAU_CTRL_ENABLE_LSB    _u(0)
#define M33_SAU_CTRL_ENABLE_ACCESS "RW"
// =============================================================================
// Register    : M33_SAU_TYPE
// Description : Indicates the number of regions implemented by the Security
//               Attribution Unit
#define M33_SAU_TYPE_OFFSET _u(0x0000edd4)
#define M33_SAU_TYPE_BITS   _u(0x000000ff)
#define M33_SAU_TYPE_RESET  _u(0x00000008)
// -----------------------------------------------------------------------------
// Field       : M33_SAU_TYPE_SREGION
// Description : The number of implemented SAU regions
#define M33_SAU_TYPE_SREGION_RESET  _u(0x08)
#define M33_SAU_TYPE_SREGION_BITS   _u(0x000000ff)
#define M33_SAU_TYPE_SREGION_MSB    _u(7)
#define M33_SAU_TYPE_SREGION_LSB    _u(0)
#define M33_SAU_TYPE_SREGION_ACCESS "RO"
// =============================================================================
// Register    : M33_SAU_RNR
// Description : Selects the region currently accessed by SAU_RBAR and SAU_RLAR
#define M33_SAU_RNR_OFFSET _u(0x0000edd8)
#define M33_SAU_RNR_BITS   _u(0x000000ff)
#define M33_SAU_RNR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_SAU_RNR_REGION
// Description : Indicates the SAU region accessed by SAU_RBAR and SAU_RLAR
#define M33_SAU_RNR_REGION_RESET  _u(0x00)
#define M33_SAU_RNR_REGION_BITS   _u(0x000000ff)
#define M33_SAU_RNR_REGION_MSB    _u(7)
#define M33_SAU_RNR_REGION_LSB    _u(0)
#define M33_SAU_RNR_REGION_ACCESS "RW"
// =============================================================================
// Register    : M33_SAU_RBAR
// Description : Provides indirect read and write access to the base address of
//               the currently selected SAU region
#define M33_SAU_RBAR_OFFSET _u(0x0000eddc)
#define M33_SAU_RBAR_BITS   _u(0xffffffe0)
#define M33_SAU_RBAR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_SAU_RBAR_BADDR
// Description : Holds bits [31:5] of the base address for the selected SAU
//               region
#define M33_SAU_RBAR_BADDR_RESET  _u(0x0000000)
#define M33_SAU_RBAR_BADDR_BITS   _u(0xffffffe0)
#define M33_SAU_RBAR_BADDR_MSB    _u(31)
#define M33_SAU_RBAR_BADDR_LSB    _u(5)
#define M33_SAU_RBAR_BADDR_ACCESS "RW"
// =============================================================================
// Register    : M33_SAU_RLAR
// Description : Provides indirect read and write access to the limit address of
//               the currently selected SAU region
#define M33_SAU_RLAR_OFFSET _u(0x0000ede0)
#define M33_SAU_RLAR_BITS   _u(0xffffffe3)
#define M33_SAU_RLAR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_SAU_RLAR_LADDR
// Description : Holds bits [31:5] of the limit address for the selected SAU
//               region
#define M33_SAU_RLAR_LADDR_RESET  _u(0x0000000)
#define M33_SAU_RLAR_LADDR_BITS   _u(0xffffffe0)
#define M33_SAU_RLAR_LADDR_MSB    _u(31)
#define M33_SAU_RLAR_LADDR_LSB    _u(5)
#define M33_SAU_RLAR_LADDR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SAU_RLAR_NSC
// Description : Controls whether Non-secure state is permitted to execute an SG
//               instruction from this region
#define M33_SAU_RLAR_NSC_RESET  _u(0x0)
#define M33_SAU_RLAR_NSC_BITS   _u(0x00000002)
#define M33_SAU_RLAR_NSC_MSB    _u(1)
#define M33_SAU_RLAR_NSC_LSB    _u(1)
#define M33_SAU_RLAR_NSC_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SAU_RLAR_ENABLE
// Description : SAU region enable
#define M33_SAU_RLAR_ENABLE_RESET  _u(0x0)
#define M33_SAU_RLAR_ENABLE_BITS   _u(0x00000001)
#define M33_SAU_RLAR_ENABLE_MSB    _u(0)
#define M33_SAU_RLAR_ENABLE_LSB    _u(0)
#define M33_SAU_RLAR_ENABLE_ACCESS "RW"
// =============================================================================
// Register    : M33_SFSR
// Description : Provides information about any security related faults
#define M33_SFSR_OFFSET _u(0x0000ede4)
#define M33_SFSR_BITS   _u(0x000000ff)
#define M33_SFSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
