Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/m33.h
// Field       : M33_SFSR_LSERR
// Description : Sticky flag indicating that an error occurred during lazy state
//               activation or deactivation
#define M33_SFSR_LSERR_RESET  _u(0x0)
#define M33_SFSR_LSERR_BITS   _u(0x00000080)
#define M33_SFSR_LSERR_MSB    _u(7)
#define M33_SFSR_LSERR_LSB    _u(7)
#define M33_SFSR_LSERR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SFSR_SFARVALID
// Description : This bit is set when the SFAR register contains a valid value.
//               As with similar fields, such as BFSR.BFARVALID and
//               MMFSR.MMARVALID, this bit can be cleared by other exceptions,
//               such as BusFault
#define M33_SFSR_SFARVALID_RESET  _u(0x0)
#define M33_SFSR_SFARVALID_BITS   _u(0x00000040)
#define M33_SFSR_SFARVALID_MSB    _u(6)
#define M33_SFSR_SFARVALID_LSB    _u(6)
#define M33_SFSR_SFARVALID_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SFSR_LSPERR
// Description : Stick flag indicating that an SAU or IDAU violation occurred
//               during the lazy preservation of floating-point state
#define M33_SFSR_LSPERR_RESET  _u(0x0)
#define M33_SFSR_LSPERR_BITS   _u(0x00000020)
#define M33_SFSR_LSPERR_MSB    _u(5)
#define M33_SFSR_LSPERR_LSB    _u(5)
#define M33_SFSR_LSPERR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SFSR_INVTRAN
// Description : Sticky flag indicating that an exception was raised due to a
//               branch that was not flagged as being domain crossing causing a
//               transition from Secure to Non-secure memory
#define M33_SFSR_INVTRAN_RESET  _u(0x0)
#define M33_SFSR_INVTRAN_BITS   _u(0x00000010)
#define M33_SFSR_INVTRAN_MSB    _u(4)
#define M33_SFSR_INVTRAN_LSB    _u(4)
#define M33_SFSR_INVTRAN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SFSR_AUVIOL
// Description : Sticky flag indicating that an attempt was made to access parts
//               of the address space that are marked as Secure with NS-Req for
//               the transaction set to Non-secure. This bit is not set if the
//               violation occurred during lazy state preservation. See LSPERR
#define M33_SFSR_AUVIOL_RESET  _u(0x0)
#define M33_SFSR_AUVIOL_BITS   _u(0x00000008)
#define M33_SFSR_AUVIOL_MSB    _u(3)
#define M33_SFSR_AUVIOL_LSB    _u(3)
#define M33_SFSR_AUVIOL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SFSR_INVER
// Description : This can be caused by EXC_RETURN.DCRS being set to 0 when
//               returning from an exception in the Non-secure state, or by
//               EXC_RETURN.ES being set to 1 when returning from an exception
//               in the Non-secure state
#define M33_SFSR_INVER_RESET  _u(0x0)
#define M33_SFSR_INVER_BITS   _u(0x00000004)
#define M33_SFSR_INVER_MSB    _u(2)
#define M33_SFSR_INVER_LSB    _u(2)
#define M33_SFSR_INVER_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SFSR_INVIS
// Description : This bit is set if the integrity signature in an exception
//               stack frame is found to be invalid during the unstacking
//               operation
#define M33_SFSR_INVIS_RESET  _u(0x0)
#define M33_SFSR_INVIS_BITS   _u(0x00000002)
#define M33_SFSR_INVIS_MSB    _u(1)
#define M33_SFSR_INVIS_LSB    _u(1)
#define M33_SFSR_INVIS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_SFSR_INVEP
// Description : This bit is set if a function call from the Non-secure state or
//               exception targets a non-SG instruction in the Secure state.
//               This bit is also set if the target address is a SG instruction,
//               but there is no matching SAU/IDAU region with the NSC flag set
#define M33_SFSR_INVEP_RESET  _u(0x0)
#define M33_SFSR_INVEP_BITS   _u(0x00000001)
#define M33_SFSR_INVEP_MSB    _u(0)
#define M33_SFSR_INVEP_LSB    _u(0)
#define M33_SFSR_INVEP_ACCESS "RW"
// =============================================================================
// Register    : M33_SFAR
// Description : Shows the address of the memory location that caused a Security
//               violation
#define M33_SFAR_OFFSET _u(0x0000ede8)
#define M33_SFAR_BITS   _u(0xffffffff)
#define M33_SFAR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_SFAR_ADDRESS
// Description : The address of an access that caused a attribution unit
//               violation. This field is only valid when SFSR.SFARVALID is set.
//               This allows the actual flip flops associated with this register
//               to be shared with other fault address registers. If an
//               implementation chooses to share the storage in this way, care
//               must be taken to not leak Secure address information to the
//               Non-secure state. One way of achieving this is to share the
//               SFAR register with the MMFAR_S register, which is not
//               accessible to the Non-secure state
#define M33_SFAR_ADDRESS_RESET  _u(0x00000000)
#define M33_SFAR_ADDRESS_BITS   _u(0xffffffff)
#define M33_SFAR_ADDRESS_MSB    _u(31)
#define M33_SFAR_ADDRESS_LSB    _u(0)
#define M33_SFAR_ADDRESS_ACCESS "RW"
// =============================================================================
// Register    : M33_DHCSR
// Description : Controls halting debug
#define M33_DHCSR_OFFSET _u(0x0000edf0)
#define M33_DHCSR_BITS   _u(0x071f002f)
#define M33_DHCSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_DHCSR_S_RESTART_ST
// Description : Indicates the PE has processed a request to clear DHCSR.C_HALT
//               to 0. That is, either a write to DHCSR that clears DHCSR.C_HALT
//               from 1 to 0, or an External Restart Request
#define M33_DHCSR_S_RESTART_ST_RESET  _u(0x0)
#define M33_DHCSR_S_RESTART_ST_BITS   _u(0x04000000)
#define M33_DHCSR_S_RESTART_ST_MSB    _u(26)
#define M33_DHCSR_S_RESTART_ST_LSB    _u(26)
#define M33_DHCSR_S_RESTART_ST_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DHCSR_S_RESET_ST
// Description : Indicates whether the PE has been reset since the last read of
//               the DHCSR
#define M33_DHCSR_S_RESET_ST_RESET  _u(0x0)
#define M33_DHCSR_S_RESET_ST_BITS   _u(0x02000000)
#define M33_DHCSR_S_RESET_ST_MSB    _u(25)
#define M33_DHCSR_S_RESET_ST_LSB    _u(25)
#define M33_DHCSR_S_RESET_ST_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DHCSR_S_RETIRE_ST
// Description : Set to 1 every time the PE retires one of more instructions
#define M33_DHCSR_S_RETIRE_ST_RESET  _u(0x0)
#define M33_DHCSR_S_RETIRE_ST_BITS   _u(0x01000000)
#define M33_DHCSR_S_RETIRE_ST_MSB    _u(24)
#define M33_DHCSR_S_RETIRE_ST_LSB    _u(24)
#define M33_DHCSR_S_RETIRE_ST_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DHCSR_S_SDE
// Description : Indicates whether Secure invasive debug is allowed
#define M33_DHCSR_S_SDE_RESET  _u(0x0)
#define M33_DHCSR_S_SDE_BITS   _u(0x00100000)
#define M33_DHCSR_S_SDE_MSB    _u(20)
#define M33_DHCSR_S_SDE_LSB    _u(20)
#define M33_DHCSR_S_SDE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DHCSR_S_LOCKUP
// Description : Indicates whether the PE is in Lockup state
#define M33_DHCSR_S_LOCKUP_RESET  _u(0x0)
#define M33_DHCSR_S_LOCKUP_BITS   _u(0x00080000)
#define M33_DHCSR_S_LOCKUP_MSB    _u(19)
#define M33_DHCSR_S_LOCKUP_LSB    _u(19)
#define M33_DHCSR_S_LOCKUP_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DHCSR_S_SLEEP
// Description : Indicates whether the PE is sleeping
#define M33_DHCSR_S_SLEEP_RESET  _u(0x0)
#define M33_DHCSR_S_SLEEP_BITS   _u(0x00040000)
#define M33_DHCSR_S_SLEEP_MSB    _u(18)
#define M33_DHCSR_S_SLEEP_LSB    _u(18)
#define M33_DHCSR_S_SLEEP_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DHCSR_S_HALT
// Description : Indicates whether the PE is in Debug state
#define M33_DHCSR_S_HALT_RESET  _u(0x0)
#define M33_DHCSR_S_HALT_BITS   _u(0x00020000)
#define M33_DHCSR_S_HALT_MSB    _u(17)
#define M33_DHCSR_S_HALT_LSB    _u(17)
#define M33_DHCSR_S_HALT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DHCSR_S_REGRDY
// Description : Handshake flag to transfers through the DCRDR
#define M33_DHCSR_S_REGRDY_RESET  _u(0x0)
#define M33_DHCSR_S_REGRDY_BITS   _u(0x00010000)
#define M33_DHCSR_S_REGRDY_MSB    _u(16)
#define M33_DHCSR_S_REGRDY_LSB    _u(16)
#define M33_DHCSR_S_REGRDY_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DHCSR_C_SNAPSTALL
// Description : Allow imprecise entry to Debug state
#define M33_DHCSR_C_SNAPSTALL_RESET  _u(0x0)
#define M33_DHCSR_C_SNAPSTALL_BITS   _u(0x00000020)
#define M33_DHCSR_C_SNAPSTALL_MSB    _u(5)
#define M33_DHCSR_C_SNAPSTALL_LSB    _u(5)
#define M33_DHCSR_C_SNAPSTALL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DHCSR_C_MASKINTS
// Description : When debug is enabled, the debugger can write to this bit to
//               mask PendSV, SysTick and external configurable interrupts
#define M33_DHCSR_C_MASKINTS_RESET  _u(0x0)
#define M33_DHCSR_C_MASKINTS_BITS   _u(0x00000008)
#define M33_DHCSR_C_MASKINTS_MSB    _u(3)
#define M33_DHCSR_C_MASKINTS_LSB    _u(3)
#define M33_DHCSR_C_MASKINTS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DHCSR_C_STEP
// Description : Enable single instruction step
#define M33_DHCSR_C_STEP_RESET  _u(0x0)
#define M33_DHCSR_C_STEP_BITS   _u(0x00000004)
#define M33_DHCSR_C_STEP_MSB    _u(2)
#define M33_DHCSR_C_STEP_LSB    _u(2)
#define M33_DHCSR_C_STEP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DHCSR_C_HALT
// Description : PE enter Debug state halt request
#define M33_DHCSR_C_HALT_RESET  _u(0x0)
#define M33_DHCSR_C_HALT_BITS   _u(0x00000002)
#define M33_DHCSR_C_HALT_MSB    _u(1)
#define M33_DHCSR_C_HALT_LSB    _u(1)
#define M33_DHCSR_C_HALT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DHCSR_C_DEBUGEN
// Description : Enable Halting debug
#define M33_DHCSR_C_DEBUGEN_RESET  _u(0x0)
#define M33_DHCSR_C_DEBUGEN_BITS   _u(0x00000001)
#define M33_DHCSR_C_DEBUGEN_MSB    _u(0)
#define M33_DHCSR_C_DEBUGEN_LSB    _u(0)
#define M33_DHCSR_C_DEBUGEN_ACCESS "RW"
// =============================================================================
// Register    : M33_DCRSR
// Description : With the DCRDR, provides debug access to the general-purpose
//               registers, special-purpose registers, and the FP extension
//               registers. A write to the DCRSR specifies the register to
//               transfer, whether the transfer is a read or write, and starts
//               the transfer
#define M33_DCRSR_OFFSET _u(0x0000edf4)
#define M33_DCRSR_BITS   _u(0x0001007f)
#define M33_DCRSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_DCRSR_REGWNR
// Description : Specifies the access type for the transfer
#define M33_DCRSR_REGWNR_RESET  _u(0x0)
#define M33_DCRSR_REGWNR_BITS   _u(0x00010000)
#define M33_DCRSR_REGWNR_MSB    _u(16)
#define M33_DCRSR_REGWNR_LSB    _u(16)
#define M33_DCRSR_REGWNR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DCRSR_REGSEL
// Description : Specifies the general-purpose register, special-purpose
//               register, or FP register to transfer
#define M33_DCRSR_REGSEL_RESET  _u(0x00)
#define M33_DCRSR_REGSEL_BITS   _u(0x0000007f)
#define M33_DCRSR_REGSEL_MSB    _u(6)
#define M33_DCRSR_REGSEL_LSB    _u(0)
#define M33_DCRSR_REGSEL_ACCESS "RW"
// =============================================================================
// Register    : M33_DCRDR
// Description : With the DCRSR, provides debug access to the general-purpose
//               registers, special-purpose registers, and the FP Extension
//               registers. If the Main Extension is implemented, it can also be
//               used for message passing between an external debugger and a
//               debug agent running on the PE
#define M33_DCRDR_OFFSET _u(0x0000edf8)
#define M33_DCRDR_BITS   _u(0xffffffff)
#define M33_DCRDR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_DCRDR_DBGTMP
// Description : Provides debug access for reading and writing the general-
//               purpose registers, special-purpose registers, and Floating-
//               point Extension registers
#define M33_DCRDR_DBGTMP_RESET  _u(0x00000000)
#define M33_DCRDR_DBGTMP_BITS   _u(0xffffffff)
#define M33_DCRDR_DBGTMP_MSB    _u(31)
#define M33_DCRDR_DBGTMP_LSB    _u(0)
#define M33_DCRDR_DBGTMP_ACCESS "RW"
// =============================================================================
// Register    : M33_DEMCR
// Description : Manages vector catch behavior and DebugMonitor handling when
//               debugging
#define M33_DEMCR_OFFSET _u(0x0000edfc)
#define M33_DEMCR_BITS   _u(0x011f0ff1)
#define M33_DEMCR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_DEMCR_TRCENA
// Description : Global enable for all DWT and ITM features
#define M33_DEMCR_TRCENA_RESET  _u(0x0)
#define M33_DEMCR_TRCENA_BITS   _u(0x01000000)
#define M33_DEMCR_TRCENA_MSB    _u(24)
#define M33_DEMCR_TRCENA_LSB    _u(24)
#define M33_DEMCR_TRCENA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DEMCR_SDME
// Description : Indicates whether the DebugMonitor targets the Secure or the
//               Non-secure state and whether debug events are allowed in Secure
//               state
#define M33_DEMCR_SDME_RESET  _u(0x0)
#define M33_DEMCR_SDME_BITS   _u(0x00100000)
#define M33_DEMCR_SDME_MSB    _u(20)
#define M33_DEMCR_SDME_LSB    _u(20)
#define M33_DEMCR_SDME_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DEMCR_MON_REQ
// Description : DebugMonitor semaphore bit
#define M33_DEMCR_MON_REQ_RESET  _u(0x0)
#define M33_DEMCR_MON_REQ_BITS   _u(0x00080000)
#define M33_DEMCR_MON_REQ_MSB    _u(19)
#define M33_DEMCR_MON_REQ_LSB    _u(19)
#define M33_DEMCR_MON_REQ_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DEMCR_MON_STEP
// Description : Enable DebugMonitor stepping
#define M33_DEMCR_MON_STEP_RESET  _u(0x0)
#define M33_DEMCR_MON_STEP_BITS   _u(0x00040000)
#define M33_DEMCR_MON_STEP_MSB    _u(18)
#define M33_DEMCR_MON_STEP_LSB    _u(18)
#define M33_DEMCR_MON_STEP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DEMCR_MON_PEND
// Description : Sets or clears the pending state of the DebugMonitor exception
#define M33_DEMCR_MON_PEND_RESET  _u(0x0)
#define M33_DEMCR_MON_PEND_BITS   _u(0x00020000)
#define M33_DEMCR_MON_PEND_MSB    _u(17)
#define M33_DEMCR_MON_PEND_LSB    _u(17)
#define M33_DEMCR_MON_PEND_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DEMCR_MON_EN
// Description : Enable the DebugMonitor exception
#define M33_DEMCR_MON_EN_RESET  _u(0x0)
#define M33_DEMCR_MON_EN_BITS   _u(0x00010000)
#define M33_DEMCR_MON_EN_MSB    _u(16)
#define M33_DEMCR_MON_EN_LSB    _u(16)
#define M33_DEMCR_MON_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DEMCR_VC_SFERR
// Description : SecureFault exception halting debug vector catch enable
#define M33_DEMCR_VC_SFERR_RESET  _u(0x0)
#define M33_DEMCR_VC_SFERR_BITS   _u(0x00000800)
#define M33_DEMCR_VC_SFERR_MSB    _u(11)
#define M33_DEMCR_VC_SFERR_LSB    _u(11)
#define M33_DEMCR_VC_SFERR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DEMCR_VC_HARDERR
// Description : HardFault exception halting debug vector catch enable
#define M33_DEMCR_VC_HARDERR_RESET  _u(0x0)
#define M33_DEMCR_VC_HARDERR_BITS   _u(0x00000400)
#define M33_DEMCR_VC_HARDERR_MSB    _u(10)
#define M33_DEMCR_VC_HARDERR_LSB    _u(10)
#define M33_DEMCR_VC_HARDERR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DEMCR_VC_INTERR
// Description : Enable halting debug vector catch for faults during exception
//               entry and return
#define M33_DEMCR_VC_INTERR_RESET  _u(0x0)
#define M33_DEMCR_VC_INTERR_BITS   _u(0x00000200)
#define M33_DEMCR_VC_INTERR_MSB    _u(9)
#define M33_DEMCR_VC_INTERR_LSB    _u(9)
#define M33_DEMCR_VC_INTERR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DEMCR_VC_BUSERR
// Description : BusFault exception halting debug vector catch enable
#define M33_DEMCR_VC_BUSERR_RESET  _u(0x0)
#define M33_DEMCR_VC_BUSERR_BITS   _u(0x00000100)
#define M33_DEMCR_VC_BUSERR_MSB    _u(8)
#define M33_DEMCR_VC_BUSERR_LSB    _u(8)
#define M33_DEMCR_VC_BUSERR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DEMCR_VC_STATERR
// Description : Enable halting debug trap on a UsageFault exception caused by a
//               state information error, for example an Undefined Instruction
//               exception
#define M33_DEMCR_VC_STATERR_RESET  _u(0x0)
#define M33_DEMCR_VC_STATERR_BITS   _u(0x00000080)
#define M33_DEMCR_VC_STATERR_MSB    _u(7)
#define M33_DEMCR_VC_STATERR_LSB    _u(7)
#define M33_DEMCR_VC_STATERR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DEMCR_VC_CHKERR
// Description : Enable halting debug trap on a UsageFault exception caused by a
//               checking error, for example an alignment check error
#define M33_DEMCR_VC_CHKERR_RESET  _u(0x0)
#define M33_DEMCR_VC_CHKERR_BITS   _u(0x00000040)
#define M33_DEMCR_VC_CHKERR_MSB    _u(6)
#define M33_DEMCR_VC_CHKERR_LSB    _u(6)
#define M33_DEMCR_VC_CHKERR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DEMCR_VC_NOCPERR
// Description : Enable halting debug trap on a UsageFault caused by an access
//               to a coprocessor
#define M33_DEMCR_VC_NOCPERR_RESET  _u(0x0)
#define M33_DEMCR_VC_NOCPERR_BITS   _u(0x00000020)
#define M33_DEMCR_VC_NOCPERR_MSB    _u(5)
#define M33_DEMCR_VC_NOCPERR_LSB    _u(5)
#define M33_DEMCR_VC_NOCPERR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DEMCR_VC_MMERR
// Description : Enable halting debug trap on a MemManage exception
#define M33_DEMCR_VC_MMERR_RESET  _u(0x0)
#define M33_DEMCR_VC_MMERR_BITS   _u(0x00000010)
#define M33_DEMCR_VC_MMERR_MSB    _u(4)
#define M33_DEMCR_VC_MMERR_LSB    _u(4)
#define M33_DEMCR_VC_MMERR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DEMCR_VC_CORERESET
// Description : Enable Reset Vector Catch. This causes a warm reset to halt a
//               running system
#define M33_DEMCR_VC_CORERESET_RESET  _u(0x0)
#define M33_DEMCR_VC_CORERESET_BITS   _u(0x00000001)
#define M33_DEMCR_VC_CORERESET_MSB    _u(0)
#define M33_DEMCR_VC_CORERESET_LSB    _u(0)
#define M33_DEMCR_VC_CORERESET_ACCESS "RW"
// =============================================================================
// Register    : M33_DSCSR
// Description : Provides control and status information for Secure debug
#define M33_DSCSR_OFFSET _u(0x0000ee08)
#define M33_DSCSR_BITS   _u(0x00030003)
#define M33_DSCSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_DSCSR_CDSKEY
// Description : Writes to the CDS bit are ignored unless CDSKEY is concurrently
//               written to zero
#define M33_DSCSR_CDSKEY_RESET  _u(0x0)
#define M33_DSCSR_CDSKEY_BITS   _u(0x00020000)
#define M33_DSCSR_CDSKEY_MSB    _u(17)
#define M33_DSCSR_CDSKEY_LSB    _u(17)
#define M33_DSCSR_CDSKEY_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DSCSR_CDS
// Description : This field indicates the current Security state of the
//               processor
#define M33_DSCSR_CDS_RESET  _u(0x0)
#define M33_DSCSR_CDS_BITS   _u(0x00010000)
#define M33_DSCSR_CDS_MSB    _u(16)
#define M33_DSCSR_CDS_LSB    _u(16)
#define M33_DSCSR_CDS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DSCSR_SBRSEL
// Description : If SBRSELEN is 1 this bit selects whether the Non-secure or the
//               Secure version of the memory-mapped Banked registers are
//               accessible to the debugger
#define M33_DSCSR_SBRSEL_RESET  _u(0x0)
#define M33_DSCSR_SBRSEL_BITS   _u(0x00000002)
#define M33_DSCSR_SBRSEL_MSB    _u(1)
#define M33_DSCSR_SBRSEL_LSB    _u(1)
#define M33_DSCSR_SBRSEL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_DSCSR_SBRSELEN
// Description : Controls whether the SBRSEL field or the current Security state
//               of the processor selects which version of the memory-mapped
//               Banked registers are accessed to the debugger
#define M33_DSCSR_SBRSELEN_RESET  _u(0x0)
#define M33_DSCSR_SBRSELEN_BITS   _u(0x00000001)
#define M33_DSCSR_SBRSELEN_MSB    _u(0)
#define M33_DSCSR_SBRSELEN_LSB    _u(0)
#define M33_DSCSR_SBRSELEN_ACCESS "RW"
// =============================================================================
// Register    : M33_STIR
// Description : Provides a mechanism for software to generate an interrupt
#define M33_STIR_OFFSET _u(0x0000ef00)
#define M33_STIR_BITS   _u(0x000001ff)
#define M33_STIR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_STIR_INTID
// Description : Indicates the interrupt to be pended. The value written is
//               (ExceptionNumber - 16)
#define M33_STIR_INTID_RESET  _u(0x000)
#define M33_STIR_INTID_BITS   _u(0x000001ff)
#define M33_STIR_INTID_MSB    _u(8)
#define M33_STIR_INTID_LSB    _u(0)
#define M33_STIR_INTID_ACCESS "RW"
// =============================================================================
// Register    : M33_FPCCR
// Description : Holds control data for the Floating-point extension
#define M33_FPCCR_OFFSET _u(0x0000ef34)
#define M33_FPCCR_BITS   _u(0xfc0007ff)
#define M33_FPCCR_RESET  _u(0x20000472)
// -----------------------------------------------------------------------------
// Field       : M33_FPCCR_ASPEN
// Description : When this bit is set to 1, execution of a floating-point
//               instruction sets the CONTROL.FPCA bit to 1
#define M33_FPCCR_ASPEN_RESET  _u(0x0)
#define M33_FPCCR_ASPEN_BITS   _u(0x80000000)
#define M33_FPCCR_ASPEN_MSB    _u(31)
#define M33_FPCCR_ASPEN_LSB    _u(31)
