Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/m33.h
#define M33_FPCCR_ASPEN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_FPCCR_LSPEN
// Description : Enables lazy context save of floating-point state
#define M33_FPCCR_LSPEN_RESET  _u(0x0)
#define M33_FPCCR_LSPEN_BITS   _u(0x40000000)
#define M33_FPCCR_LSPEN_MSB    _u(30)
#define M33_FPCCR_LSPEN_LSB    _u(30)
#define M33_FPCCR_LSPEN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_FPCCR_LSPENS
// Description : This bit controls whether the LSPEN bit is writeable from the
//               Non-secure state
#define M33_FPCCR_LSPENS_RESET  _u(0x1)
#define M33_FPCCR_LSPENS_BITS   _u(0x20000000)
#define M33_FPCCR_LSPENS_MSB    _u(29)
#define M33_FPCCR_LSPENS_LSB    _u(29)
#define M33_FPCCR_LSPENS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_FPCCR_CLRONRET
// Description : Clear floating-point caller saved registers on exception return
#define M33_FPCCR_CLRONRET_RESET  _u(0x0)
#define M33_FPCCR_CLRONRET_BITS   _u(0x10000000)
#define M33_FPCCR_CLRONRET_MSB    _u(28)
#define M33_FPCCR_CLRONRET_LSB    _u(28)
#define M33_FPCCR_CLRONRET_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_FPCCR_CLRONRETS
// Description : This bit controls whether the CLRONRET bit is writeable from
//               the Non-secure state
#define M33_FPCCR_CLRONRETS_RESET  _u(0x0)
#define M33_FPCCR_CLRONRETS_BITS   _u(0x08000000)
#define M33_FPCCR_CLRONRETS_MSB    _u(27)
#define M33_FPCCR_CLRONRETS_LSB    _u(27)
#define M33_FPCCR_CLRONRETS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_FPCCR_TS
// Description : Treat floating-point registers as Secure enable
#define M33_FPCCR_TS_RESET  _u(0x0)
#define M33_FPCCR_TS_BITS   _u(0x04000000)
#define M33_FPCCR_TS_MSB    _u(26)
#define M33_FPCCR_TS_LSB    _u(26)
#define M33_FPCCR_TS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_FPCCR_UFRDY
// Description : Indicates whether the software executing when the PE allocated
//               the floating-point stack frame was able to set the UsageFault
//               exception to pending
#define M33_FPCCR_UFRDY_RESET  _u(0x1)
#define M33_FPCCR_UFRDY_BITS   _u(0x00000400)
#define M33_FPCCR_UFRDY_MSB    _u(10)
#define M33_FPCCR_UFRDY_LSB    _u(10)
#define M33_FPCCR_UFRDY_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_FPCCR_SPLIMVIOL
// Description : This bit is banked between the Security states and indicates
//               whether the floating-point context violates the stack pointer
//               limit that was active when lazy state preservation was
//               activated. SPLIMVIOL modifies the lazy floating-point state
//               preservation behavior
#define M33_FPCCR_SPLIMVIOL_RESET  _u(0x0)
#define M33_FPCCR_SPLIMVIOL_BITS   _u(0x00000200)
#define M33_FPCCR_SPLIMVIOL_MSB    _u(9)
#define M33_FPCCR_SPLIMVIOL_LSB    _u(9)
#define M33_FPCCR_SPLIMVIOL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_FPCCR_MONRDY
// Description : Indicates whether the software executing when the PE allocated
//               the floating-point stack frame was able to set the DebugMonitor
//               exception to pending
#define M33_FPCCR_MONRDY_RESET  _u(0x0)
#define M33_FPCCR_MONRDY_BITS   _u(0x00000100)
#define M33_FPCCR_MONRDY_MSB    _u(8)
#define M33_FPCCR_MONRDY_LSB    _u(8)
#define M33_FPCCR_MONRDY_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_FPCCR_SFRDY
// Description : Indicates whether the software executing when the PE allocated
//               the floating-point stack frame was able to set the SecureFault
//               exception to pending. This bit is only present in the Secure
//               version of the register, and behaves as RAZ/WI when accessed
//               from the Non-secure state
#define M33_FPCCR_SFRDY_RESET  _u(0x0)
#define M33_FPCCR_SFRDY_BITS   _u(0x00000080)
#define M33_FPCCR_SFRDY_MSB    _u(7)
#define M33_FPCCR_SFRDY_LSB    _u(7)
#define M33_FPCCR_SFRDY_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_FPCCR_BFRDY
// Description : Indicates whether the software executing when the PE allocated
//               the floating-point stack frame was able to set the BusFault
//               exception to pending
#define M33_FPCCR_BFRDY_RESET  _u(0x1)
#define M33_FPCCR_BFRDY_BITS   _u(0x00000040)
#define M33_FPCCR_BFRDY_MSB    _u(6)
#define M33_FPCCR_BFRDY_LSB    _u(6)
#define M33_FPCCR_BFRDY_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_FPCCR_MMRDY
// Description : Indicates whether the software executing when the PE allocated
//               the floating-point stack frame was able to set the MemManage
//               exception to pending
#define M33_FPCCR_MMRDY_RESET  _u(0x1)
#define M33_FPCCR_MMRDY_BITS   _u(0x00000020)
#define M33_FPCCR_MMRDY_MSB    _u(5)
#define M33_FPCCR_MMRDY_LSB    _u(5)
#define M33_FPCCR_MMRDY_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_FPCCR_HFRDY
// Description : Indicates whether the software executing when the PE allocated
//               the floating-point stack frame was able to set the HardFault
//               exception to pending
#define M33_FPCCR_HFRDY_RESET  _u(0x1)
#define M33_FPCCR_HFRDY_BITS   _u(0x00000010)
#define M33_FPCCR_HFRDY_MSB    _u(4)
#define M33_FPCCR_HFRDY_LSB    _u(4)
#define M33_FPCCR_HFRDY_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_FPCCR_THREAD
// Description : Indicates the PE mode when it allocated the floating-point
//               stack frame
#define M33_FPCCR_THREAD_RESET  _u(0x0)
#define M33_FPCCR_THREAD_BITS   _u(0x00000008)
#define M33_FPCCR_THREAD_MSB    _u(3)
#define M33_FPCCR_THREAD_LSB    _u(3)
#define M33_FPCCR_THREAD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_FPCCR_S
// Description : Security status of the floating-point context. This bit is only
//               present in the Secure version of the register, and behaves as
//               RAZ/WI when accessed from the Non-secure state. This bit is
//               updated whenever lazy state preservation is activated, or when
//               a floating-point instruction is executed
#define M33_FPCCR_S_RESET  _u(0x0)
#define M33_FPCCR_S_BITS   _u(0x00000004)
#define M33_FPCCR_S_MSB    _u(2)
#define M33_FPCCR_S_LSB    _u(2)
#define M33_FPCCR_S_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_FPCCR_USER
// Description : Indicates the privilege level of the software executing when
//               the PE allocated the floating-point stack frame
#define M33_FPCCR_USER_RESET  _u(0x1)
#define M33_FPCCR_USER_BITS   _u(0x00000002)
#define M33_FPCCR_USER_MSB    _u(1)
#define M33_FPCCR_USER_LSB    _u(1)
#define M33_FPCCR_USER_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_FPCCR_LSPACT
// Description : Indicates whether lazy preservation of the floating-point state
//               is active
#define M33_FPCCR_LSPACT_RESET  _u(0x0)
#define M33_FPCCR_LSPACT_BITS   _u(0x00000001)
#define M33_FPCCR_LSPACT_MSB    _u(0)
#define M33_FPCCR_LSPACT_LSB    _u(0)
#define M33_FPCCR_LSPACT_ACCESS "RW"
// =============================================================================
// Register    : M33_FPCAR
// Description : Holds the location of the unpopulated floating-point register
//               space allocated on an exception stack frame
#define M33_FPCAR_OFFSET _u(0x0000ef38)
#define M33_FPCAR_BITS   _u(0xfffffff8)
#define M33_FPCAR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_FPCAR_ADDRESS
// Description : The location of the unpopulated floating-point register space
//               allocated on an exception stack frame
#define M33_FPCAR_ADDRESS_RESET  _u(0x00000000)
#define M33_FPCAR_ADDRESS_BITS   _u(0xfffffff8)
#define M33_FPCAR_ADDRESS_MSB    _u(31)
#define M33_FPCAR_ADDRESS_LSB    _u(3)
#define M33_FPCAR_ADDRESS_ACCESS "RW"
// =============================================================================
// Register    : M33_FPDSCR
// Description : Holds the default values for the floating-point status control
//               data that the PE assigns to the FPSCR when it creates a new
//               floating-point context
#define M33_FPDSCR_OFFSET _u(0x0000ef3c)
#define M33_FPDSCR_BITS   _u(0x07c00000)
#define M33_FPDSCR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_FPDSCR_AHP
// Description : Default value for FPSCR.AHP
#define M33_FPDSCR_AHP_RESET  _u(0x0)
#define M33_FPDSCR_AHP_BITS   _u(0x04000000)
#define M33_FPDSCR_AHP_MSB    _u(26)
#define M33_FPDSCR_AHP_LSB    _u(26)
#define M33_FPDSCR_AHP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_FPDSCR_DN
// Description : Default value for FPSCR.DN
#define M33_FPDSCR_DN_RESET  _u(0x0)
#define M33_FPDSCR_DN_BITS   _u(0x02000000)
#define M33_FPDSCR_DN_MSB    _u(25)
#define M33_FPDSCR_DN_LSB    _u(25)
#define M33_FPDSCR_DN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_FPDSCR_FZ
// Description : Default value for FPSCR.FZ
#define M33_FPDSCR_FZ_RESET  _u(0x0)
#define M33_FPDSCR_FZ_BITS   _u(0x01000000)
#define M33_FPDSCR_FZ_MSB    _u(24)
#define M33_FPDSCR_FZ_LSB    _u(24)
#define M33_FPDSCR_FZ_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_FPDSCR_RMODE
// Description : Default value for FPSCR.RMode
#define M33_FPDSCR_RMODE_RESET  _u(0x0)
#define M33_FPDSCR_RMODE_BITS   _u(0x00c00000)
#define M33_FPDSCR_RMODE_MSB    _u(23)
#define M33_FPDSCR_RMODE_LSB    _u(22)
#define M33_FPDSCR_RMODE_ACCESS "RW"
// =============================================================================
// Register    : M33_MVFR0
// Description : Describes the features provided by the Floating-point Extension
#define M33_MVFR0_OFFSET _u(0x0000ef40)
#define M33_MVFR0_BITS   _u(0xf0ff0fff)
#define M33_MVFR0_RESET  _u(0x60540601)
// -----------------------------------------------------------------------------
// Field       : M33_MVFR0_FPROUND
// Description : Indicates the rounding modes supported by the FP Extension
#define M33_MVFR0_FPROUND_RESET  _u(0x6)
#define M33_MVFR0_FPROUND_BITS   _u(0xf0000000)
#define M33_MVFR0_FPROUND_MSB    _u(31)
#define M33_MVFR0_FPROUND_LSB    _u(28)
#define M33_MVFR0_FPROUND_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_MVFR0_FPSQRT
// Description : Indicates the support for FP square root operations
#define M33_MVFR0_FPSQRT_RESET  _u(0x5)
#define M33_MVFR0_FPSQRT_BITS   _u(0x00f00000)
#define M33_MVFR0_FPSQRT_MSB    _u(23)
#define M33_MVFR0_FPSQRT_LSB    _u(20)
#define M33_MVFR0_FPSQRT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_MVFR0_FPDIVIDE
// Description : Indicates the support for FP divide operations
#define M33_MVFR0_FPDIVIDE_RESET  _u(0x4)
#define M33_MVFR0_FPDIVIDE_BITS   _u(0x000f0000)
#define M33_MVFR0_FPDIVIDE_MSB    _u(19)
#define M33_MVFR0_FPDIVIDE_LSB    _u(16)
#define M33_MVFR0_FPDIVIDE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_MVFR0_FPDP
// Description : Indicates support for FP double-precision operations
#define M33_MVFR0_FPDP_RESET  _u(0x6)
#define M33_MVFR0_FPDP_BITS   _u(0x00000f00)
#define M33_MVFR0_FPDP_MSB    _u(11)
#define M33_MVFR0_FPDP_LSB    _u(8)
#define M33_MVFR0_FPDP_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_MVFR0_FPSP
// Description : Indicates support for FP single-precision operations
#define M33_MVFR0_FPSP_RESET  _u(0x0)
#define M33_MVFR0_FPSP_BITS   _u(0x000000f0)
#define M33_MVFR0_FPSP_MSB    _u(7)
#define M33_MVFR0_FPSP_LSB    _u(4)
#define M33_MVFR0_FPSP_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_MVFR0_SIMDREG
// Description : Indicates size of FP register file
#define M33_MVFR0_SIMDREG_RESET  _u(0x1)
#define M33_MVFR0_SIMDREG_BITS   _u(0x0000000f)
#define M33_MVFR0_SIMDREG_MSB    _u(3)
#define M33_MVFR0_SIMDREG_LSB    _u(0)
#define M33_MVFR0_SIMDREG_ACCESS "RO"
// =============================================================================
// Register    : M33_MVFR1
// Description : Describes the features provided by the Floating-point Extension
#define M33_MVFR1_OFFSET _u(0x0000ef44)
#define M33_MVFR1_BITS   _u(0xff0000ff)
#define M33_MVFR1_RESET  _u(0x85000089)
// -----------------------------------------------------------------------------
// Field       : M33_MVFR1_FMAC
// Description : Indicates whether the FP Extension implements the fused
//               multiply accumulate instructions
#define M33_MVFR1_FMAC_RESET  _u(0x8)
#define M33_MVFR1_FMAC_BITS   _u(0xf0000000)
#define M33_MVFR1_FMAC_MSB    _u(31)
#define M33_MVFR1_FMAC_LSB    _u(28)
#define M33_MVFR1_FMAC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_MVFR1_FPHP
// Description : Indicates whether the FP Extension implements half-precision FP
//               conversion instructions
#define M33_MVFR1_FPHP_RESET  _u(0x5)
#define M33_MVFR1_FPHP_BITS   _u(0x0f000000)
#define M33_MVFR1_FPHP_MSB    _u(27)
#define M33_MVFR1_FPHP_LSB    _u(24)
#define M33_MVFR1_FPHP_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_MVFR1_FPDNAN
// Description : Indicates whether the FP hardware implementation supports NaN
//               propagation
#define M33_MVFR1_FPDNAN_RESET  _u(0x8)
#define M33_MVFR1_FPDNAN_BITS   _u(0x000000f0)
#define M33_MVFR1_FPDNAN_MSB    _u(7)
#define M33_MVFR1_FPDNAN_LSB    _u(4)
#define M33_MVFR1_FPDNAN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_MVFR1_FPFTZ
// Description : Indicates whether subnormals are always flushed-to-zero
#define M33_MVFR1_FPFTZ_RESET  _u(0x9)
#define M33_MVFR1_FPFTZ_BITS   _u(0x0000000f)
#define M33_MVFR1_FPFTZ_MSB    _u(3)
#define M33_MVFR1_FPFTZ_LSB    _u(0)
#define M33_MVFR1_FPFTZ_ACCESS "RO"
// =============================================================================
// Register    : M33_MVFR2
// Description : Describes the features provided by the Floating-point Extension
#define M33_MVFR2_OFFSET _u(0x0000ef48)
#define M33_MVFR2_BITS   _u(0x000000f0)
#define M33_MVFR2_RESET  _u(0x00000060)
// -----------------------------------------------------------------------------
// Field       : M33_MVFR2_FPMISC
// Description : Indicates support for miscellaneous FP features
#define M33_MVFR2_FPMISC_RESET  _u(0x6)
#define M33_MVFR2_FPMISC_BITS   _u(0x000000f0)
#define M33_MVFR2_FPMISC_MSB    _u(7)
#define M33_MVFR2_FPMISC_LSB    _u(4)
#define M33_MVFR2_FPMISC_ACCESS "RO"
// =============================================================================
// Register    : M33_DDEVARCH
// Description : Provides CoreSight discovery information for the SCS
#define M33_DDEVARCH_OFFSET _u(0x0000efbc)
#define M33_DDEVARCH_BITS   _u(0xffffffff)
#define M33_DDEVARCH_RESET  _u(0x47702a04)
// -----------------------------------------------------------------------------
// Field       : M33_DDEVARCH_ARCHITECT
// Description : Defines the architect of the component. Bits [31:28] are the
//               JEP106 continuation code (JEP106 bank ID, minus 1) and bits
//               [27:21] are the JEP106 ID code.
#define M33_DDEVARCH_ARCHITECT_RESET  _u(0x23b)
#define M33_DDEVARCH_ARCHITECT_BITS   _u(0xffe00000)
#define M33_DDEVARCH_ARCHITECT_MSB    _u(31)
#define M33_DDEVARCH_ARCHITECT_LSB    _u(21)
#define M33_DDEVARCH_ARCHITECT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DDEVARCH_PRESENT
// Description : Defines that the DEVARCH register is present
#define M33_DDEVARCH_PRESENT_RESET  _u(0x1)
#define M33_DDEVARCH_PRESENT_BITS   _u(0x00100000)
#define M33_DDEVARCH_PRESENT_MSB    _u(20)
#define M33_DDEVARCH_PRESENT_LSB    _u(20)
#define M33_DDEVARCH_PRESENT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DDEVARCH_REVISION
// Description : Defines the architecture revision of the component
#define M33_DDEVARCH_REVISION_RESET  _u(0x0)
#define M33_DDEVARCH_REVISION_BITS   _u(0x000f0000)
#define M33_DDEVARCH_REVISION_MSB    _u(19)
#define M33_DDEVARCH_REVISION_LSB    _u(16)
#define M33_DDEVARCH_REVISION_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DDEVARCH_ARCHVER
// Description : Defines the architecture version of the component
#define M33_DDEVARCH_ARCHVER_RESET  _u(0x2)
#define M33_DDEVARCH_ARCHVER_BITS   _u(0x0000f000)
#define M33_DDEVARCH_ARCHVER_MSB    _u(15)
#define M33_DDEVARCH_ARCHVER_LSB    _u(12)
#define M33_DDEVARCH_ARCHVER_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DDEVARCH_ARCHPART
// Description : Defines the architecture of the component
#define M33_DDEVARCH_ARCHPART_RESET  _u(0xa04)
#define M33_DDEVARCH_ARCHPART_BITS   _u(0x00000fff)
#define M33_DDEVARCH_ARCHPART_MSB    _u(11)
#define M33_DDEVARCH_ARCHPART_LSB    _u(0)
#define M33_DDEVARCH_ARCHPART_ACCESS "RO"
// =============================================================================
// Register    : M33_DDEVTYPE
// Description : Provides CoreSight discovery information for the SCS
#define M33_DDEVTYPE_OFFSET _u(0x0000efcc)
#define M33_DDEVTYPE_BITS   _u(0x000000ff)
#define M33_DDEVTYPE_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_DDEVTYPE_SUB
// Description : Component sub-type
#define M33_DDEVTYPE_SUB_RESET  _u(0x0)
#define M33_DDEVTYPE_SUB_BITS   _u(0x000000f0)
#define M33_DDEVTYPE_SUB_MSB    _u(7)
#define M33_DDEVTYPE_SUB_LSB    _u(4)
#define M33_DDEVTYPE_SUB_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DDEVTYPE_MAJOR
// Description : CoreSight major type
#define M33_DDEVTYPE_MAJOR_RESET  _u(0x0)
#define M33_DDEVTYPE_MAJOR_BITS   _u(0x0000000f)
#define M33_DDEVTYPE_MAJOR_MSB    _u(3)
#define M33_DDEVTYPE_MAJOR_LSB    _u(0)
#define M33_DDEVTYPE_MAJOR_ACCESS "RO"
// =============================================================================
// Register    : M33_DPIDR4
// Description : Provides CoreSight discovery information for the SCS
#define M33_DPIDR4_OFFSET _u(0x0000efd0)
#define M33_DPIDR4_BITS   _u(0x000000ff)
#define M33_DPIDR4_RESET  _u(0x00000004)
// -----------------------------------------------------------------------------
// Field       : M33_DPIDR4_SIZE
// Description : See CoreSight Architecture Specification
#define M33_DPIDR4_SIZE_RESET  _u(0x0)
#define M33_DPIDR4_SIZE_BITS   _u(0x000000f0)
#define M33_DPIDR4_SIZE_MSB    _u(7)
#define M33_DPIDR4_SIZE_LSB    _u(4)
#define M33_DPIDR4_SIZE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DPIDR4_DES_2
// Description : See CoreSight Architecture Specification
#define M33_DPIDR4_DES_2_RESET  _u(0x4)
#define M33_DPIDR4_DES_2_BITS   _u(0x0000000f)
#define M33_DPIDR4_DES_2_MSB    _u(3)
#define M33_DPIDR4_DES_2_LSB    _u(0)
#define M33_DPIDR4_DES_2_ACCESS "RO"
// =============================================================================
// Register    : M33_DPIDR5
// Description : Provides CoreSight discovery information for the SCS
#define M33_DPIDR5_OFFSET _u(0x0000efd4)
#define M33_DPIDR5_BITS   _u(0x00000000)
#define M33_DPIDR5_RESET  _u(0x00000000)
#define M33_DPIDR5_MSB    _u(31)
#define M33_DPIDR5_LSB    _u(0)
#define M33_DPIDR5_ACCESS "RW"
// =============================================================================
// Register    : M33_DPIDR6
// Description : Provides CoreSight discovery information for the SCS
#define M33_DPIDR6_OFFSET _u(0x0000efd8)
#define M33_DPIDR6_BITS   _u(0x00000000)
#define M33_DPIDR6_RESET  _u(0x00000000)
#define M33_DPIDR6_MSB    _u(31)
#define M33_DPIDR6_LSB    _u(0)
#define M33_DPIDR6_ACCESS "RW"
// =============================================================================
// Register    : M33_DPIDR7
// Description : Provides CoreSight discovery information for the SCS
#define M33_DPIDR7_OFFSET _u(0x0000efdc)
#define M33_DPIDR7_BITS   _u(0x00000000)
#define M33_DPIDR7_RESET  _u(0x00000000)
#define M33_DPIDR7_MSB    _u(31)
#define M33_DPIDR7_LSB    _u(0)
#define M33_DPIDR7_ACCESS "RW"
// =============================================================================
// Register    : M33_DPIDR0
// Description : Provides CoreSight discovery information for the SCS
#define M33_DPIDR0_OFFSET _u(0x0000efe0)
#define M33_DPIDR0_BITS   _u(0x000000ff)
#define M33_DPIDR0_RESET  _u(0x00000021)
// -----------------------------------------------------------------------------
// Field       : M33_DPIDR0_PART_0
// Description : See CoreSight Architecture Specification
#define M33_DPIDR0_PART_0_RESET  _u(0x21)
#define M33_DPIDR0_PART_0_BITS   _u(0x000000ff)
#define M33_DPIDR0_PART_0_MSB    _u(7)
#define M33_DPIDR0_PART_0_LSB    _u(0)
#define M33_DPIDR0_PART_0_ACCESS "RO"
// =============================================================================
// Register    : M33_DPIDR1
// Description : Provides CoreSight discovery information for the SCS
#define M33_DPIDR1_OFFSET _u(0x0000efe4)
#define M33_DPIDR1_BITS   _u(0x000000ff)
#define M33_DPIDR1_RESET  _u(0x000000bd)
// -----------------------------------------------------------------------------
// Field       : M33_DPIDR1_DES_0
// Description : See CoreSight Architecture Specification
#define M33_DPIDR1_DES_0_RESET  _u(0xb)
#define M33_DPIDR1_DES_0_BITS   _u(0x000000f0)
#define M33_DPIDR1_DES_0_MSB    _u(7)
#define M33_DPIDR1_DES_0_LSB    _u(4)
#define M33_DPIDR1_DES_0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DPIDR1_PART_1
// Description : See CoreSight Architecture Specification
#define M33_DPIDR1_PART_1_RESET  _u(0xd)
#define M33_DPIDR1_PART_1_BITS   _u(0x0000000f)
#define M33_DPIDR1_PART_1_MSB    _u(3)
#define M33_DPIDR1_PART_1_LSB    _u(0)
#define M33_DPIDR1_PART_1_ACCESS "RO"
// =============================================================================
// Register    : M33_DPIDR2
// Description : Provides CoreSight discovery information for the SCS
#define M33_DPIDR2_OFFSET _u(0x0000efe8)
#define M33_DPIDR2_BITS   _u(0x000000ff)
#define M33_DPIDR2_RESET  _u(0x0000000b)
// -----------------------------------------------------------------------------
// Field       : M33_DPIDR2_REVISION
// Description : See CoreSight Architecture Specification
#define M33_DPIDR2_REVISION_RESET  _u(0x0)
#define M33_DPIDR2_REVISION_BITS   _u(0x000000f0)
#define M33_DPIDR2_REVISION_MSB    _u(7)
#define M33_DPIDR2_REVISION_LSB    _u(4)
