Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/m33.h
#define M33_DPIDR2_REVISION_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DPIDR2_JEDEC
// Description : See CoreSight Architecture Specification
#define M33_DPIDR2_JEDEC_RESET  _u(0x1)
#define M33_DPIDR2_JEDEC_BITS   _u(0x00000008)
#define M33_DPIDR2_JEDEC_MSB    _u(3)
#define M33_DPIDR2_JEDEC_LSB    _u(3)
#define M33_DPIDR2_JEDEC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DPIDR2_DES_1
// Description : See CoreSight Architecture Specification
#define M33_DPIDR2_DES_1_RESET  _u(0x3)
#define M33_DPIDR2_DES_1_BITS   _u(0x00000007)
#define M33_DPIDR2_DES_1_MSB    _u(2)
#define M33_DPIDR2_DES_1_LSB    _u(0)
#define M33_DPIDR2_DES_1_ACCESS "RO"
// =============================================================================
// Register    : M33_DPIDR3
// Description : Provides CoreSight discovery information for the SCS
#define M33_DPIDR3_OFFSET _u(0x0000efec)
#define M33_DPIDR3_BITS   _u(0x000000ff)
#define M33_DPIDR3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_DPIDR3_REVAND
// Description : See CoreSight Architecture Specification
#define M33_DPIDR3_REVAND_RESET  _u(0x0)
#define M33_DPIDR3_REVAND_BITS   _u(0x000000f0)
#define M33_DPIDR3_REVAND_MSB    _u(7)
#define M33_DPIDR3_REVAND_LSB    _u(4)
#define M33_DPIDR3_REVAND_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DPIDR3_CMOD
// Description : See CoreSight Architecture Specification
#define M33_DPIDR3_CMOD_RESET  _u(0x0)
#define M33_DPIDR3_CMOD_BITS   _u(0x0000000f)
#define M33_DPIDR3_CMOD_MSB    _u(3)
#define M33_DPIDR3_CMOD_LSB    _u(0)
#define M33_DPIDR3_CMOD_ACCESS "RO"
// =============================================================================
// Register    : M33_DCIDR0
// Description : Provides CoreSight discovery information for the SCS
#define M33_DCIDR0_OFFSET _u(0x0000eff0)
#define M33_DCIDR0_BITS   _u(0x000000ff)
#define M33_DCIDR0_RESET  _u(0x0000000d)
// -----------------------------------------------------------------------------
// Field       : M33_DCIDR0_PRMBL_0
// Description : See CoreSight Architecture Specification
#define M33_DCIDR0_PRMBL_0_RESET  _u(0x0d)
#define M33_DCIDR0_PRMBL_0_BITS   _u(0x000000ff)
#define M33_DCIDR0_PRMBL_0_MSB    _u(7)
#define M33_DCIDR0_PRMBL_0_LSB    _u(0)
#define M33_DCIDR0_PRMBL_0_ACCESS "RO"
// =============================================================================
// Register    : M33_DCIDR1
// Description : Provides CoreSight discovery information for the SCS
#define M33_DCIDR1_OFFSET _u(0x0000eff4)
#define M33_DCIDR1_BITS   _u(0x000000ff)
#define M33_DCIDR1_RESET  _u(0x00000090)
// -----------------------------------------------------------------------------
// Field       : M33_DCIDR1_CLASS
// Description : See CoreSight Architecture Specification
#define M33_DCIDR1_CLASS_RESET  _u(0x9)
#define M33_DCIDR1_CLASS_BITS   _u(0x000000f0)
#define M33_DCIDR1_CLASS_MSB    _u(7)
#define M33_DCIDR1_CLASS_LSB    _u(4)
#define M33_DCIDR1_CLASS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DCIDR1_PRMBL_1
// Description : See CoreSight Architecture Specification
#define M33_DCIDR1_PRMBL_1_RESET  _u(0x0)
#define M33_DCIDR1_PRMBL_1_BITS   _u(0x0000000f)
#define M33_DCIDR1_PRMBL_1_MSB    _u(3)
#define M33_DCIDR1_PRMBL_1_LSB    _u(0)
#define M33_DCIDR1_PRMBL_1_ACCESS "RO"
// =============================================================================
// Register    : M33_DCIDR2
// Description : Provides CoreSight discovery information for the SCS
#define M33_DCIDR2_OFFSET _u(0x0000eff8)
#define M33_DCIDR2_BITS   _u(0x000000ff)
#define M33_DCIDR2_RESET  _u(0x00000005)
// -----------------------------------------------------------------------------
// Field       : M33_DCIDR2_PRMBL_2
// Description : See CoreSight Architecture Specification
#define M33_DCIDR2_PRMBL_2_RESET  _u(0x05)
#define M33_DCIDR2_PRMBL_2_BITS   _u(0x000000ff)
#define M33_DCIDR2_PRMBL_2_MSB    _u(7)
#define M33_DCIDR2_PRMBL_2_LSB    _u(0)
#define M33_DCIDR2_PRMBL_2_ACCESS "RO"
// =============================================================================
// Register    : M33_DCIDR3
// Description : Provides CoreSight discovery information for the SCS
#define M33_DCIDR3_OFFSET _u(0x0000effc)
#define M33_DCIDR3_BITS   _u(0x000000ff)
#define M33_DCIDR3_RESET  _u(0x000000b1)
// -----------------------------------------------------------------------------
// Field       : M33_DCIDR3_PRMBL_3
// Description : See CoreSight Architecture Specification
#define M33_DCIDR3_PRMBL_3_RESET  _u(0xb1)
#define M33_DCIDR3_PRMBL_3_BITS   _u(0x000000ff)
#define M33_DCIDR3_PRMBL_3_MSB    _u(7)
#define M33_DCIDR3_PRMBL_3_LSB    _u(0)
#define M33_DCIDR3_PRMBL_3_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCPRGCTLR
// Description : Programming Control Register
#define M33_TRCPRGCTLR_OFFSET _u(0x00041004)
#define M33_TRCPRGCTLR_BITS   _u(0x00000001)
#define M33_TRCPRGCTLR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCPRGCTLR_EN
// Description : Trace Unit Enable
#define M33_TRCPRGCTLR_EN_RESET  _u(0x0)
#define M33_TRCPRGCTLR_EN_BITS   _u(0x00000001)
#define M33_TRCPRGCTLR_EN_MSB    _u(0)
#define M33_TRCPRGCTLR_EN_LSB    _u(0)
#define M33_TRCPRGCTLR_EN_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCSTATR
// Description : The TRCSTATR indicates the ETM-Teal status
#define M33_TRCSTATR_OFFSET _u(0x0004100c)
#define M33_TRCSTATR_BITS   _u(0x00000003)
#define M33_TRCSTATR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCSTATR_PMSTABLE
// Description : Indicates whether the ETM-Teal registers are stable and can be
//               read
#define M33_TRCSTATR_PMSTABLE_RESET  _u(0x0)
#define M33_TRCSTATR_PMSTABLE_BITS   _u(0x00000002)
#define M33_TRCSTATR_PMSTABLE_MSB    _u(1)
#define M33_TRCSTATR_PMSTABLE_LSB    _u(1)
#define M33_TRCSTATR_PMSTABLE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCSTATR_IDLE
// Description : Indicates that the trace unit is inactive
#define M33_TRCSTATR_IDLE_RESET  _u(0x0)
#define M33_TRCSTATR_IDLE_BITS   _u(0x00000001)
#define M33_TRCSTATR_IDLE_MSB    _u(0)
#define M33_TRCSTATR_IDLE_LSB    _u(0)
#define M33_TRCSTATR_IDLE_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCCONFIGR
// Description : The TRCCONFIGR sets the basic tracing options for the trace
//               unit
#define M33_TRCCONFIGR_OFFSET _u(0x00041010)
#define M33_TRCCONFIGR_BITS   _u(0x00001ff8)
#define M33_TRCCONFIGR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCCONFIGR_RS
// Description : Return stack enable
#define M33_TRCCONFIGR_RS_RESET  _u(0x0)
#define M33_TRCCONFIGR_RS_BITS   _u(0x00001000)
#define M33_TRCCONFIGR_RS_MSB    _u(12)
#define M33_TRCCONFIGR_RS_LSB    _u(12)
#define M33_TRCCONFIGR_RS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCCONFIGR_TS
// Description : Global timestamp tracing
#define M33_TRCCONFIGR_TS_RESET  _u(0x0)
#define M33_TRCCONFIGR_TS_BITS   _u(0x00000800)
#define M33_TRCCONFIGR_TS_MSB    _u(11)
#define M33_TRCCONFIGR_TS_LSB    _u(11)
#define M33_TRCCONFIGR_TS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCCONFIGR_COND
// Description : Conditional instruction tracing
#define M33_TRCCONFIGR_COND_RESET  _u(0x00)
#define M33_TRCCONFIGR_COND_BITS   _u(0x000007e0)
#define M33_TRCCONFIGR_COND_MSB    _u(10)
#define M33_TRCCONFIGR_COND_LSB    _u(5)
#define M33_TRCCONFIGR_COND_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCCONFIGR_CCI
// Description : Cycle counting in instruction trace
#define M33_TRCCONFIGR_CCI_RESET  _u(0x0)
#define M33_TRCCONFIGR_CCI_BITS   _u(0x00000010)
#define M33_TRCCONFIGR_CCI_MSB    _u(4)
#define M33_TRCCONFIGR_CCI_LSB    _u(4)
#define M33_TRCCONFIGR_CCI_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCCONFIGR_BB
// Description : Branch broadcast mode
#define M33_TRCCONFIGR_BB_RESET  _u(0x0)
#define M33_TRCCONFIGR_BB_BITS   _u(0x00000008)
#define M33_TRCCONFIGR_BB_MSB    _u(3)
#define M33_TRCCONFIGR_BB_LSB    _u(3)
#define M33_TRCCONFIGR_BB_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCEVENTCTL0R
// Description : The TRCEVENTCTL0R controls the tracing of events in the trace
//               stream. The events also drive the ETM-Teal external outputs.
#define M33_TRCEVENTCTL0R_OFFSET _u(0x00041020)
#define M33_TRCEVENTCTL0R_BITS   _u(0x00008787)
#define M33_TRCEVENTCTL0R_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCEVENTCTL0R_TYPE1
// Description : Selects the resource type for event 1
#define M33_TRCEVENTCTL0R_TYPE1_RESET  _u(0x0)
#define M33_TRCEVENTCTL0R_TYPE1_BITS   _u(0x00008000)
#define M33_TRCEVENTCTL0R_TYPE1_MSB    _u(15)
#define M33_TRCEVENTCTL0R_TYPE1_LSB    _u(15)
#define M33_TRCEVENTCTL0R_TYPE1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCEVENTCTL0R_SEL1
// Description : Selects the resource number, based on the value of TYPE1: When
//               TYPE1 is 0, selects a single selected resource from 0-15
//               defined by SEL1[2:0].  When TYPE1 is 1, selects a Boolean
//               combined resource pair from 0-7 defined by SEL1[2:0]
#define M33_TRCEVENTCTL0R_SEL1_RESET  _u(0x0)
#define M33_TRCEVENTCTL0R_SEL1_BITS   _u(0x00000700)
#define M33_TRCEVENTCTL0R_SEL1_MSB    _u(10)
#define M33_TRCEVENTCTL0R_SEL1_LSB    _u(8)
#define M33_TRCEVENTCTL0R_SEL1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCEVENTCTL0R_TYPE0
// Description : Selects the resource type for event 0
#define M33_TRCEVENTCTL0R_TYPE0_RESET  _u(0x0)
#define M33_TRCEVENTCTL0R_TYPE0_BITS   _u(0x00000080)
#define M33_TRCEVENTCTL0R_TYPE0_MSB    _u(7)
#define M33_TRCEVENTCTL0R_TYPE0_LSB    _u(7)
#define M33_TRCEVENTCTL0R_TYPE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCEVENTCTL0R_SEL0
// Description : Selects the resource number, based on the value of TYPE0: When
//               TYPE1 is 0, selects a single selected resource from 0-15
//               defined by SEL0[2:0].  When TYPE1 is 1, selects a Boolean
//               combined resource pair from 0-7 defined by SEL0[2:0]
#define M33_TRCEVENTCTL0R_SEL0_RESET  _u(0x0)
#define M33_TRCEVENTCTL0R_SEL0_BITS   _u(0x00000007)
#define M33_TRCEVENTCTL0R_SEL0_MSB    _u(2)
#define M33_TRCEVENTCTL0R_SEL0_LSB    _u(0)
#define M33_TRCEVENTCTL0R_SEL0_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCEVENTCTL1R
// Description : The TRCEVENTCTL1R controls how the events selected by
//               TRCEVENTCTL0R behave
#define M33_TRCEVENTCTL1R_OFFSET _u(0x00041024)
#define M33_TRCEVENTCTL1R_BITS   _u(0x00001803)
#define M33_TRCEVENTCTL1R_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCEVENTCTL1R_LPOVERRIDE
// Description : Low power state behavior override
#define M33_TRCEVENTCTL1R_LPOVERRIDE_RESET  _u(0x0)
#define M33_TRCEVENTCTL1R_LPOVERRIDE_BITS   _u(0x00001000)
#define M33_TRCEVENTCTL1R_LPOVERRIDE_MSB    _u(12)
#define M33_TRCEVENTCTL1R_LPOVERRIDE_LSB    _u(12)
#define M33_TRCEVENTCTL1R_LPOVERRIDE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCEVENTCTL1R_ATB
// Description : ATB enabled
#define M33_TRCEVENTCTL1R_ATB_RESET  _u(0x0)
#define M33_TRCEVENTCTL1R_ATB_BITS   _u(0x00000800)
#define M33_TRCEVENTCTL1R_ATB_MSB    _u(11)
#define M33_TRCEVENTCTL1R_ATB_LSB    _u(11)
#define M33_TRCEVENTCTL1R_ATB_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCEVENTCTL1R_INSTEN1
// Description : One bit per event, to enable generation of an event element in
//               the instruction trace stream when the selected event occurs
#define M33_TRCEVENTCTL1R_INSTEN1_RESET  _u(0x0)
#define M33_TRCEVENTCTL1R_INSTEN1_BITS   _u(0x00000002)
#define M33_TRCEVENTCTL1R_INSTEN1_MSB    _u(1)
#define M33_TRCEVENTCTL1R_INSTEN1_LSB    _u(1)
#define M33_TRCEVENTCTL1R_INSTEN1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCEVENTCTL1R_INSTEN0
// Description : One bit per event, to enable generation of an event element in
//               the instruction trace stream when the selected event occurs
#define M33_TRCEVENTCTL1R_INSTEN0_RESET  _u(0x0)
#define M33_TRCEVENTCTL1R_INSTEN0_BITS   _u(0x00000001)
#define M33_TRCEVENTCTL1R_INSTEN0_MSB    _u(0)
#define M33_TRCEVENTCTL1R_INSTEN0_LSB    _u(0)
#define M33_TRCEVENTCTL1R_INSTEN0_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCSTALLCTLR
// Description : The TRCSTALLCTLR enables ETM-Teal to stall the processor if the
//               ETM-Teal FIFO goes over the programmed level to minimize risk
//               of overflow
#define M33_TRCSTALLCTLR_OFFSET _u(0x0004102c)
#define M33_TRCSTALLCTLR_BITS   _u(0x0000050c)
#define M33_TRCSTALLCTLR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCSTALLCTLR_INSTPRIORITY
// Description : Reserved, RES0
#define M33_TRCSTALLCTLR_INSTPRIORITY_RESET  _u(0x0)
#define M33_TRCSTALLCTLR_INSTPRIORITY_BITS   _u(0x00000400)
#define M33_TRCSTALLCTLR_INSTPRIORITY_MSB    _u(10)
#define M33_TRCSTALLCTLR_INSTPRIORITY_LSB    _u(10)
#define M33_TRCSTALLCTLR_INSTPRIORITY_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCSTALLCTLR_ISTALL
// Description : Stall processor based on instruction trace buffer space
#define M33_TRCSTALLCTLR_ISTALL_RESET  _u(0x0)
#define M33_TRCSTALLCTLR_ISTALL_BITS   _u(0x00000100)
#define M33_TRCSTALLCTLR_ISTALL_MSB    _u(8)
#define M33_TRCSTALLCTLR_ISTALL_LSB    _u(8)
#define M33_TRCSTALLCTLR_ISTALL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCSTALLCTLR_LEVEL
// Description : Threshold at which stalling becomes active. This provides four
//               levels. This level can be varied to optimize the level of
//               invasion caused by stalling, balanced against the risk of a
//               FIFO overflow
#define M33_TRCSTALLCTLR_LEVEL_RESET  _u(0x0)
#define M33_TRCSTALLCTLR_LEVEL_BITS   _u(0x0000000c)
#define M33_TRCSTALLCTLR_LEVEL_MSB    _u(3)
#define M33_TRCSTALLCTLR_LEVEL_LSB    _u(2)
#define M33_TRCSTALLCTLR_LEVEL_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCTSCTLR
// Description : The TRCTSCTLR controls the insertion of global timestamps into
//               the trace stream. A timestamp is always inserted into the
//               instruction trace stream
#define M33_TRCTSCTLR_OFFSET _u(0x00041030)
#define M33_TRCTSCTLR_BITS   _u(0x00000083)
#define M33_TRCTSCTLR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCTSCTLR_TYPE0
// Description : Selects the resource type for event 0
#define M33_TRCTSCTLR_TYPE0_RESET  _u(0x0)
#define M33_TRCTSCTLR_TYPE0_BITS   _u(0x00000080)
#define M33_TRCTSCTLR_TYPE0_MSB    _u(7)
#define M33_TRCTSCTLR_TYPE0_LSB    _u(7)
#define M33_TRCTSCTLR_TYPE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCTSCTLR_SEL0
// Description : Selects the resource number, based on the value of TYPE0: When
//               TYPE1 is 0, selects a single selected resource from 0-15
//               defined by SEL0[2:0].  When TYPE1 is 1, selects a Boolean
//               combined resource pair from 0-7 defined by SEL0[2:0]
#define M33_TRCTSCTLR_SEL0_RESET  _u(0x0)
#define M33_TRCTSCTLR_SEL0_BITS   _u(0x00000003)
#define M33_TRCTSCTLR_SEL0_MSB    _u(1)
#define M33_TRCTSCTLR_SEL0_LSB    _u(0)
#define M33_TRCTSCTLR_SEL0_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCSYNCPR
// Description : The TRCSYNCPR specifies the period of trace synchronization of
//               the trace streams. TRCSYNCPR defines a number of bytes of trace
//               between requests for trace synchronization. This value is
//               always a power of two
#define M33_TRCSYNCPR_OFFSET _u(0x00041034)
#define M33_TRCSYNCPR_BITS   _u(0x0000001f)
#define M33_TRCSYNCPR_RESET  _u(0x0000000a)
// -----------------------------------------------------------------------------
// Field       : M33_TRCSYNCPR_PERIOD
// Description : Defines the number of bytes of trace between trace
//               synchronization requests as a total of the number of bytes
//               generated by the instruction stream. The number of bytes is 2N
//               where N is the value of this field: - A value of zero disables
//               these periodic trace synchronization requests, but does not
//               disable other trace synchronization requests.  - The minimum
//               value that can be programmed, other than zero, is 8, providing
//               a minimum trace synchronization period of 256 bytes.  - The
//               maximum value is 20, providing a maximum trace synchronization
//               period of 2^20 bytes
#define M33_TRCSYNCPR_PERIOD_RESET  _u(0x0a)
#define M33_TRCSYNCPR_PERIOD_BITS   _u(0x0000001f)
#define M33_TRCSYNCPR_PERIOD_MSB    _u(4)
#define M33_TRCSYNCPR_PERIOD_LSB    _u(0)
#define M33_TRCSYNCPR_PERIOD_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCCCCTLR
// Description : The TRCCCCTLR sets the threshold value for instruction trace
//               cycle counting. The threshold represents the minimum interval
//               between cycle count trace packets
#define M33_TRCCCCTLR_OFFSET _u(0x00041038)
#define M33_TRCCCCTLR_BITS   _u(0x00000fff)
#define M33_TRCCCCTLR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCCCCTLR_THRESHOLD
// Description : Instruction trace cycle count threshold
#define M33_TRCCCCTLR_THRESHOLD_RESET  _u(0x000)
#define M33_TRCCCCTLR_THRESHOLD_BITS   _u(0x00000fff)
#define M33_TRCCCCTLR_THRESHOLD_MSB    _u(11)
#define M33_TRCCCCTLR_THRESHOLD_LSB    _u(0)
#define M33_TRCCCCTLR_THRESHOLD_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCVICTLR
// Description : The TRCVICTLR controls instruction trace filtering
#define M33_TRCVICTLR_OFFSET _u(0x00041080)
#define M33_TRCVICTLR_BITS   _u(0x00090e83)
#define M33_TRCVICTLR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCVICTLR_EXLEVEL_S3
// Description : In Secure state, each bit controls whether instruction tracing
//               is enabled for the corresponding exception level
#define M33_TRCVICTLR_EXLEVEL_S3_RESET  _u(0x0)
#define M33_TRCVICTLR_EXLEVEL_S3_BITS   _u(0x00080000)
#define M33_TRCVICTLR_EXLEVEL_S3_MSB    _u(19)
#define M33_TRCVICTLR_EXLEVEL_S3_LSB    _u(19)
#define M33_TRCVICTLR_EXLEVEL_S3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCVICTLR_EXLEVEL_S0
// Description : In Secure state, each bit controls whether instruction tracing
//               is enabled for the corresponding exception level
#define M33_TRCVICTLR_EXLEVEL_S0_RESET  _u(0x0)
#define M33_TRCVICTLR_EXLEVEL_S0_BITS   _u(0x00010000)
#define M33_TRCVICTLR_EXLEVEL_S0_MSB    _u(16)
#define M33_TRCVICTLR_EXLEVEL_S0_LSB    _u(16)
#define M33_TRCVICTLR_EXLEVEL_S0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCVICTLR_TRCERR
// Description : Selects whether a system error exception must always be traced
#define M33_TRCVICTLR_TRCERR_RESET  _u(0x0)
#define M33_TRCVICTLR_TRCERR_BITS   _u(0x00000800)
#define M33_TRCVICTLR_TRCERR_MSB    _u(11)
#define M33_TRCVICTLR_TRCERR_LSB    _u(11)
#define M33_TRCVICTLR_TRCERR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCVICTLR_TRCRESET
// Description : Selects whether a reset exception must always be traced
#define M33_TRCVICTLR_TRCRESET_RESET  _u(0x0)
#define M33_TRCVICTLR_TRCRESET_BITS   _u(0x00000400)
#define M33_TRCVICTLR_TRCRESET_MSB    _u(10)
#define M33_TRCVICTLR_TRCRESET_LSB    _u(10)
#define M33_TRCVICTLR_TRCRESET_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCVICTLR_SSSTATUS
// Description : Indicates the current status of the start/stop logic
#define M33_TRCVICTLR_SSSTATUS_RESET  _u(0x0)
#define M33_TRCVICTLR_SSSTATUS_BITS   _u(0x00000200)
#define M33_TRCVICTLR_SSSTATUS_MSB    _u(9)
#define M33_TRCVICTLR_SSSTATUS_LSB    _u(9)
#define M33_TRCVICTLR_SSSTATUS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCVICTLR_TYPE0
// Description : Selects the resource type for event 0
#define M33_TRCVICTLR_TYPE0_RESET  _u(0x0)
#define M33_TRCVICTLR_TYPE0_BITS   _u(0x00000080)
#define M33_TRCVICTLR_TYPE0_MSB    _u(7)
#define M33_TRCVICTLR_TYPE0_LSB    _u(7)
#define M33_TRCVICTLR_TYPE0_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCVICTLR_SEL0
// Description : Selects the resource number, based on the value of TYPE0: When
//               TYPE1 is 0, selects a single selected resource from 0-15
//               defined by SEL0[2:0].  When TYPE1 is 1, selects a Boolean
//               combined resource pair from 0-7 defined by SEL0[2:0]
#define M33_TRCVICTLR_SEL0_RESET  _u(0x0)
#define M33_TRCVICTLR_SEL0_BITS   _u(0x00000003)
#define M33_TRCVICTLR_SEL0_MSB    _u(1)
#define M33_TRCVICTLR_SEL0_LSB    _u(0)
#define M33_TRCVICTLR_SEL0_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCCNTRLDVR0
// Description : The TRCCNTRLDVR defines the reload value for the reduced
//               function counter
#define M33_TRCCNTRLDVR0_OFFSET _u(0x00041140)
#define M33_TRCCNTRLDVR0_BITS   _u(0x0000ffff)
#define M33_TRCCNTRLDVR0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCCNTRLDVR0_VALUE
// Description : Defines the reload value for the counter. This value is loaded
//               into the counter each time the reload event occurs
#define M33_TRCCNTRLDVR0_VALUE_RESET  _u(0x0000)
#define M33_TRCCNTRLDVR0_VALUE_BITS   _u(0x0000ffff)
#define M33_TRCCNTRLDVR0_VALUE_MSB    _u(15)
#define M33_TRCCNTRLDVR0_VALUE_LSB    _u(0)
