Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/m33.h
#define M33_TRCCNTRLDVR0_VALUE_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCIDR8
// Description : TRCIDR8
#define M33_TRCIDR8_OFFSET _u(0x00041180)
#define M33_TRCIDR8_BITS   _u(0xffffffff)
#define M33_TRCIDR8_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR8_MAXSPEC
// Description : reads as `ImpDef
#define M33_TRCIDR8_MAXSPEC_RESET  _u(0x00000000)
#define M33_TRCIDR8_MAXSPEC_BITS   _u(0xffffffff)
#define M33_TRCIDR8_MAXSPEC_MSB    _u(31)
#define M33_TRCIDR8_MAXSPEC_LSB    _u(0)
#define M33_TRCIDR8_MAXSPEC_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCIDR9
// Description : TRCIDR9
#define M33_TRCIDR9_OFFSET _u(0x00041184)
#define M33_TRCIDR9_BITS   _u(0xffffffff)
#define M33_TRCIDR9_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR9_NUMP0KEY
// Description : reads as `ImpDef
#define M33_TRCIDR9_NUMP0KEY_RESET  _u(0x00000000)
#define M33_TRCIDR9_NUMP0KEY_BITS   _u(0xffffffff)
#define M33_TRCIDR9_NUMP0KEY_MSB    _u(31)
#define M33_TRCIDR9_NUMP0KEY_LSB    _u(0)
#define M33_TRCIDR9_NUMP0KEY_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCIDR10
// Description : TRCIDR10
#define M33_TRCIDR10_OFFSET _u(0x00041188)
#define M33_TRCIDR10_BITS   _u(0xffffffff)
#define M33_TRCIDR10_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR10_NUMP1KEY
// Description : reads as `ImpDef
#define M33_TRCIDR10_NUMP1KEY_RESET  _u(0x00000000)
#define M33_TRCIDR10_NUMP1KEY_BITS   _u(0xffffffff)
#define M33_TRCIDR10_NUMP1KEY_MSB    _u(31)
#define M33_TRCIDR10_NUMP1KEY_LSB    _u(0)
#define M33_TRCIDR10_NUMP1KEY_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCIDR11
// Description : TRCIDR11
#define M33_TRCIDR11_OFFSET _u(0x0004118c)
#define M33_TRCIDR11_BITS   _u(0xffffffff)
#define M33_TRCIDR11_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR11_NUMP1SPC
// Description : reads as `ImpDef
#define M33_TRCIDR11_NUMP1SPC_RESET  _u(0x00000000)
#define M33_TRCIDR11_NUMP1SPC_BITS   _u(0xffffffff)
#define M33_TRCIDR11_NUMP1SPC_MSB    _u(31)
#define M33_TRCIDR11_NUMP1SPC_LSB    _u(0)
#define M33_TRCIDR11_NUMP1SPC_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCIDR12
// Description : TRCIDR12
#define M33_TRCIDR12_OFFSET _u(0x00041190)
#define M33_TRCIDR12_BITS   _u(0xffffffff)
#define M33_TRCIDR12_RESET  _u(0x00000001)
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR12_NUMCONDKEY
// Description : reads as `ImpDef
#define M33_TRCIDR12_NUMCONDKEY_RESET  _u(0x00000001)
#define M33_TRCIDR12_NUMCONDKEY_BITS   _u(0xffffffff)
#define M33_TRCIDR12_NUMCONDKEY_MSB    _u(31)
#define M33_TRCIDR12_NUMCONDKEY_LSB    _u(0)
#define M33_TRCIDR12_NUMCONDKEY_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCIDR13
// Description : TRCIDR13
#define M33_TRCIDR13_OFFSET _u(0x00041194)
#define M33_TRCIDR13_BITS   _u(0xffffffff)
#define M33_TRCIDR13_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR13_NUMCONDSPC
// Description : reads as `ImpDef
#define M33_TRCIDR13_NUMCONDSPC_RESET  _u(0x00000000)
#define M33_TRCIDR13_NUMCONDSPC_BITS   _u(0xffffffff)
#define M33_TRCIDR13_NUMCONDSPC_MSB    _u(31)
#define M33_TRCIDR13_NUMCONDSPC_LSB    _u(0)
#define M33_TRCIDR13_NUMCONDSPC_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCIMSPEC
// Description : The TRCIMSPEC shows the presence of any IMPLEMENTATION SPECIFIC
//               features, and enables any features that are provided
#define M33_TRCIMSPEC_OFFSET _u(0x000411c0)
#define M33_TRCIMSPEC_BITS   _u(0x0000000f)
#define M33_TRCIMSPEC_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCIMSPEC_SUPPORT
// Description : Reserved, RES0
#define M33_TRCIMSPEC_SUPPORT_RESET  _u(0x0)
#define M33_TRCIMSPEC_SUPPORT_BITS   _u(0x0000000f)
#define M33_TRCIMSPEC_SUPPORT_MSB    _u(3)
#define M33_TRCIMSPEC_SUPPORT_LSB    _u(0)
#define M33_TRCIMSPEC_SUPPORT_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCIDR0
// Description : TRCIDR0
#define M33_TRCIDR0_OFFSET _u(0x000411e0)
#define M33_TRCIDR0_BITS   _u(0x3f03feff)
#define M33_TRCIDR0_RESET  _u(0x280006e1)
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR0_COMMOPT
// Description : reads as `ImpDef
#define M33_TRCIDR0_COMMOPT_RESET  _u(0x1)
#define M33_TRCIDR0_COMMOPT_BITS   _u(0x20000000)
#define M33_TRCIDR0_COMMOPT_MSB    _u(29)
#define M33_TRCIDR0_COMMOPT_LSB    _u(29)
#define M33_TRCIDR0_COMMOPT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR0_TSSIZE
// Description : reads as `ImpDef
#define M33_TRCIDR0_TSSIZE_RESET  _u(0x08)
#define M33_TRCIDR0_TSSIZE_BITS   _u(0x1f000000)
#define M33_TRCIDR0_TSSIZE_MSB    _u(28)
#define M33_TRCIDR0_TSSIZE_LSB    _u(24)
#define M33_TRCIDR0_TSSIZE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR0_TRCEXDATA
// Description : reads as `ImpDef
#define M33_TRCIDR0_TRCEXDATA_RESET  _u(0x0)
#define M33_TRCIDR0_TRCEXDATA_BITS   _u(0x00020000)
#define M33_TRCIDR0_TRCEXDATA_MSB    _u(17)
#define M33_TRCIDR0_TRCEXDATA_LSB    _u(17)
#define M33_TRCIDR0_TRCEXDATA_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR0_QSUPP
// Description : reads as `ImpDef
#define M33_TRCIDR0_QSUPP_RESET  _u(0x0)
#define M33_TRCIDR0_QSUPP_BITS   _u(0x00018000)
#define M33_TRCIDR0_QSUPP_MSB    _u(16)
#define M33_TRCIDR0_QSUPP_LSB    _u(15)
#define M33_TRCIDR0_QSUPP_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR0_QFILT
// Description : reads as `ImpDef
#define M33_TRCIDR0_QFILT_RESET  _u(0x0)
#define M33_TRCIDR0_QFILT_BITS   _u(0x00004000)
#define M33_TRCIDR0_QFILT_MSB    _u(14)
#define M33_TRCIDR0_QFILT_LSB    _u(14)
#define M33_TRCIDR0_QFILT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR0_CONDTYPE
// Description : reads as `ImpDef
#define M33_TRCIDR0_CONDTYPE_RESET  _u(0x0)
#define M33_TRCIDR0_CONDTYPE_BITS   _u(0x00003000)
#define M33_TRCIDR0_CONDTYPE_MSB    _u(13)
#define M33_TRCIDR0_CONDTYPE_LSB    _u(12)
#define M33_TRCIDR0_CONDTYPE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR0_NUMEVENT
// Description : reads as `ImpDef
#define M33_TRCIDR0_NUMEVENT_RESET  _u(0x1)
#define M33_TRCIDR0_NUMEVENT_BITS   _u(0x00000c00)
#define M33_TRCIDR0_NUMEVENT_MSB    _u(11)
#define M33_TRCIDR0_NUMEVENT_LSB    _u(10)
#define M33_TRCIDR0_NUMEVENT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR0_RETSTACK
// Description : reads as `ImpDef
#define M33_TRCIDR0_RETSTACK_RESET  _u(0x1)
#define M33_TRCIDR0_RETSTACK_BITS   _u(0x00000200)
#define M33_TRCIDR0_RETSTACK_MSB    _u(9)
#define M33_TRCIDR0_RETSTACK_LSB    _u(9)
#define M33_TRCIDR0_RETSTACK_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR0_TRCCCI
// Description : reads as `ImpDef
#define M33_TRCIDR0_TRCCCI_RESET  _u(0x1)
#define M33_TRCIDR0_TRCCCI_BITS   _u(0x00000080)
#define M33_TRCIDR0_TRCCCI_MSB    _u(7)
#define M33_TRCIDR0_TRCCCI_LSB    _u(7)
#define M33_TRCIDR0_TRCCCI_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR0_TRCCOND
// Description : reads as `ImpDef
#define M33_TRCIDR0_TRCCOND_RESET  _u(0x1)
#define M33_TRCIDR0_TRCCOND_BITS   _u(0x00000040)
#define M33_TRCIDR0_TRCCOND_MSB    _u(6)
#define M33_TRCIDR0_TRCCOND_LSB    _u(6)
#define M33_TRCIDR0_TRCCOND_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR0_TRCBB
// Description : reads as `ImpDef
#define M33_TRCIDR0_TRCBB_RESET  _u(0x1)
#define M33_TRCIDR0_TRCBB_BITS   _u(0x00000020)
#define M33_TRCIDR0_TRCBB_MSB    _u(5)
#define M33_TRCIDR0_TRCBB_LSB    _u(5)
#define M33_TRCIDR0_TRCBB_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR0_TRCDATA
// Description : reads as `ImpDef
#define M33_TRCIDR0_TRCDATA_RESET  _u(0x0)
#define M33_TRCIDR0_TRCDATA_BITS   _u(0x00000018)
#define M33_TRCIDR0_TRCDATA_MSB    _u(4)
#define M33_TRCIDR0_TRCDATA_LSB    _u(3)
#define M33_TRCIDR0_TRCDATA_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR0_INSTP0
// Description : reads as `ImpDef
#define M33_TRCIDR0_INSTP0_RESET  _u(0x0)
#define M33_TRCIDR0_INSTP0_BITS   _u(0x00000006)
#define M33_TRCIDR0_INSTP0_MSB    _u(2)
#define M33_TRCIDR0_INSTP0_LSB    _u(1)
#define M33_TRCIDR0_INSTP0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR0_RES1
// Description : Reserved, RES1
#define M33_TRCIDR0_RES1_RESET  _u(0x1)
#define M33_TRCIDR0_RES1_BITS   _u(0x00000001)
#define M33_TRCIDR0_RES1_MSB    _u(0)
#define M33_TRCIDR0_RES1_LSB    _u(0)
#define M33_TRCIDR0_RES1_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCIDR1
// Description : TRCIDR1
#define M33_TRCIDR1_OFFSET _u(0x000411e4)
#define M33_TRCIDR1_BITS   _u(0xff00ffff)
#define M33_TRCIDR1_RESET  _u(0x4100f421)
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR1_DESIGNER
// Description : reads as `ImpDef
#define M33_TRCIDR1_DESIGNER_RESET  _u(0x41)
#define M33_TRCIDR1_DESIGNER_BITS   _u(0xff000000)
#define M33_TRCIDR1_DESIGNER_MSB    _u(31)
#define M33_TRCIDR1_DESIGNER_LSB    _u(24)
#define M33_TRCIDR1_DESIGNER_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR1_RES1
// Description : Reserved, RES1
#define M33_TRCIDR1_RES1_RESET  _u(0xf)
#define M33_TRCIDR1_RES1_BITS   _u(0x0000f000)
#define M33_TRCIDR1_RES1_MSB    _u(15)
#define M33_TRCIDR1_RES1_LSB    _u(12)
#define M33_TRCIDR1_RES1_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR1_TRCARCHMAJ
// Description : reads as 0b0100
#define M33_TRCIDR1_TRCARCHMAJ_RESET  _u(0x4)
#define M33_TRCIDR1_TRCARCHMAJ_BITS   _u(0x00000f00)
#define M33_TRCIDR1_TRCARCHMAJ_MSB    _u(11)
#define M33_TRCIDR1_TRCARCHMAJ_LSB    _u(8)
#define M33_TRCIDR1_TRCARCHMAJ_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR1_TRCARCHMIN
// Description : reads as 0b0000
#define M33_TRCIDR1_TRCARCHMIN_RESET  _u(0x2)
#define M33_TRCIDR1_TRCARCHMIN_BITS   _u(0x000000f0)
#define M33_TRCIDR1_TRCARCHMIN_MSB    _u(7)
#define M33_TRCIDR1_TRCARCHMIN_LSB    _u(4)
#define M33_TRCIDR1_TRCARCHMIN_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR1_REVISION
// Description : reads as `ImpDef
#define M33_TRCIDR1_REVISION_RESET  _u(0x1)
#define M33_TRCIDR1_REVISION_BITS   _u(0x0000000f)
#define M33_TRCIDR1_REVISION_MSB    _u(3)
#define M33_TRCIDR1_REVISION_LSB    _u(0)
#define M33_TRCIDR1_REVISION_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCIDR2
// Description : TRCIDR2
#define M33_TRCIDR2_OFFSET _u(0x000411e8)
#define M33_TRCIDR2_BITS   _u(0x1fffffff)
#define M33_TRCIDR2_RESET  _u(0x00000004)
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR2_CCSIZE
// Description : reads as `ImpDef
#define M33_TRCIDR2_CCSIZE_RESET  _u(0x0)
#define M33_TRCIDR2_CCSIZE_BITS   _u(0x1e000000)
#define M33_TRCIDR2_CCSIZE_MSB    _u(28)
#define M33_TRCIDR2_CCSIZE_LSB    _u(25)
#define M33_TRCIDR2_CCSIZE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR2_DVSIZE
// Description : reads as `ImpDef
#define M33_TRCIDR2_DVSIZE_RESET  _u(0x00)
#define M33_TRCIDR2_DVSIZE_BITS   _u(0x01f00000)
#define M33_TRCIDR2_DVSIZE_MSB    _u(24)
#define M33_TRCIDR2_DVSIZE_LSB    _u(20)
#define M33_TRCIDR2_DVSIZE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR2_DASIZE
// Description : reads as `ImpDef
#define M33_TRCIDR2_DASIZE_RESET  _u(0x00)
#define M33_TRCIDR2_DASIZE_BITS   _u(0x000f8000)
#define M33_TRCIDR2_DASIZE_MSB    _u(19)
#define M33_TRCIDR2_DASIZE_LSB    _u(15)
#define M33_TRCIDR2_DASIZE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR2_VMIDSIZE
// Description : reads as `ImpDef
#define M33_TRCIDR2_VMIDSIZE_RESET  _u(0x00)
#define M33_TRCIDR2_VMIDSIZE_BITS   _u(0x00007c00)
#define M33_TRCIDR2_VMIDSIZE_MSB    _u(14)
#define M33_TRCIDR2_VMIDSIZE_LSB    _u(10)
#define M33_TRCIDR2_VMIDSIZE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR2_CIDSIZE
// Description : reads as `ImpDef
#define M33_TRCIDR2_CIDSIZE_RESET  _u(0x00)
#define M33_TRCIDR2_CIDSIZE_BITS   _u(0x000003e0)
#define M33_TRCIDR2_CIDSIZE_MSB    _u(9)
#define M33_TRCIDR2_CIDSIZE_LSB    _u(5)
#define M33_TRCIDR2_CIDSIZE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR2_IASIZE
// Description : reads as `ImpDef
#define M33_TRCIDR2_IASIZE_RESET  _u(0x04)
#define M33_TRCIDR2_IASIZE_BITS   _u(0x0000001f)
#define M33_TRCIDR2_IASIZE_MSB    _u(4)
#define M33_TRCIDR2_IASIZE_LSB    _u(0)
#define M33_TRCIDR2_IASIZE_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCIDR3
// Description : TRCIDR3
#define M33_TRCIDR3_OFFSET _u(0x000411ec)
#define M33_TRCIDR3_BITS   _u(0xffff0fff)
#define M33_TRCIDR3_RESET  _u(0x0f090004)
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR3_NOOVERFLOW
// Description : reads as `ImpDef
#define M33_TRCIDR3_NOOVERFLOW_RESET  _u(0x0)
#define M33_TRCIDR3_NOOVERFLOW_BITS   _u(0x80000000)
#define M33_TRCIDR3_NOOVERFLOW_MSB    _u(31)
#define M33_TRCIDR3_NOOVERFLOW_LSB    _u(31)
#define M33_TRCIDR3_NOOVERFLOW_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR3_NUMPROC
// Description : reads as `ImpDef
#define M33_TRCIDR3_NUMPROC_RESET  _u(0x0)
#define M33_TRCIDR3_NUMPROC_BITS   _u(0x70000000)
#define M33_TRCIDR3_NUMPROC_MSB    _u(30)
#define M33_TRCIDR3_NUMPROC_LSB    _u(28)
#define M33_TRCIDR3_NUMPROC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR3_SYSSTALL
// Description : reads as `ImpDef
#define M33_TRCIDR3_SYSSTALL_RESET  _u(0x1)
#define M33_TRCIDR3_SYSSTALL_BITS   _u(0x08000000)
#define M33_TRCIDR3_SYSSTALL_MSB    _u(27)
#define M33_TRCIDR3_SYSSTALL_LSB    _u(27)
#define M33_TRCIDR3_SYSSTALL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR3_STALLCTL
// Description : reads as `ImpDef
#define M33_TRCIDR3_STALLCTL_RESET  _u(0x1)
#define M33_TRCIDR3_STALLCTL_BITS   _u(0x04000000)
#define M33_TRCIDR3_STALLCTL_MSB    _u(26)
#define M33_TRCIDR3_STALLCTL_LSB    _u(26)
#define M33_TRCIDR3_STALLCTL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR3_SYNCPR
// Description : reads as `ImpDef
#define M33_TRCIDR3_SYNCPR_RESET  _u(0x1)
#define M33_TRCIDR3_SYNCPR_BITS   _u(0x02000000)
#define M33_TRCIDR3_SYNCPR_MSB    _u(25)
#define M33_TRCIDR3_SYNCPR_LSB    _u(25)
#define M33_TRCIDR3_SYNCPR_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR3_TRCERR
// Description : reads as `ImpDef
#define M33_TRCIDR3_TRCERR_RESET  _u(0x1)
#define M33_TRCIDR3_TRCERR_BITS   _u(0x01000000)
#define M33_TRCIDR3_TRCERR_MSB    _u(24)
#define M33_TRCIDR3_TRCERR_LSB    _u(24)
#define M33_TRCIDR3_TRCERR_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR3_EXLEVEL_NS
// Description : reads as `ImpDef
#define M33_TRCIDR3_EXLEVEL_NS_RESET  _u(0x0)
#define M33_TRCIDR3_EXLEVEL_NS_BITS   _u(0x00f00000)
#define M33_TRCIDR3_EXLEVEL_NS_MSB    _u(23)
#define M33_TRCIDR3_EXLEVEL_NS_LSB    _u(20)
#define M33_TRCIDR3_EXLEVEL_NS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR3_EXLEVEL_S
// Description : reads as `ImpDef
#define M33_TRCIDR3_EXLEVEL_S_RESET  _u(0x9)
#define M33_TRCIDR3_EXLEVEL_S_BITS   _u(0x000f0000)
#define M33_TRCIDR3_EXLEVEL_S_MSB    _u(19)
#define M33_TRCIDR3_EXLEVEL_S_LSB    _u(16)
#define M33_TRCIDR3_EXLEVEL_S_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR3_CCITMIN
// Description : reads as `ImpDef
#define M33_TRCIDR3_CCITMIN_RESET  _u(0x004)
#define M33_TRCIDR3_CCITMIN_BITS   _u(0x00000fff)
#define M33_TRCIDR3_CCITMIN_MSB    _u(11)
#define M33_TRCIDR3_CCITMIN_LSB    _u(0)
#define M33_TRCIDR3_CCITMIN_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCIDR4
// Description : TRCIDR4
#define M33_TRCIDR4_OFFSET _u(0x000411f0)
#define M33_TRCIDR4_BITS   _u(0xfffff1ff)
#define M33_TRCIDR4_RESET  _u(0x00114000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR4_NUMVMIDC
// Description : reads as `ImpDef
#define M33_TRCIDR4_NUMVMIDC_RESET  _u(0x0)
#define M33_TRCIDR4_NUMVMIDC_BITS   _u(0xf0000000)
#define M33_TRCIDR4_NUMVMIDC_MSB    _u(31)
#define M33_TRCIDR4_NUMVMIDC_LSB    _u(28)
#define M33_TRCIDR4_NUMVMIDC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR4_NUMCIDC
// Description : reads as `ImpDef
#define M33_TRCIDR4_NUMCIDC_RESET  _u(0x0)
#define M33_TRCIDR4_NUMCIDC_BITS   _u(0x0f000000)
#define M33_TRCIDR4_NUMCIDC_MSB    _u(27)
#define M33_TRCIDR4_NUMCIDC_LSB    _u(24)
#define M33_TRCIDR4_NUMCIDC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR4_NUMSSCC
// Description : reads as `ImpDef
#define M33_TRCIDR4_NUMSSCC_RESET  _u(0x1)
#define M33_TRCIDR4_NUMSSCC_BITS   _u(0x00f00000)
#define M33_TRCIDR4_NUMSSCC_MSB    _u(23)
#define M33_TRCIDR4_NUMSSCC_LSB    _u(20)
#define M33_TRCIDR4_NUMSSCC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR4_NUMRSPAIR
// Description : reads as `ImpDef
#define M33_TRCIDR4_NUMRSPAIR_RESET  _u(0x1)
#define M33_TRCIDR4_NUMRSPAIR_BITS   _u(0x000f0000)
#define M33_TRCIDR4_NUMRSPAIR_MSB    _u(19)
#define M33_TRCIDR4_NUMRSPAIR_LSB    _u(16)
#define M33_TRCIDR4_NUMRSPAIR_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR4_NUMPC
// Description : reads as `ImpDef
#define M33_TRCIDR4_NUMPC_RESET  _u(0x4)
#define M33_TRCIDR4_NUMPC_BITS   _u(0x0000f000)
#define M33_TRCIDR4_NUMPC_MSB    _u(15)
#define M33_TRCIDR4_NUMPC_LSB    _u(12)
#define M33_TRCIDR4_NUMPC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR4_SUPPDAC
// Description : reads as `ImpDef
#define M33_TRCIDR4_SUPPDAC_RESET  _u(0x0)
#define M33_TRCIDR4_SUPPDAC_BITS   _u(0x00000100)
#define M33_TRCIDR4_SUPPDAC_MSB    _u(8)
#define M33_TRCIDR4_SUPPDAC_LSB    _u(8)
#define M33_TRCIDR4_SUPPDAC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR4_NUMDVC
// Description : reads as `ImpDef
#define M33_TRCIDR4_NUMDVC_RESET  _u(0x0)
#define M33_TRCIDR4_NUMDVC_BITS   _u(0x000000f0)
#define M33_TRCIDR4_NUMDVC_MSB    _u(7)
#define M33_TRCIDR4_NUMDVC_LSB    _u(4)
#define M33_TRCIDR4_NUMDVC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR4_NUMACPAIRS
// Description : reads as `ImpDef
#define M33_TRCIDR4_NUMACPAIRS_RESET  _u(0x0)
#define M33_TRCIDR4_NUMACPAIRS_BITS   _u(0x0000000f)
#define M33_TRCIDR4_NUMACPAIRS_MSB    _u(3)
#define M33_TRCIDR4_NUMACPAIRS_LSB    _u(0)
#define M33_TRCIDR4_NUMACPAIRS_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCIDR5
// Description : TRCIDR5
#define M33_TRCIDR5_OFFSET _u(0x000411f4)
#define M33_TRCIDR5_BITS   _u(0xfeff0fff)
#define M33_TRCIDR5_RESET  _u(0x90c70004)
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR5_REDFUNCNTR
// Description : reads as `ImpDef
#define M33_TRCIDR5_REDFUNCNTR_RESET  _u(0x1)
#define M33_TRCIDR5_REDFUNCNTR_BITS   _u(0x80000000)
#define M33_TRCIDR5_REDFUNCNTR_MSB    _u(31)
#define M33_TRCIDR5_REDFUNCNTR_LSB    _u(31)
#define M33_TRCIDR5_REDFUNCNTR_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR5_NUMCNTR
// Description : reads as `ImpDef
#define M33_TRCIDR5_NUMCNTR_RESET  _u(0x1)
#define M33_TRCIDR5_NUMCNTR_BITS   _u(0x70000000)
#define M33_TRCIDR5_NUMCNTR_MSB    _u(30)
#define M33_TRCIDR5_NUMCNTR_LSB    _u(28)
#define M33_TRCIDR5_NUMCNTR_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR5_NUMSEQSTATE
// Description : reads as `ImpDef
#define M33_TRCIDR5_NUMSEQSTATE_RESET  _u(0x0)
#define M33_TRCIDR5_NUMSEQSTATE_BITS   _u(0x0e000000)
#define M33_TRCIDR5_NUMSEQSTATE_MSB    _u(27)
#define M33_TRCIDR5_NUMSEQSTATE_LSB    _u(25)
#define M33_TRCIDR5_NUMSEQSTATE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR5_LPOVERRIDE
// Description : reads as `ImpDef
#define M33_TRCIDR5_LPOVERRIDE_RESET  _u(0x1)
#define M33_TRCIDR5_LPOVERRIDE_BITS   _u(0x00800000)
#define M33_TRCIDR5_LPOVERRIDE_MSB    _u(23)
#define M33_TRCIDR5_LPOVERRIDE_LSB    _u(23)
#define M33_TRCIDR5_LPOVERRIDE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR5_ATBTRIG
// Description : reads as `ImpDef
#define M33_TRCIDR5_ATBTRIG_RESET  _u(0x1)
#define M33_TRCIDR5_ATBTRIG_BITS   _u(0x00400000)
#define M33_TRCIDR5_ATBTRIG_MSB    _u(22)
#define M33_TRCIDR5_ATBTRIG_LSB    _u(22)
#define M33_TRCIDR5_ATBTRIG_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR5_TRACEIDSIZE
// Description : reads as 0x07
#define M33_TRCIDR5_TRACEIDSIZE_RESET  _u(0x07)
#define M33_TRCIDR5_TRACEIDSIZE_BITS   _u(0x003f0000)
