Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/m33.h
#define M33_TRCIDR5_TRACEIDSIZE_MSB    _u(21)
#define M33_TRCIDR5_TRACEIDSIZE_LSB    _u(16)
#define M33_TRCIDR5_TRACEIDSIZE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR5_NUMEXTINSEL
// Description : reads as `ImpDef
#define M33_TRCIDR5_NUMEXTINSEL_RESET  _u(0x0)
#define M33_TRCIDR5_NUMEXTINSEL_BITS   _u(0x00000e00)
#define M33_TRCIDR5_NUMEXTINSEL_MSB    _u(11)
#define M33_TRCIDR5_NUMEXTINSEL_LSB    _u(9)
#define M33_TRCIDR5_NUMEXTINSEL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCIDR5_NUMEXTIN
// Description : reads as `ImpDef
#define M33_TRCIDR5_NUMEXTIN_RESET  _u(0x004)
#define M33_TRCIDR5_NUMEXTIN_BITS   _u(0x000001ff)
#define M33_TRCIDR5_NUMEXTIN_MSB    _u(8)
#define M33_TRCIDR5_NUMEXTIN_LSB    _u(0)
#define M33_TRCIDR5_NUMEXTIN_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCIDR6
// Description : TRCIDR6
#define M33_TRCIDR6_OFFSET _u(0x000411f8)
#define M33_TRCIDR6_BITS   _u(0x00000000)
#define M33_TRCIDR6_RESET  _u(0x00000000)
#define M33_TRCIDR6_MSB    _u(31)
#define M33_TRCIDR6_LSB    _u(0)
#define M33_TRCIDR6_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCIDR7
// Description : TRCIDR7
#define M33_TRCIDR7_OFFSET _u(0x000411fc)
#define M33_TRCIDR7_BITS   _u(0x00000000)
#define M33_TRCIDR7_RESET  _u(0x00000000)
#define M33_TRCIDR7_MSB    _u(31)
#define M33_TRCIDR7_LSB    _u(0)
#define M33_TRCIDR7_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCRSCTLR2
// Description : The TRCRSCTLR controls the trace resources
#define M33_TRCRSCTLR2_OFFSET _u(0x00041208)
#define M33_TRCRSCTLR2_BITS   _u(0x003700ff)
#define M33_TRCRSCTLR2_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCRSCTLR2_PAIRINV
// Description : Inverts the result of a combined pair of resources.  This bit
//               is only implemented on the lower register for a pair of
//               resource selectors
#define M33_TRCRSCTLR2_PAIRINV_RESET  _u(0x0)
#define M33_TRCRSCTLR2_PAIRINV_BITS   _u(0x00200000)
#define M33_TRCRSCTLR2_PAIRINV_MSB    _u(21)
#define M33_TRCRSCTLR2_PAIRINV_LSB    _u(21)
#define M33_TRCRSCTLR2_PAIRINV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCRSCTLR2_INV
// Description : Inverts the selected resources
#define M33_TRCRSCTLR2_INV_RESET  _u(0x0)
#define M33_TRCRSCTLR2_INV_BITS   _u(0x00100000)
#define M33_TRCRSCTLR2_INV_MSB    _u(20)
#define M33_TRCRSCTLR2_INV_LSB    _u(20)
#define M33_TRCRSCTLR2_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCRSCTLR2_GROUP
// Description : Selects a group of resource
#define M33_TRCRSCTLR2_GROUP_RESET  _u(0x0)
#define M33_TRCRSCTLR2_GROUP_BITS   _u(0x00070000)
#define M33_TRCRSCTLR2_GROUP_MSB    _u(18)
#define M33_TRCRSCTLR2_GROUP_LSB    _u(16)
#define M33_TRCRSCTLR2_GROUP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCRSCTLR2_SELECT
// Description : Selects one or more resources from the wanted group. One bit is
//               provided per resource from the group
#define M33_TRCRSCTLR2_SELECT_RESET  _u(0x00)
#define M33_TRCRSCTLR2_SELECT_BITS   _u(0x000000ff)
#define M33_TRCRSCTLR2_SELECT_MSB    _u(7)
#define M33_TRCRSCTLR2_SELECT_LSB    _u(0)
#define M33_TRCRSCTLR2_SELECT_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCRSCTLR3
// Description : The TRCRSCTLR controls the trace resources
#define M33_TRCRSCTLR3_OFFSET _u(0x0004120c)
#define M33_TRCRSCTLR3_BITS   _u(0x003700ff)
#define M33_TRCRSCTLR3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCRSCTLR3_PAIRINV
// Description : Inverts the result of a combined pair of resources.  This bit
//               is only implemented on the lower register for a pair of
//               resource selectors
#define M33_TRCRSCTLR3_PAIRINV_RESET  _u(0x0)
#define M33_TRCRSCTLR3_PAIRINV_BITS   _u(0x00200000)
#define M33_TRCRSCTLR3_PAIRINV_MSB    _u(21)
#define M33_TRCRSCTLR3_PAIRINV_LSB    _u(21)
#define M33_TRCRSCTLR3_PAIRINV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCRSCTLR3_INV
// Description : Inverts the selected resources
#define M33_TRCRSCTLR3_INV_RESET  _u(0x0)
#define M33_TRCRSCTLR3_INV_BITS   _u(0x00100000)
#define M33_TRCRSCTLR3_INV_MSB    _u(20)
#define M33_TRCRSCTLR3_INV_LSB    _u(20)
#define M33_TRCRSCTLR3_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCRSCTLR3_GROUP
// Description : Selects a group of resource
#define M33_TRCRSCTLR3_GROUP_RESET  _u(0x0)
#define M33_TRCRSCTLR3_GROUP_BITS   _u(0x00070000)
#define M33_TRCRSCTLR3_GROUP_MSB    _u(18)
#define M33_TRCRSCTLR3_GROUP_LSB    _u(16)
#define M33_TRCRSCTLR3_GROUP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCRSCTLR3_SELECT
// Description : Selects one or more resources from the wanted group. One bit is
//               provided per resource from the group
#define M33_TRCRSCTLR3_SELECT_RESET  _u(0x00)
#define M33_TRCRSCTLR3_SELECT_BITS   _u(0x000000ff)
#define M33_TRCRSCTLR3_SELECT_MSB    _u(7)
#define M33_TRCRSCTLR3_SELECT_LSB    _u(0)
#define M33_TRCRSCTLR3_SELECT_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCSSCSR
// Description : Controls the corresponding single-shot comparator resource
#define M33_TRCSSCSR_OFFSET _u(0x000412a0)
#define M33_TRCSSCSR_BITS   _u(0x8000000f)
#define M33_TRCSSCSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCSSCSR_STATUS
// Description : Single-shot status bit. Indicates if any of the comparators,
//               that TRCSSCCRn.SAC or TRCSSCCRn.ARC selects, have matched
#define M33_TRCSSCSR_STATUS_RESET  _u(0x0)
#define M33_TRCSSCSR_STATUS_BITS   _u(0x80000000)
#define M33_TRCSSCSR_STATUS_MSB    _u(31)
#define M33_TRCSSCSR_STATUS_LSB    _u(31)
#define M33_TRCSSCSR_STATUS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCSSCSR_PC
// Description : Reserved, RES1
#define M33_TRCSSCSR_PC_RESET  _u(0x0)
#define M33_TRCSSCSR_PC_BITS   _u(0x00000008)
#define M33_TRCSSCSR_PC_MSB    _u(3)
#define M33_TRCSSCSR_PC_LSB    _u(3)
#define M33_TRCSSCSR_PC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCSSCSR_DV
// Description : Reserved, RES0
#define M33_TRCSSCSR_DV_RESET  _u(0x0)
#define M33_TRCSSCSR_DV_BITS   _u(0x00000004)
#define M33_TRCSSCSR_DV_MSB    _u(2)
#define M33_TRCSSCSR_DV_LSB    _u(2)
#define M33_TRCSSCSR_DV_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCSSCSR_DA
// Description : Reserved, RES0
#define M33_TRCSSCSR_DA_RESET  _u(0x0)
#define M33_TRCSSCSR_DA_BITS   _u(0x00000002)
#define M33_TRCSSCSR_DA_MSB    _u(1)
#define M33_TRCSSCSR_DA_LSB    _u(1)
#define M33_TRCSSCSR_DA_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCSSCSR_INST
// Description : Reserved, RES0
#define M33_TRCSSCSR_INST_RESET  _u(0x0)
#define M33_TRCSSCSR_INST_BITS   _u(0x00000001)
#define M33_TRCSSCSR_INST_MSB    _u(0)
#define M33_TRCSSCSR_INST_LSB    _u(0)
#define M33_TRCSSCSR_INST_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCSSPCICR
// Description : Selects the PE comparator inputs for Single-shot control
#define M33_TRCSSPCICR_OFFSET _u(0x000412c0)
#define M33_TRCSSPCICR_BITS   _u(0x0000000f)
#define M33_TRCSSPCICR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCSSPCICR_PC
// Description : Selects one or more PE comparator inputs for Single-shot
//               control.  TRCIDR4.NUMPC defines the size of the PC field.  1
//               bit is provided for each implemented PE comparator input.  For
//               example, if bit[1] == 1 this selects PE comparator input 1 for
//               Single-shot control
#define M33_TRCSSPCICR_PC_RESET  _u(0x0)
#define M33_TRCSSPCICR_PC_BITS   _u(0x0000000f)
#define M33_TRCSSPCICR_PC_MSB    _u(3)
#define M33_TRCSSPCICR_PC_LSB    _u(0)
#define M33_TRCSSPCICR_PC_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCPDCR
// Description : Requests the system to provide power to the trace unit
#define M33_TRCPDCR_OFFSET _u(0x00041310)
#define M33_TRCPDCR_BITS   _u(0x00000008)
#define M33_TRCPDCR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCPDCR_PU
// Description : Powerup request bit:
#define M33_TRCPDCR_PU_RESET  _u(0x0)
#define M33_TRCPDCR_PU_BITS   _u(0x00000008)
#define M33_TRCPDCR_PU_MSB    _u(3)
#define M33_TRCPDCR_PU_LSB    _u(3)
#define M33_TRCPDCR_PU_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCPDSR
// Description : Returns the following information about the trace unit: - OS
//               Lock status.  - Core power domain status.  - Power interruption
//               status
#define M33_TRCPDSR_OFFSET _u(0x00041314)
#define M33_TRCPDSR_BITS   _u(0x00000023)
#define M33_TRCPDSR_RESET  _u(0x00000003)
// -----------------------------------------------------------------------------
// Field       : M33_TRCPDSR_OSLK
// Description : OS Lock status bit:
#define M33_TRCPDSR_OSLK_RESET  _u(0x0)
#define M33_TRCPDSR_OSLK_BITS   _u(0x00000020)
#define M33_TRCPDSR_OSLK_MSB    _u(5)
#define M33_TRCPDSR_OSLK_LSB    _u(5)
#define M33_TRCPDSR_OSLK_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCPDSR_STICKYPD
// Description : Sticky powerdown status bit. Indicates whether the trace
//               register state is valid:
#define M33_TRCPDSR_STICKYPD_RESET  _u(0x1)
#define M33_TRCPDSR_STICKYPD_BITS   _u(0x00000002)
#define M33_TRCPDSR_STICKYPD_MSB    _u(1)
#define M33_TRCPDSR_STICKYPD_LSB    _u(1)
#define M33_TRCPDSR_STICKYPD_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCPDSR_POWER
// Description : Power status bit:
#define M33_TRCPDSR_POWER_RESET  _u(0x1)
#define M33_TRCPDSR_POWER_BITS   _u(0x00000001)
#define M33_TRCPDSR_POWER_MSB    _u(0)
#define M33_TRCPDSR_POWER_LSB    _u(0)
#define M33_TRCPDSR_POWER_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCITATBIDR
// Description : Trace Integration ATB Identification Register
#define M33_TRCITATBIDR_OFFSET _u(0x00041ee4)
#define M33_TRCITATBIDR_BITS   _u(0x0000007f)
#define M33_TRCITATBIDR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCITATBIDR_ID
// Description : Trace ID
#define M33_TRCITATBIDR_ID_RESET  _u(0x00)
#define M33_TRCITATBIDR_ID_BITS   _u(0x0000007f)
#define M33_TRCITATBIDR_ID_MSB    _u(6)
#define M33_TRCITATBIDR_ID_LSB    _u(0)
#define M33_TRCITATBIDR_ID_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCITIATBINR
// Description : Trace Integration Instruction ATB In Register
#define M33_TRCITIATBINR_OFFSET _u(0x00041ef4)
#define M33_TRCITIATBINR_BITS   _u(0x00000003)
#define M33_TRCITIATBINR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCITIATBINR_AFVALIDM
// Description : Integration Mode instruction AFVALIDM in
#define M33_TRCITIATBINR_AFVALIDM_RESET  _u(0x0)
#define M33_TRCITIATBINR_AFVALIDM_BITS   _u(0x00000002)
#define M33_TRCITIATBINR_AFVALIDM_MSB    _u(1)
#define M33_TRCITIATBINR_AFVALIDM_LSB    _u(1)
#define M33_TRCITIATBINR_AFVALIDM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCITIATBINR_ATREADYM
// Description : Integration Mode instruction ATREADYM in
#define M33_TRCITIATBINR_ATREADYM_RESET  _u(0x0)
#define M33_TRCITIATBINR_ATREADYM_BITS   _u(0x00000001)
#define M33_TRCITIATBINR_ATREADYM_MSB    _u(0)
#define M33_TRCITIATBINR_ATREADYM_LSB    _u(0)
#define M33_TRCITIATBINR_ATREADYM_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCITIATBOUTR
// Description : Trace Integration Instruction ATB Out Register
#define M33_TRCITIATBOUTR_OFFSET _u(0x00041efc)
#define M33_TRCITIATBOUTR_BITS   _u(0x00000003)
#define M33_TRCITIATBOUTR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCITIATBOUTR_AFREADY
// Description : Integration Mode instruction AFREADY out
#define M33_TRCITIATBOUTR_AFREADY_RESET  _u(0x0)
#define M33_TRCITIATBOUTR_AFREADY_BITS   _u(0x00000002)
#define M33_TRCITIATBOUTR_AFREADY_MSB    _u(1)
#define M33_TRCITIATBOUTR_AFREADY_LSB    _u(1)
#define M33_TRCITIATBOUTR_AFREADY_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCITIATBOUTR_ATVALID
// Description : Integration Mode instruction ATVALID out
#define M33_TRCITIATBOUTR_ATVALID_RESET  _u(0x0)
#define M33_TRCITIATBOUTR_ATVALID_BITS   _u(0x00000001)
#define M33_TRCITIATBOUTR_ATVALID_MSB    _u(0)
#define M33_TRCITIATBOUTR_ATVALID_LSB    _u(0)
#define M33_TRCITIATBOUTR_ATVALID_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCCLAIMSET
// Description : Claim Tag Set Register
#define M33_TRCCLAIMSET_OFFSET _u(0x00041fa0)
#define M33_TRCCLAIMSET_BITS   _u(0x0000000f)
#define M33_TRCCLAIMSET_RESET  _u(0x0000000f)
// -----------------------------------------------------------------------------
// Field       : M33_TRCCLAIMSET_SET3
// Description : When a write to one of these bits occurs, with the value:
#define M33_TRCCLAIMSET_SET3_RESET  _u(0x1)
#define M33_TRCCLAIMSET_SET3_BITS   _u(0x00000008)
#define M33_TRCCLAIMSET_SET3_MSB    _u(3)
#define M33_TRCCLAIMSET_SET3_LSB    _u(3)
#define M33_TRCCLAIMSET_SET3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCCLAIMSET_SET2
// Description : When a write to one of these bits occurs, with the value:
#define M33_TRCCLAIMSET_SET2_RESET  _u(0x1)
#define M33_TRCCLAIMSET_SET2_BITS   _u(0x00000004)
#define M33_TRCCLAIMSET_SET2_MSB    _u(2)
#define M33_TRCCLAIMSET_SET2_LSB    _u(2)
#define M33_TRCCLAIMSET_SET2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCCLAIMSET_SET1
// Description : When a write to one of these bits occurs, with the value:
#define M33_TRCCLAIMSET_SET1_RESET  _u(0x1)
#define M33_TRCCLAIMSET_SET1_BITS   _u(0x00000002)
#define M33_TRCCLAIMSET_SET1_MSB    _u(1)
#define M33_TRCCLAIMSET_SET1_LSB    _u(1)
#define M33_TRCCLAIMSET_SET1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCCLAIMSET_SET0
// Description : When a write to one of these bits occurs, with the value:
#define M33_TRCCLAIMSET_SET0_RESET  _u(0x1)
#define M33_TRCCLAIMSET_SET0_BITS   _u(0x00000001)
#define M33_TRCCLAIMSET_SET0_MSB    _u(0)
#define M33_TRCCLAIMSET_SET0_LSB    _u(0)
#define M33_TRCCLAIMSET_SET0_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCCLAIMCLR
// Description : Claim Tag Clear Register
#define M33_TRCCLAIMCLR_OFFSET _u(0x00041fa4)
#define M33_TRCCLAIMCLR_BITS   _u(0x0000000f)
#define M33_TRCCLAIMCLR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCCLAIMCLR_CLR3
// Description : When a write to one of these bits occurs, with the value:
#define M33_TRCCLAIMCLR_CLR3_RESET  _u(0x0)
#define M33_TRCCLAIMCLR_CLR3_BITS   _u(0x00000008)
#define M33_TRCCLAIMCLR_CLR3_MSB    _u(3)
#define M33_TRCCLAIMCLR_CLR3_LSB    _u(3)
#define M33_TRCCLAIMCLR_CLR3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCCLAIMCLR_CLR2
// Description : When a write to one of these bits occurs, with the value:
#define M33_TRCCLAIMCLR_CLR2_RESET  _u(0x0)
#define M33_TRCCLAIMCLR_CLR2_BITS   _u(0x00000004)
#define M33_TRCCLAIMCLR_CLR2_MSB    _u(2)
#define M33_TRCCLAIMCLR_CLR2_LSB    _u(2)
#define M33_TRCCLAIMCLR_CLR2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCCLAIMCLR_CLR1
// Description : When a write to one of these bits occurs, with the value:
#define M33_TRCCLAIMCLR_CLR1_RESET  _u(0x0)
#define M33_TRCCLAIMCLR_CLR1_BITS   _u(0x00000002)
#define M33_TRCCLAIMCLR_CLR1_MSB    _u(1)
#define M33_TRCCLAIMCLR_CLR1_LSB    _u(1)
#define M33_TRCCLAIMCLR_CLR1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_TRCCLAIMCLR_CLR0
// Description : When a write to one of these bits occurs, with the value:
#define M33_TRCCLAIMCLR_CLR0_RESET  _u(0x0)
#define M33_TRCCLAIMCLR_CLR0_BITS   _u(0x00000001)
#define M33_TRCCLAIMCLR_CLR0_MSB    _u(0)
#define M33_TRCCLAIMCLR_CLR0_LSB    _u(0)
#define M33_TRCCLAIMCLR_CLR0_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCAUTHSTATUS
// Description : Returns the level of tracing that the trace unit can support
#define M33_TRCAUTHSTATUS_OFFSET _u(0x00041fb8)
#define M33_TRCAUTHSTATUS_BITS   _u(0x000000ff)
#define M33_TRCAUTHSTATUS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCAUTHSTATUS_SNID
// Description : Indicates whether the system enables the trace unit to support
//               Secure non-invasive debug:
#define M33_TRCAUTHSTATUS_SNID_RESET  _u(0x0)
#define M33_TRCAUTHSTATUS_SNID_BITS   _u(0x000000c0)
#define M33_TRCAUTHSTATUS_SNID_MSB    _u(7)
#define M33_TRCAUTHSTATUS_SNID_LSB    _u(6)
#define M33_TRCAUTHSTATUS_SNID_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCAUTHSTATUS_SID
// Description : Indicates whether the trace unit supports Secure invasive
//               debug:
#define M33_TRCAUTHSTATUS_SID_RESET  _u(0x0)
#define M33_TRCAUTHSTATUS_SID_BITS   _u(0x00000030)
#define M33_TRCAUTHSTATUS_SID_MSB    _u(5)
#define M33_TRCAUTHSTATUS_SID_LSB    _u(4)
#define M33_TRCAUTHSTATUS_SID_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCAUTHSTATUS_NSNID
// Description : Indicates whether the system enables the trace unit to support
//               Non-secure non-invasive debug:
#define M33_TRCAUTHSTATUS_NSNID_RESET  _u(0x0)
#define M33_TRCAUTHSTATUS_NSNID_BITS   _u(0x0000000c)
#define M33_TRCAUTHSTATUS_NSNID_MSB    _u(3)
#define M33_TRCAUTHSTATUS_NSNID_LSB    _u(2)
#define M33_TRCAUTHSTATUS_NSNID_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCAUTHSTATUS_NSID
// Description : Indicates whether the trace unit supports Non-secure invasive
//               debug:
#define M33_TRCAUTHSTATUS_NSID_RESET  _u(0x0)
#define M33_TRCAUTHSTATUS_NSID_BITS   _u(0x00000003)
#define M33_TRCAUTHSTATUS_NSID_MSB    _u(1)
#define M33_TRCAUTHSTATUS_NSID_LSB    _u(0)
#define M33_TRCAUTHSTATUS_NSID_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCDEVARCH
// Description : TRCDEVARCH
#define M33_TRCDEVARCH_OFFSET _u(0x00041fbc)
#define M33_TRCDEVARCH_BITS   _u(0xffffffff)
#define M33_TRCDEVARCH_RESET  _u(0x47724a13)
// -----------------------------------------------------------------------------
// Field       : M33_TRCDEVARCH_ARCHITECT
// Description : reads as 0b01000111011
#define M33_TRCDEVARCH_ARCHITECT_RESET  _u(0x23b)
#define M33_TRCDEVARCH_ARCHITECT_BITS   _u(0xffe00000)
#define M33_TRCDEVARCH_ARCHITECT_MSB    _u(31)
#define M33_TRCDEVARCH_ARCHITECT_LSB    _u(21)
#define M33_TRCDEVARCH_ARCHITECT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCDEVARCH_PRESENT
// Description : reads as 0b1
#define M33_TRCDEVARCH_PRESENT_RESET  _u(0x1)
#define M33_TRCDEVARCH_PRESENT_BITS   _u(0x00100000)
#define M33_TRCDEVARCH_PRESENT_MSB    _u(20)
#define M33_TRCDEVARCH_PRESENT_LSB    _u(20)
#define M33_TRCDEVARCH_PRESENT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCDEVARCH_REVISION
// Description : reads as 0b0000
#define M33_TRCDEVARCH_REVISION_RESET  _u(0x2)
#define M33_TRCDEVARCH_REVISION_BITS   _u(0x000f0000)
#define M33_TRCDEVARCH_REVISION_MSB    _u(19)
#define M33_TRCDEVARCH_REVISION_LSB    _u(16)
#define M33_TRCDEVARCH_REVISION_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCDEVARCH_ARCHID
// Description : reads as 0b0100101000010011
#define M33_TRCDEVARCH_ARCHID_RESET  _u(0x4a13)
#define M33_TRCDEVARCH_ARCHID_BITS   _u(0x0000ffff)
#define M33_TRCDEVARCH_ARCHID_MSB    _u(15)
#define M33_TRCDEVARCH_ARCHID_LSB    _u(0)
#define M33_TRCDEVARCH_ARCHID_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCDEVID
// Description : TRCDEVID
#define M33_TRCDEVID_OFFSET _u(0x00041fc8)
#define M33_TRCDEVID_BITS   _u(0x00000000)
#define M33_TRCDEVID_RESET  _u(0x00000000)
#define M33_TRCDEVID_MSB    _u(31)
#define M33_TRCDEVID_LSB    _u(0)
#define M33_TRCDEVID_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCDEVTYPE
// Description : TRCDEVTYPE
#define M33_TRCDEVTYPE_OFFSET _u(0x00041fcc)
#define M33_TRCDEVTYPE_BITS   _u(0x000000ff)
#define M33_TRCDEVTYPE_RESET  _u(0x00000013)
// -----------------------------------------------------------------------------
// Field       : M33_TRCDEVTYPE_SUB
// Description : reads as 0b0001
#define M33_TRCDEVTYPE_SUB_RESET  _u(0x1)
#define M33_TRCDEVTYPE_SUB_BITS   _u(0x000000f0)
#define M33_TRCDEVTYPE_SUB_MSB    _u(7)
#define M33_TRCDEVTYPE_SUB_LSB    _u(4)
#define M33_TRCDEVTYPE_SUB_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCDEVTYPE_MAJOR
// Description : reads as 0b0011
#define M33_TRCDEVTYPE_MAJOR_RESET  _u(0x3)
#define M33_TRCDEVTYPE_MAJOR_BITS   _u(0x0000000f)
#define M33_TRCDEVTYPE_MAJOR_MSB    _u(3)
#define M33_TRCDEVTYPE_MAJOR_LSB    _u(0)
#define M33_TRCDEVTYPE_MAJOR_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCPIDR4
// Description : TRCPIDR4
#define M33_TRCPIDR4_OFFSET _u(0x00041fd0)
#define M33_TRCPIDR4_BITS   _u(0x000000ff)
#define M33_TRCPIDR4_RESET  _u(0x00000004)
// -----------------------------------------------------------------------------
// Field       : M33_TRCPIDR4_SIZE
// Description : reads as `ImpDef
