Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/m33.h
#define M33_TRCPIDR4_SIZE_RESET  _u(0x0)
#define M33_TRCPIDR4_SIZE_BITS   _u(0x000000f0)
#define M33_TRCPIDR4_SIZE_MSB    _u(7)
#define M33_TRCPIDR4_SIZE_LSB    _u(4)
#define M33_TRCPIDR4_SIZE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCPIDR4_DES_2
// Description : reads as `ImpDef
#define M33_TRCPIDR4_DES_2_RESET  _u(0x4)
#define M33_TRCPIDR4_DES_2_BITS   _u(0x0000000f)
#define M33_TRCPIDR4_DES_2_MSB    _u(3)
#define M33_TRCPIDR4_DES_2_LSB    _u(0)
#define M33_TRCPIDR4_DES_2_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCPIDR5
// Description : TRCPIDR5
#define M33_TRCPIDR5_OFFSET _u(0x00041fd4)
#define M33_TRCPIDR5_BITS   _u(0x00000000)
#define M33_TRCPIDR5_RESET  _u(0x00000000)
#define M33_TRCPIDR5_MSB    _u(31)
#define M33_TRCPIDR5_LSB    _u(0)
#define M33_TRCPIDR5_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCPIDR6
// Description : TRCPIDR6
#define M33_TRCPIDR6_OFFSET _u(0x00041fd8)
#define M33_TRCPIDR6_BITS   _u(0x00000000)
#define M33_TRCPIDR6_RESET  _u(0x00000000)
#define M33_TRCPIDR6_MSB    _u(31)
#define M33_TRCPIDR6_LSB    _u(0)
#define M33_TRCPIDR6_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCPIDR7
// Description : TRCPIDR7
#define M33_TRCPIDR7_OFFSET _u(0x00041fdc)
#define M33_TRCPIDR7_BITS   _u(0x00000000)
#define M33_TRCPIDR7_RESET  _u(0x00000000)
#define M33_TRCPIDR7_MSB    _u(31)
#define M33_TRCPIDR7_LSB    _u(0)
#define M33_TRCPIDR7_ACCESS "RW"
// =============================================================================
// Register    : M33_TRCPIDR0
// Description : TRCPIDR0
#define M33_TRCPIDR0_OFFSET _u(0x00041fe0)
#define M33_TRCPIDR0_BITS   _u(0x000000ff)
#define M33_TRCPIDR0_RESET  _u(0x00000021)
// -----------------------------------------------------------------------------
// Field       : M33_TRCPIDR0_PART_0
// Description : reads as `ImpDef
#define M33_TRCPIDR0_PART_0_RESET  _u(0x21)
#define M33_TRCPIDR0_PART_0_BITS   _u(0x000000ff)
#define M33_TRCPIDR0_PART_0_MSB    _u(7)
#define M33_TRCPIDR0_PART_0_LSB    _u(0)
#define M33_TRCPIDR0_PART_0_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCPIDR1
// Description : TRCPIDR1
#define M33_TRCPIDR1_OFFSET _u(0x00041fe4)
#define M33_TRCPIDR1_BITS   _u(0x000000ff)
#define M33_TRCPIDR1_RESET  _u(0x000000bd)
// -----------------------------------------------------------------------------
// Field       : M33_TRCPIDR1_DES_0
// Description : reads as `ImpDef
#define M33_TRCPIDR1_DES_0_RESET  _u(0xb)
#define M33_TRCPIDR1_DES_0_BITS   _u(0x000000f0)
#define M33_TRCPIDR1_DES_0_MSB    _u(7)
#define M33_TRCPIDR1_DES_0_LSB    _u(4)
#define M33_TRCPIDR1_DES_0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCPIDR1_PART_0
// Description : reads as `ImpDef
#define M33_TRCPIDR1_PART_0_RESET  _u(0xd)
#define M33_TRCPIDR1_PART_0_BITS   _u(0x0000000f)
#define M33_TRCPIDR1_PART_0_MSB    _u(3)
#define M33_TRCPIDR1_PART_0_LSB    _u(0)
#define M33_TRCPIDR1_PART_0_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCPIDR2
// Description : TRCPIDR2
#define M33_TRCPIDR2_OFFSET _u(0x00041fe8)
#define M33_TRCPIDR2_BITS   _u(0x000000ff)
#define M33_TRCPIDR2_RESET  _u(0x0000002b)
// -----------------------------------------------------------------------------
// Field       : M33_TRCPIDR2_REVISION
// Description : reads as `ImpDef
#define M33_TRCPIDR2_REVISION_RESET  _u(0x2)
#define M33_TRCPIDR2_REVISION_BITS   _u(0x000000f0)
#define M33_TRCPIDR2_REVISION_MSB    _u(7)
#define M33_TRCPIDR2_REVISION_LSB    _u(4)
#define M33_TRCPIDR2_REVISION_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCPIDR2_JEDEC
// Description : reads as 0b1
#define M33_TRCPIDR2_JEDEC_RESET  _u(0x1)
#define M33_TRCPIDR2_JEDEC_BITS   _u(0x00000008)
#define M33_TRCPIDR2_JEDEC_MSB    _u(3)
#define M33_TRCPIDR2_JEDEC_LSB    _u(3)
#define M33_TRCPIDR2_JEDEC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCPIDR2_DES_0
// Description : reads as `ImpDef
#define M33_TRCPIDR2_DES_0_RESET  _u(0x3)
#define M33_TRCPIDR2_DES_0_BITS   _u(0x00000007)
#define M33_TRCPIDR2_DES_0_MSB    _u(2)
#define M33_TRCPIDR2_DES_0_LSB    _u(0)
#define M33_TRCPIDR2_DES_0_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCPIDR3
// Description : TRCPIDR3
#define M33_TRCPIDR3_OFFSET _u(0x00041fec)
#define M33_TRCPIDR3_BITS   _u(0x000000ff)
#define M33_TRCPIDR3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_TRCPIDR3_REVAND
// Description : reads as `ImpDef
#define M33_TRCPIDR3_REVAND_RESET  _u(0x0)
#define M33_TRCPIDR3_REVAND_BITS   _u(0x000000f0)
#define M33_TRCPIDR3_REVAND_MSB    _u(7)
#define M33_TRCPIDR3_REVAND_LSB    _u(4)
#define M33_TRCPIDR3_REVAND_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCPIDR3_CMOD
// Description : reads as `ImpDef
#define M33_TRCPIDR3_CMOD_RESET  _u(0x0)
#define M33_TRCPIDR3_CMOD_BITS   _u(0x0000000f)
#define M33_TRCPIDR3_CMOD_MSB    _u(3)
#define M33_TRCPIDR3_CMOD_LSB    _u(0)
#define M33_TRCPIDR3_CMOD_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCCIDR0
// Description : TRCCIDR0
#define M33_TRCCIDR0_OFFSET _u(0x00041ff0)
#define M33_TRCCIDR0_BITS   _u(0x000000ff)
#define M33_TRCCIDR0_RESET  _u(0x0000000d)
// -----------------------------------------------------------------------------
// Field       : M33_TRCCIDR0_PRMBL_0
// Description : reads as 0b00001101
#define M33_TRCCIDR0_PRMBL_0_RESET  _u(0x0d)
#define M33_TRCCIDR0_PRMBL_0_BITS   _u(0x000000ff)
#define M33_TRCCIDR0_PRMBL_0_MSB    _u(7)
#define M33_TRCCIDR0_PRMBL_0_LSB    _u(0)
#define M33_TRCCIDR0_PRMBL_0_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCCIDR1
// Description : TRCCIDR1
#define M33_TRCCIDR1_OFFSET _u(0x00041ff4)
#define M33_TRCCIDR1_BITS   _u(0x000000ff)
#define M33_TRCCIDR1_RESET  _u(0x00000090)
// -----------------------------------------------------------------------------
// Field       : M33_TRCCIDR1_CLASS
// Description : reads as 0b1001
#define M33_TRCCIDR1_CLASS_RESET  _u(0x9)
#define M33_TRCCIDR1_CLASS_BITS   _u(0x000000f0)
#define M33_TRCCIDR1_CLASS_MSB    _u(7)
#define M33_TRCCIDR1_CLASS_LSB    _u(4)
#define M33_TRCCIDR1_CLASS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_TRCCIDR1_PRMBL_1
// Description : reads as 0b0000
#define M33_TRCCIDR1_PRMBL_1_RESET  _u(0x0)
#define M33_TRCCIDR1_PRMBL_1_BITS   _u(0x0000000f)
#define M33_TRCCIDR1_PRMBL_1_MSB    _u(3)
#define M33_TRCCIDR1_PRMBL_1_LSB    _u(0)
#define M33_TRCCIDR1_PRMBL_1_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCCIDR2
// Description : TRCCIDR2
#define M33_TRCCIDR2_OFFSET _u(0x00041ff8)
#define M33_TRCCIDR2_BITS   _u(0x000000ff)
#define M33_TRCCIDR2_RESET  _u(0x00000005)
// -----------------------------------------------------------------------------
// Field       : M33_TRCCIDR2_PRMBL_2
// Description : reads as 0b00000101
#define M33_TRCCIDR2_PRMBL_2_RESET  _u(0x05)
#define M33_TRCCIDR2_PRMBL_2_BITS   _u(0x000000ff)
#define M33_TRCCIDR2_PRMBL_2_MSB    _u(7)
#define M33_TRCCIDR2_PRMBL_2_LSB    _u(0)
#define M33_TRCCIDR2_PRMBL_2_ACCESS "RO"
// =============================================================================
// Register    : M33_TRCCIDR3
// Description : TRCCIDR3
#define M33_TRCCIDR3_OFFSET _u(0x00041ffc)
#define M33_TRCCIDR3_BITS   _u(0x000000ff)
#define M33_TRCCIDR3_RESET  _u(0x000000b1)
// -----------------------------------------------------------------------------
// Field       : M33_TRCCIDR3_PRMBL_3
// Description : reads as 0b10110001
#define M33_TRCCIDR3_PRMBL_3_RESET  _u(0xb1)
#define M33_TRCCIDR3_PRMBL_3_BITS   _u(0x000000ff)
#define M33_TRCCIDR3_PRMBL_3_MSB    _u(7)
#define M33_TRCCIDR3_PRMBL_3_LSB    _u(0)
#define M33_TRCCIDR3_PRMBL_3_ACCESS "RO"
// =============================================================================
// Register    : M33_CTICONTROL
// Description : CTI Control Register
#define M33_CTICONTROL_OFFSET _u(0x00042000)
#define M33_CTICONTROL_BITS   _u(0x00000001)
#define M33_CTICONTROL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTICONTROL_GLBEN
// Description : Enables or disables the CTI
#define M33_CTICONTROL_GLBEN_RESET  _u(0x0)
#define M33_CTICONTROL_GLBEN_BITS   _u(0x00000001)
#define M33_CTICONTROL_GLBEN_MSB    _u(0)
#define M33_CTICONTROL_GLBEN_LSB    _u(0)
#define M33_CTICONTROL_GLBEN_ACCESS "RW"
// =============================================================================
// Register    : M33_CTIINTACK
// Description : CTI Interrupt Acknowledge Register
#define M33_CTIINTACK_OFFSET _u(0x00042010)
#define M33_CTIINTACK_BITS   _u(0x000000ff)
#define M33_CTIINTACK_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTIINTACK_INTACK
// Description : Acknowledges the corresponding ctitrigout output. There is one
//               bit of the register for each ctitrigout output. When a 1 is
//               written to a bit in this register, the corresponding ctitrigout
//               is acknowledged, causing it to be cleared.
#define M33_CTIINTACK_INTACK_RESET  _u(0x00)
#define M33_CTIINTACK_INTACK_BITS   _u(0x000000ff)
#define M33_CTIINTACK_INTACK_MSB    _u(7)
#define M33_CTIINTACK_INTACK_LSB    _u(0)
#define M33_CTIINTACK_INTACK_ACCESS "RW"
// =============================================================================
// Register    : M33_CTIAPPSET
// Description : CTI Application Trigger Set Register
#define M33_CTIAPPSET_OFFSET _u(0x00042014)
#define M33_CTIAPPSET_BITS   _u(0x0000000f)
#define M33_CTIAPPSET_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTIAPPSET_APPSET
// Description : Setting a bit HIGH generates a channel event for the selected
//               channel. There is one bit of the register for each channel
#define M33_CTIAPPSET_APPSET_RESET  _u(0x0)
#define M33_CTIAPPSET_APPSET_BITS   _u(0x0000000f)
#define M33_CTIAPPSET_APPSET_MSB    _u(3)
#define M33_CTIAPPSET_APPSET_LSB    _u(0)
#define M33_CTIAPPSET_APPSET_ACCESS "RW"
// =============================================================================
// Register    : M33_CTIAPPCLEAR
// Description : CTI Application Trigger Clear Register
#define M33_CTIAPPCLEAR_OFFSET _u(0x00042018)
#define M33_CTIAPPCLEAR_BITS   _u(0x0000000f)
#define M33_CTIAPPCLEAR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTIAPPCLEAR_APPCLEAR
// Description : Sets the corresponding bits in the CTIAPPSET to 0. There is one
//               bit of the register for each channel.
#define M33_CTIAPPCLEAR_APPCLEAR_RESET  _u(0x0)
#define M33_CTIAPPCLEAR_APPCLEAR_BITS   _u(0x0000000f)
#define M33_CTIAPPCLEAR_APPCLEAR_MSB    _u(3)
#define M33_CTIAPPCLEAR_APPCLEAR_LSB    _u(0)
#define M33_CTIAPPCLEAR_APPCLEAR_ACCESS "RW"
// =============================================================================
// Register    : M33_CTIAPPPULSE
// Description : CTI Application Pulse Register
#define M33_CTIAPPPULSE_OFFSET _u(0x0004201c)
#define M33_CTIAPPPULSE_BITS   _u(0x0000000f)
#define M33_CTIAPPPULSE_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTIAPPPULSE_APPULSE
// Description : Setting a bit HIGH generates a channel event pulse for the
//               selected channel. There is one bit of the register for each
//               channel.
#define M33_CTIAPPPULSE_APPULSE_RESET  _u(0x0)
#define M33_CTIAPPPULSE_APPULSE_BITS   _u(0x0000000f)
#define M33_CTIAPPPULSE_APPULSE_MSB    _u(3)
#define M33_CTIAPPPULSE_APPULSE_LSB    _u(0)
#define M33_CTIAPPPULSE_APPULSE_ACCESS "RW"
// =============================================================================
// Register    : M33_CTIINEN0
// Description : CTI Trigger to Channel Enable Registers
#define M33_CTIINEN0_OFFSET _u(0x00042020)
#define M33_CTIINEN0_BITS   _u(0x0000000f)
#define M33_CTIINEN0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTIINEN0_TRIGINEN
// Description : Enables a cross trigger event to the corresponding channel when
//               a ctitrigin input is activated. There is one bit of the field
//               for each of the four channels
#define M33_CTIINEN0_TRIGINEN_RESET  _u(0x0)
#define M33_CTIINEN0_TRIGINEN_BITS   _u(0x0000000f)
#define M33_CTIINEN0_TRIGINEN_MSB    _u(3)
#define M33_CTIINEN0_TRIGINEN_LSB    _u(0)
#define M33_CTIINEN0_TRIGINEN_ACCESS "RW"
// =============================================================================
// Register    : M33_CTIINEN1
// Description : CTI Trigger to Channel Enable Registers
#define M33_CTIINEN1_OFFSET _u(0x00042024)
#define M33_CTIINEN1_BITS   _u(0x0000000f)
#define M33_CTIINEN1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTIINEN1_TRIGINEN
// Description : Enables a cross trigger event to the corresponding channel when
//               a ctitrigin input is activated. There is one bit of the field
//               for each of the four channels
#define M33_CTIINEN1_TRIGINEN_RESET  _u(0x0)
#define M33_CTIINEN1_TRIGINEN_BITS   _u(0x0000000f)
#define M33_CTIINEN1_TRIGINEN_MSB    _u(3)
#define M33_CTIINEN1_TRIGINEN_LSB    _u(0)
#define M33_CTIINEN1_TRIGINEN_ACCESS "RW"
// =============================================================================
// Register    : M33_CTIINEN2
// Description : CTI Trigger to Channel Enable Registers
#define M33_CTIINEN2_OFFSET _u(0x00042028)
#define M33_CTIINEN2_BITS   _u(0x0000000f)
#define M33_CTIINEN2_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTIINEN2_TRIGINEN
// Description : Enables a cross trigger event to the corresponding channel when
//               a ctitrigin input is activated. There is one bit of the field
//               for each of the four channels
#define M33_CTIINEN2_TRIGINEN_RESET  _u(0x0)
#define M33_CTIINEN2_TRIGINEN_BITS   _u(0x0000000f)
#define M33_CTIINEN2_TRIGINEN_MSB    _u(3)
#define M33_CTIINEN2_TRIGINEN_LSB    _u(0)
#define M33_CTIINEN2_TRIGINEN_ACCESS "RW"
// =============================================================================
// Register    : M33_CTIINEN3
// Description : CTI Trigger to Channel Enable Registers
#define M33_CTIINEN3_OFFSET _u(0x0004202c)
#define M33_CTIINEN3_BITS   _u(0x0000000f)
#define M33_CTIINEN3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTIINEN3_TRIGINEN
// Description : Enables a cross trigger event to the corresponding channel when
//               a ctitrigin input is activated. There is one bit of the field
//               for each of the four channels
#define M33_CTIINEN3_TRIGINEN_RESET  _u(0x0)
#define M33_CTIINEN3_TRIGINEN_BITS   _u(0x0000000f)
#define M33_CTIINEN3_TRIGINEN_MSB    _u(3)
#define M33_CTIINEN3_TRIGINEN_LSB    _u(0)
#define M33_CTIINEN3_TRIGINEN_ACCESS "RW"
// =============================================================================
// Register    : M33_CTIINEN4
// Description : CTI Trigger to Channel Enable Registers
#define M33_CTIINEN4_OFFSET _u(0x00042030)
#define M33_CTIINEN4_BITS   _u(0x0000000f)
#define M33_CTIINEN4_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTIINEN4_TRIGINEN
// Description : Enables a cross trigger event to the corresponding channel when
//               a ctitrigin input is activated. There is one bit of the field
//               for each of the four channels
#define M33_CTIINEN4_TRIGINEN_RESET  _u(0x0)
#define M33_CTIINEN4_TRIGINEN_BITS   _u(0x0000000f)
#define M33_CTIINEN4_TRIGINEN_MSB    _u(3)
#define M33_CTIINEN4_TRIGINEN_LSB    _u(0)
#define M33_CTIINEN4_TRIGINEN_ACCESS "RW"
// =============================================================================
// Register    : M33_CTIINEN5
// Description : CTI Trigger to Channel Enable Registers
#define M33_CTIINEN5_OFFSET _u(0x00042034)
#define M33_CTIINEN5_BITS   _u(0x0000000f)
#define M33_CTIINEN5_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTIINEN5_TRIGINEN
// Description : Enables a cross trigger event to the corresponding channel when
//               a ctitrigin input is activated. There is one bit of the field
//               for each of the four channels
#define M33_CTIINEN5_TRIGINEN_RESET  _u(0x0)
#define M33_CTIINEN5_TRIGINEN_BITS   _u(0x0000000f)
#define M33_CTIINEN5_TRIGINEN_MSB    _u(3)
#define M33_CTIINEN5_TRIGINEN_LSB    _u(0)
#define M33_CTIINEN5_TRIGINEN_ACCESS "RW"
// =============================================================================
// Register    : M33_CTIINEN6
// Description : CTI Trigger to Channel Enable Registers
#define M33_CTIINEN6_OFFSET _u(0x00042038)
#define M33_CTIINEN6_BITS   _u(0x0000000f)
#define M33_CTIINEN6_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTIINEN6_TRIGINEN
// Description : Enables a cross trigger event to the corresponding channel when
//               a ctitrigin input is activated. There is one bit of the field
//               for each of the four channels
#define M33_CTIINEN6_TRIGINEN_RESET  _u(0x0)
#define M33_CTIINEN6_TRIGINEN_BITS   _u(0x0000000f)
#define M33_CTIINEN6_TRIGINEN_MSB    _u(3)
#define M33_CTIINEN6_TRIGINEN_LSB    _u(0)
#define M33_CTIINEN6_TRIGINEN_ACCESS "RW"
// =============================================================================
// Register    : M33_CTIINEN7
// Description : CTI Trigger to Channel Enable Registers
#define M33_CTIINEN7_OFFSET _u(0x0004203c)
#define M33_CTIINEN7_BITS   _u(0x0000000f)
#define M33_CTIINEN7_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTIINEN7_TRIGINEN
// Description : Enables a cross trigger event to the corresponding channel when
//               a ctitrigin input is activated. There is one bit of the field
//               for each of the four channels
#define M33_CTIINEN7_TRIGINEN_RESET  _u(0x0)
#define M33_CTIINEN7_TRIGINEN_BITS   _u(0x0000000f)
#define M33_CTIINEN7_TRIGINEN_MSB    _u(3)
#define M33_CTIINEN7_TRIGINEN_LSB    _u(0)
#define M33_CTIINEN7_TRIGINEN_ACCESS "RW"
// =============================================================================
// Register    : M33_CTIOUTEN0
// Description : CTI Trigger to Channel Enable Registers
#define M33_CTIOUTEN0_OFFSET _u(0x000420a0)
#define M33_CTIOUTEN0_BITS   _u(0x0000000f)
#define M33_CTIOUTEN0_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTIOUTEN0_TRIGOUTEN
// Description : Enables a cross trigger event to ctitrigout when the
//               corresponding channel is activated. There is one bit of the
//               field for each of the four channels.
#define M33_CTIOUTEN0_TRIGOUTEN_RESET  _u(0x0)
#define M33_CTIOUTEN0_TRIGOUTEN_BITS   _u(0x0000000f)
#define M33_CTIOUTEN0_TRIGOUTEN_MSB    _u(3)
#define M33_CTIOUTEN0_TRIGOUTEN_LSB    _u(0)
#define M33_CTIOUTEN0_TRIGOUTEN_ACCESS "RW"
// =============================================================================
// Register    : M33_CTIOUTEN1
// Description : CTI Trigger to Channel Enable Registers
#define M33_CTIOUTEN1_OFFSET _u(0x000420a4)
#define M33_CTIOUTEN1_BITS   _u(0x0000000f)
#define M33_CTIOUTEN1_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTIOUTEN1_TRIGOUTEN
// Description : Enables a cross trigger event to ctitrigout when the
//               corresponding channel is activated. There is one bit of the
//               field for each of the four channels.
#define M33_CTIOUTEN1_TRIGOUTEN_RESET  _u(0x0)
#define M33_CTIOUTEN1_TRIGOUTEN_BITS   _u(0x0000000f)
#define M33_CTIOUTEN1_TRIGOUTEN_MSB    _u(3)
#define M33_CTIOUTEN1_TRIGOUTEN_LSB    _u(0)
#define M33_CTIOUTEN1_TRIGOUTEN_ACCESS "RW"
// =============================================================================
// Register    : M33_CTIOUTEN2
// Description : CTI Trigger to Channel Enable Registers
#define M33_CTIOUTEN2_OFFSET _u(0x000420a8)
#define M33_CTIOUTEN2_BITS   _u(0x0000000f)
#define M33_CTIOUTEN2_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTIOUTEN2_TRIGOUTEN
// Description : Enables a cross trigger event to ctitrigout when the
//               corresponding channel is activated. There is one bit of the
//               field for each of the four channels.
#define M33_CTIOUTEN2_TRIGOUTEN_RESET  _u(0x0)
#define M33_CTIOUTEN2_TRIGOUTEN_BITS   _u(0x0000000f)
#define M33_CTIOUTEN2_TRIGOUTEN_MSB    _u(3)
#define M33_CTIOUTEN2_TRIGOUTEN_LSB    _u(0)
#define M33_CTIOUTEN2_TRIGOUTEN_ACCESS "RW"
// =============================================================================
// Register    : M33_CTIOUTEN3
// Description : CTI Trigger to Channel Enable Registers
#define M33_CTIOUTEN3_OFFSET _u(0x000420ac)
#define M33_CTIOUTEN3_BITS   _u(0x0000000f)
#define M33_CTIOUTEN3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTIOUTEN3_TRIGOUTEN
// Description : Enables a cross trigger event to ctitrigout when the
//               corresponding channel is activated. There is one bit of the
//               field for each of the four channels.
#define M33_CTIOUTEN3_TRIGOUTEN_RESET  _u(0x0)
#define M33_CTIOUTEN3_TRIGOUTEN_BITS   _u(0x0000000f)
#define M33_CTIOUTEN3_TRIGOUTEN_MSB    _u(3)
#define M33_CTIOUTEN3_TRIGOUTEN_LSB    _u(0)
#define M33_CTIOUTEN3_TRIGOUTEN_ACCESS "RW"
// =============================================================================
// Register    : M33_CTIOUTEN4
// Description : CTI Trigger to Channel Enable Registers
#define M33_CTIOUTEN4_OFFSET _u(0x000420b0)
#define M33_CTIOUTEN4_BITS   _u(0x0000000f)
#define M33_CTIOUTEN4_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTIOUTEN4_TRIGOUTEN
// Description : Enables a cross trigger event to ctitrigout when the
//               corresponding channel is activated. There is one bit of the
//               field for each of the four channels.
#define M33_CTIOUTEN4_TRIGOUTEN_RESET  _u(0x0)
#define M33_CTIOUTEN4_TRIGOUTEN_BITS   _u(0x0000000f)
#define M33_CTIOUTEN4_TRIGOUTEN_MSB    _u(3)
#define M33_CTIOUTEN4_TRIGOUTEN_LSB    _u(0)
#define M33_CTIOUTEN4_TRIGOUTEN_ACCESS "RW"
// =============================================================================
// Register    : M33_CTIOUTEN5
// Description : CTI Trigger to Channel Enable Registers
#define M33_CTIOUTEN5_OFFSET _u(0x000420b4)
#define M33_CTIOUTEN5_BITS   _u(0x0000000f)
