Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/m33.h
#define M33_CTIOUTEN5_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTIOUTEN5_TRIGOUTEN
// Description : Enables a cross trigger event to ctitrigout when the
//               corresponding channel is activated. There is one bit of the
//               field for each of the four channels.
#define M33_CTIOUTEN5_TRIGOUTEN_RESET  _u(0x0)
#define M33_CTIOUTEN5_TRIGOUTEN_BITS   _u(0x0000000f)
#define M33_CTIOUTEN5_TRIGOUTEN_MSB    _u(3)
#define M33_CTIOUTEN5_TRIGOUTEN_LSB    _u(0)
#define M33_CTIOUTEN5_TRIGOUTEN_ACCESS "RW"
// =============================================================================
// Register    : M33_CTIOUTEN6
// Description : CTI Trigger to Channel Enable Registers
#define M33_CTIOUTEN6_OFFSET _u(0x000420b8)
#define M33_CTIOUTEN6_BITS   _u(0x0000000f)
#define M33_CTIOUTEN6_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTIOUTEN6_TRIGOUTEN
// Description : Enables a cross trigger event to ctitrigout when the
//               corresponding channel is activated. There is one bit of the
//               field for each of the four channels.
#define M33_CTIOUTEN6_TRIGOUTEN_RESET  _u(0x0)
#define M33_CTIOUTEN6_TRIGOUTEN_BITS   _u(0x0000000f)
#define M33_CTIOUTEN6_TRIGOUTEN_MSB    _u(3)
#define M33_CTIOUTEN6_TRIGOUTEN_LSB    _u(0)
#define M33_CTIOUTEN6_TRIGOUTEN_ACCESS "RW"
// =============================================================================
// Register    : M33_CTIOUTEN7
// Description : CTI Trigger to Channel Enable Registers
#define M33_CTIOUTEN7_OFFSET _u(0x000420bc)
#define M33_CTIOUTEN7_BITS   _u(0x0000000f)
#define M33_CTIOUTEN7_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTIOUTEN7_TRIGOUTEN
// Description : Enables a cross trigger event to ctitrigout when the
//               corresponding channel is activated. There is one bit of the
//               field for each of the four channels.
#define M33_CTIOUTEN7_TRIGOUTEN_RESET  _u(0x0)
#define M33_CTIOUTEN7_TRIGOUTEN_BITS   _u(0x0000000f)
#define M33_CTIOUTEN7_TRIGOUTEN_MSB    _u(3)
#define M33_CTIOUTEN7_TRIGOUTEN_LSB    _u(0)
#define M33_CTIOUTEN7_TRIGOUTEN_ACCESS "RW"
// =============================================================================
// Register    : M33_CTITRIGINSTATUS
// Description : CTI Trigger to Channel Enable Registers
#define M33_CTITRIGINSTATUS_OFFSET _u(0x00042130)
#define M33_CTITRIGINSTATUS_BITS   _u(0x000000ff)
#define M33_CTITRIGINSTATUS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTITRIGINSTATUS_TRIGINSTATUS
// Description : Shows the status of the ctitrigin inputs. There is one bit of
//               the field for each trigger input.Because the register provides
//               a view of the raw ctitrigin inputs, the reset value is UNKNOWN.
#define M33_CTITRIGINSTATUS_TRIGINSTATUS_RESET  _u(0x00)
#define M33_CTITRIGINSTATUS_TRIGINSTATUS_BITS   _u(0x000000ff)
#define M33_CTITRIGINSTATUS_TRIGINSTATUS_MSB    _u(7)
#define M33_CTITRIGINSTATUS_TRIGINSTATUS_LSB    _u(0)
#define M33_CTITRIGINSTATUS_TRIGINSTATUS_ACCESS "RO"
// =============================================================================
// Register    : M33_CTITRIGOUTSTATUS
// Description : CTI Trigger In Status Register
#define M33_CTITRIGOUTSTATUS_OFFSET _u(0x00042134)
#define M33_CTITRIGOUTSTATUS_BITS   _u(0x000000ff)
#define M33_CTITRIGOUTSTATUS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTITRIGOUTSTATUS_TRIGOUTSTATUS
// Description : Shows the status of the ctitrigout outputs. There is one bit of
//               the field for each trigger output.
#define M33_CTITRIGOUTSTATUS_TRIGOUTSTATUS_RESET  _u(0x00)
#define M33_CTITRIGOUTSTATUS_TRIGOUTSTATUS_BITS   _u(0x000000ff)
#define M33_CTITRIGOUTSTATUS_TRIGOUTSTATUS_MSB    _u(7)
#define M33_CTITRIGOUTSTATUS_TRIGOUTSTATUS_LSB    _u(0)
#define M33_CTITRIGOUTSTATUS_TRIGOUTSTATUS_ACCESS "RO"
// =============================================================================
// Register    : M33_CTICHINSTATUS
// Description : CTI Channel In Status Register
#define M33_CTICHINSTATUS_OFFSET _u(0x00042138)
#define M33_CTICHINSTATUS_BITS   _u(0x0000000f)
#define M33_CTICHINSTATUS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_CTICHINSTATUS_CTICHOUTSTATUS
// Description : Shows the status of the ctichout outputs. There is one bit of
//               the field for each channel output
#define M33_CTICHINSTATUS_CTICHOUTSTATUS_RESET  _u(0x0)
#define M33_CTICHINSTATUS_CTICHOUTSTATUS_BITS   _u(0x0000000f)
#define M33_CTICHINSTATUS_CTICHOUTSTATUS_MSB    _u(3)
#define M33_CTICHINSTATUS_CTICHOUTSTATUS_LSB    _u(0)
#define M33_CTICHINSTATUS_CTICHOUTSTATUS_ACCESS "RO"
// =============================================================================
// Register    : M33_CTIGATE
// Description : Enable CTI Channel Gate register
#define M33_CTIGATE_OFFSET _u(0x00042140)
#define M33_CTIGATE_BITS   _u(0x0000000f)
#define M33_CTIGATE_RESET  _u(0x0000000f)
// -----------------------------------------------------------------------------
// Field       : M33_CTIGATE_CTIGATEEN3
// Description : Enable ctichout3. Set to 0 to disable channel propagation.
#define M33_CTIGATE_CTIGATEEN3_RESET  _u(0x1)
#define M33_CTIGATE_CTIGATEEN3_BITS   _u(0x00000008)
#define M33_CTIGATE_CTIGATEEN3_MSB    _u(3)
#define M33_CTIGATE_CTIGATEEN3_LSB    _u(3)
#define M33_CTIGATE_CTIGATEEN3_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CTIGATE_CTIGATEEN2
// Description : Enable ctichout2. Set to 0 to disable channel propagation.
#define M33_CTIGATE_CTIGATEEN2_RESET  _u(0x1)
#define M33_CTIGATE_CTIGATEEN2_BITS   _u(0x00000004)
#define M33_CTIGATE_CTIGATEEN2_MSB    _u(2)
#define M33_CTIGATE_CTIGATEEN2_LSB    _u(2)
#define M33_CTIGATE_CTIGATEEN2_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CTIGATE_CTIGATEEN1
// Description : Enable ctichout1. Set to 0 to disable channel propagation.
#define M33_CTIGATE_CTIGATEEN1_RESET  _u(0x1)
#define M33_CTIGATE_CTIGATEEN1_BITS   _u(0x00000002)
#define M33_CTIGATE_CTIGATEEN1_MSB    _u(1)
#define M33_CTIGATE_CTIGATEEN1_LSB    _u(1)
#define M33_CTIGATE_CTIGATEEN1_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : M33_CTIGATE_CTIGATEEN0
// Description : Enable ctichout0. Set to 0 to disable channel propagation.
#define M33_CTIGATE_CTIGATEEN0_RESET  _u(0x1)
#define M33_CTIGATE_CTIGATEEN0_BITS   _u(0x00000001)
#define M33_CTIGATE_CTIGATEEN0_MSB    _u(0)
#define M33_CTIGATE_CTIGATEEN0_LSB    _u(0)
#define M33_CTIGATE_CTIGATEEN0_ACCESS "RW"
// =============================================================================
// Register    : M33_ASICCTL
// Description : External Multiplexer Control register
#define M33_ASICCTL_OFFSET _u(0x00042144)
#define M33_ASICCTL_BITS   _u(0x00000000)
#define M33_ASICCTL_RESET  _u(0x00000000)
#define M33_ASICCTL_MSB    _u(31)
#define M33_ASICCTL_LSB    _u(0)
#define M33_ASICCTL_ACCESS "RW"
// =============================================================================
// Register    : M33_ITCHOUT
// Description : Integration Test Channel Output register
#define M33_ITCHOUT_OFFSET _u(0x00042ee4)
#define M33_ITCHOUT_BITS   _u(0x0000000f)
#define M33_ITCHOUT_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITCHOUT_CTCHOUT
// Description : Sets the value of the ctichout outputs
#define M33_ITCHOUT_CTCHOUT_RESET  _u(0x0)
#define M33_ITCHOUT_CTCHOUT_BITS   _u(0x0000000f)
#define M33_ITCHOUT_CTCHOUT_MSB    _u(3)
#define M33_ITCHOUT_CTCHOUT_LSB    _u(0)
#define M33_ITCHOUT_CTCHOUT_ACCESS "RW"
// =============================================================================
// Register    : M33_ITTRIGOUT
// Description : Integration Test Trigger Output register
#define M33_ITTRIGOUT_OFFSET _u(0x00042ee8)
#define M33_ITTRIGOUT_BITS   _u(0x000000ff)
#define M33_ITTRIGOUT_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITTRIGOUT_CTTRIGOUT
// Description : Sets the value of the ctitrigout outputs
#define M33_ITTRIGOUT_CTTRIGOUT_RESET  _u(0x00)
#define M33_ITTRIGOUT_CTTRIGOUT_BITS   _u(0x000000ff)
#define M33_ITTRIGOUT_CTTRIGOUT_MSB    _u(7)
#define M33_ITTRIGOUT_CTTRIGOUT_LSB    _u(0)
#define M33_ITTRIGOUT_CTTRIGOUT_ACCESS "RW"
// =============================================================================
// Register    : M33_ITCHIN
// Description : Integration Test Channel Input register
#define M33_ITCHIN_OFFSET _u(0x00042ef4)
#define M33_ITCHIN_BITS   _u(0x0000000f)
#define M33_ITCHIN_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITCHIN_CTCHIN
// Description : Reads the value of the ctichin inputs.
#define M33_ITCHIN_CTCHIN_RESET  _u(0x0)
#define M33_ITCHIN_CTCHIN_BITS   _u(0x0000000f)
#define M33_ITCHIN_CTCHIN_MSB    _u(3)
#define M33_ITCHIN_CTCHIN_LSB    _u(0)
#define M33_ITCHIN_CTCHIN_ACCESS "RO"
// =============================================================================
// Register    : M33_ITCTRL
// Description : Integration Mode Control register
#define M33_ITCTRL_OFFSET _u(0x00042f00)
#define M33_ITCTRL_BITS   _u(0x00000001)
#define M33_ITCTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_ITCTRL_IME
// Description : Integration Mode Enable
#define M33_ITCTRL_IME_RESET  _u(0x0)
#define M33_ITCTRL_IME_BITS   _u(0x00000001)
#define M33_ITCTRL_IME_MSB    _u(0)
#define M33_ITCTRL_IME_LSB    _u(0)
#define M33_ITCTRL_IME_ACCESS "RW"
// =============================================================================
// Register    : M33_DEVARCH
// Description : Device Architecture register
#define M33_DEVARCH_OFFSET _u(0x00042fbc)
#define M33_DEVARCH_BITS   _u(0xffffffff)
#define M33_DEVARCH_RESET  _u(0x47701a14)
// -----------------------------------------------------------------------------
// Field       : M33_DEVARCH_ARCHITECT
// Description : Indicates the component architect
#define M33_DEVARCH_ARCHITECT_RESET  _u(0x23b)
#define M33_DEVARCH_ARCHITECT_BITS   _u(0xffe00000)
#define M33_DEVARCH_ARCHITECT_MSB    _u(31)
#define M33_DEVARCH_ARCHITECT_LSB    _u(21)
#define M33_DEVARCH_ARCHITECT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DEVARCH_PRESENT
// Description : Indicates whether the DEVARCH register is present
#define M33_DEVARCH_PRESENT_RESET  _u(0x1)
#define M33_DEVARCH_PRESENT_BITS   _u(0x00100000)
#define M33_DEVARCH_PRESENT_MSB    _u(20)
#define M33_DEVARCH_PRESENT_LSB    _u(20)
#define M33_DEVARCH_PRESENT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DEVARCH_REVISION
// Description : Indicates the architecture revision
#define M33_DEVARCH_REVISION_RESET  _u(0x0)
#define M33_DEVARCH_REVISION_BITS   _u(0x000f0000)
#define M33_DEVARCH_REVISION_MSB    _u(19)
#define M33_DEVARCH_REVISION_LSB    _u(16)
#define M33_DEVARCH_REVISION_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DEVARCH_ARCHID
// Description : Indicates the component
#define M33_DEVARCH_ARCHID_RESET  _u(0x1a14)
#define M33_DEVARCH_ARCHID_BITS   _u(0x0000ffff)
#define M33_DEVARCH_ARCHID_MSB    _u(15)
#define M33_DEVARCH_ARCHID_LSB    _u(0)
#define M33_DEVARCH_ARCHID_ACCESS "RO"
// =============================================================================
// Register    : M33_DEVID
// Description : Device Configuration register
#define M33_DEVID_OFFSET _u(0x00042fc8)
#define M33_DEVID_BITS   _u(0x000fff1f)
#define M33_DEVID_RESET  _u(0x00040800)
// -----------------------------------------------------------------------------
// Field       : M33_DEVID_NUMCH
// Description : Number of ECT channels available
#define M33_DEVID_NUMCH_RESET  _u(0x4)
#define M33_DEVID_NUMCH_BITS   _u(0x000f0000)
#define M33_DEVID_NUMCH_MSB    _u(19)
#define M33_DEVID_NUMCH_LSB    _u(16)
#define M33_DEVID_NUMCH_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DEVID_NUMTRIG
// Description : Number of ECT triggers available.
#define M33_DEVID_NUMTRIG_RESET  _u(0x08)
#define M33_DEVID_NUMTRIG_BITS   _u(0x0000ff00)
#define M33_DEVID_NUMTRIG_MSB    _u(15)
#define M33_DEVID_NUMTRIG_LSB    _u(8)
#define M33_DEVID_NUMTRIG_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DEVID_EXTMUXNUM
// Description : Indicates the number of multiplexers available on Trigger
//               Inputs and Trigger Outputs that are using asicctl. The default
//               value of 0b00000 indicates that no multiplexing is present.
//               This value of this bit depends on the Verilog define EXTMUXNUM
//               that you must change accordingly.
#define M33_DEVID_EXTMUXNUM_RESET  _u(0x00)
#define M33_DEVID_EXTMUXNUM_BITS   _u(0x0000001f)
#define M33_DEVID_EXTMUXNUM_MSB    _u(4)
#define M33_DEVID_EXTMUXNUM_LSB    _u(0)
#define M33_DEVID_EXTMUXNUM_ACCESS "RO"
// =============================================================================
// Register    : M33_DEVTYPE
// Description : Device Type Identifier register
#define M33_DEVTYPE_OFFSET _u(0x00042fcc)
#define M33_DEVTYPE_BITS   _u(0x000000ff)
#define M33_DEVTYPE_RESET  _u(0x00000014)
// -----------------------------------------------------------------------------
// Field       : M33_DEVTYPE_SUB
// Description : Sub-classification of the type of the debug component as
//               specified in the ARM Architecture Specification within the
//               major classification as specified in the MAJOR field.
#define M33_DEVTYPE_SUB_RESET  _u(0x1)
#define M33_DEVTYPE_SUB_BITS   _u(0x000000f0)
#define M33_DEVTYPE_SUB_MSB    _u(7)
#define M33_DEVTYPE_SUB_LSB    _u(4)
#define M33_DEVTYPE_SUB_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_DEVTYPE_MAJOR
// Description : Major classification of the type of the debug component as
//               specified in the ARM Architecture Specification for this debug
//               and trace component.
#define M33_DEVTYPE_MAJOR_RESET  _u(0x4)
#define M33_DEVTYPE_MAJOR_BITS   _u(0x0000000f)
#define M33_DEVTYPE_MAJOR_MSB    _u(3)
#define M33_DEVTYPE_MAJOR_LSB    _u(0)
#define M33_DEVTYPE_MAJOR_ACCESS "RO"
// =============================================================================
// Register    : M33_PIDR4
// Description : CoreSight Peripheral ID4
#define M33_PIDR4_OFFSET _u(0x00042fd0)
#define M33_PIDR4_BITS   _u(0x000000ff)
#define M33_PIDR4_RESET  _u(0x00000004)
// -----------------------------------------------------------------------------
// Field       : M33_PIDR4_SIZE
// Description : Always 0b0000. Indicates that the device only occupies 4KB of
//               memory
#define M33_PIDR4_SIZE_RESET  _u(0x0)
#define M33_PIDR4_SIZE_BITS   _u(0x000000f0)
#define M33_PIDR4_SIZE_MSB    _u(7)
#define M33_PIDR4_SIZE_LSB    _u(4)
#define M33_PIDR4_SIZE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_PIDR4_DES_2
// Description : Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify
//               the designer of the component.
#define M33_PIDR4_DES_2_RESET  _u(0x4)
#define M33_PIDR4_DES_2_BITS   _u(0x0000000f)
#define M33_PIDR4_DES_2_MSB    _u(3)
#define M33_PIDR4_DES_2_LSB    _u(0)
#define M33_PIDR4_DES_2_ACCESS "RO"
// =============================================================================
// Register    : M33_PIDR5
// Description : CoreSight Peripheral ID5
#define M33_PIDR5_OFFSET _u(0x00042fd4)
#define M33_PIDR5_BITS   _u(0x00000000)
#define M33_PIDR5_RESET  _u(0x00000000)
#define M33_PIDR5_MSB    _u(31)
#define M33_PIDR5_LSB    _u(0)
#define M33_PIDR5_ACCESS "RW"
// =============================================================================
// Register    : M33_PIDR6
// Description : CoreSight Peripheral ID6
#define M33_PIDR6_OFFSET _u(0x00042fd8)
#define M33_PIDR6_BITS   _u(0x00000000)
#define M33_PIDR6_RESET  _u(0x00000000)
#define M33_PIDR6_MSB    _u(31)
#define M33_PIDR6_LSB    _u(0)
#define M33_PIDR6_ACCESS "RW"
// =============================================================================
// Register    : M33_PIDR7
// Description : CoreSight Peripheral ID7
#define M33_PIDR7_OFFSET _u(0x00042fdc)
#define M33_PIDR7_BITS   _u(0x00000000)
#define M33_PIDR7_RESET  _u(0x00000000)
#define M33_PIDR7_MSB    _u(31)
#define M33_PIDR7_LSB    _u(0)
#define M33_PIDR7_ACCESS "RW"
// =============================================================================
// Register    : M33_PIDR0
// Description : CoreSight Peripheral ID0
#define M33_PIDR0_OFFSET _u(0x00042fe0)
#define M33_PIDR0_BITS   _u(0x000000ff)
#define M33_PIDR0_RESET  _u(0x00000021)
// -----------------------------------------------------------------------------
// Field       : M33_PIDR0_PART_0
// Description : Bits[7:0] of the 12-bit part number of the component. The
//               designer of the component assigns this part number.
#define M33_PIDR0_PART_0_RESET  _u(0x21)
#define M33_PIDR0_PART_0_BITS   _u(0x000000ff)
#define M33_PIDR0_PART_0_MSB    _u(7)
#define M33_PIDR0_PART_0_LSB    _u(0)
#define M33_PIDR0_PART_0_ACCESS "RO"
// =============================================================================
// Register    : M33_PIDR1
// Description : CoreSight Peripheral ID1
#define M33_PIDR1_OFFSET _u(0x00042fe4)
#define M33_PIDR1_BITS   _u(0x000000ff)
#define M33_PIDR1_RESET  _u(0x000000bd)
// -----------------------------------------------------------------------------
// Field       : M33_PIDR1_DES_0
// Description : Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify
//               the designer of the component.
#define M33_PIDR1_DES_0_RESET  _u(0xb)
#define M33_PIDR1_DES_0_BITS   _u(0x000000f0)
#define M33_PIDR1_DES_0_MSB    _u(7)
#define M33_PIDR1_DES_0_LSB    _u(4)
#define M33_PIDR1_DES_0_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_PIDR1_PART_1
// Description : Bits[11:8] of the 12-bit part number of the component. The
//               designer of the component assigns this part number.
#define M33_PIDR1_PART_1_RESET  _u(0xd)
#define M33_PIDR1_PART_1_BITS   _u(0x0000000f)
#define M33_PIDR1_PART_1_MSB    _u(3)
#define M33_PIDR1_PART_1_LSB    _u(0)
#define M33_PIDR1_PART_1_ACCESS "RO"
// =============================================================================
// Register    : M33_PIDR2
// Description : CoreSight Peripheral ID2
#define M33_PIDR2_OFFSET _u(0x00042fe8)
#define M33_PIDR2_BITS   _u(0x000000ff)
#define M33_PIDR2_RESET  _u(0x0000000b)
// -----------------------------------------------------------------------------
// Field       : M33_PIDR2_REVISION
// Description : This device is at r1p0
#define M33_PIDR2_REVISION_RESET  _u(0x0)
#define M33_PIDR2_REVISION_BITS   _u(0x000000f0)
#define M33_PIDR2_REVISION_MSB    _u(7)
#define M33_PIDR2_REVISION_LSB    _u(4)
#define M33_PIDR2_REVISION_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_PIDR2_JEDEC
// Description : Always 1. Indicates that the JEDEC-assigned designer ID is
//               used.
#define M33_PIDR2_JEDEC_RESET  _u(0x1)
#define M33_PIDR2_JEDEC_BITS   _u(0x00000008)
#define M33_PIDR2_JEDEC_MSB    _u(3)
#define M33_PIDR2_JEDEC_LSB    _u(3)
#define M33_PIDR2_JEDEC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_PIDR2_DES_1
// Description : Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify
//               the designer of the component.
#define M33_PIDR2_DES_1_RESET  _u(0x3)
#define M33_PIDR2_DES_1_BITS   _u(0x00000007)
#define M33_PIDR2_DES_1_MSB    _u(2)
#define M33_PIDR2_DES_1_LSB    _u(0)
#define M33_PIDR2_DES_1_ACCESS "RO"
// =============================================================================
// Register    : M33_PIDR3
// Description : CoreSight Peripheral ID3
#define M33_PIDR3_OFFSET _u(0x00042fec)
#define M33_PIDR3_BITS   _u(0x000000ff)
#define M33_PIDR3_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : M33_PIDR3_REVAND
// Description : Indicates minor errata fixes specific to the revision of the
//               component being used, for example metal fixes after
//               implementation. In most cases, this field is 0b0000. ARM
//               recommends that the component designers ensure that a metal fix
//               can change this field if required, for example, by driving it
//               from registers that reset to 0b0000.
#define M33_PIDR3_REVAND_RESET  _u(0x0)
#define M33_PIDR3_REVAND_BITS   _u(0x000000f0)
#define M33_PIDR3_REVAND_MSB    _u(7)
#define M33_PIDR3_REVAND_LSB    _u(4)
#define M33_PIDR3_REVAND_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_PIDR3_CMOD
// Description : Customer Modified. Indicates whether the customer has modified
//               the behavior of the component. In most cases, this field is
//               0b0000. Customers change this value when they make authorized
//               modifications to this component.
#define M33_PIDR3_CMOD_RESET  _u(0x0)
#define M33_PIDR3_CMOD_BITS   _u(0x0000000f)
#define M33_PIDR3_CMOD_MSB    _u(3)
#define M33_PIDR3_CMOD_LSB    _u(0)
#define M33_PIDR3_CMOD_ACCESS "RO"
// =============================================================================
// Register    : M33_CIDR0
// Description : CoreSight Component ID0
#define M33_CIDR0_OFFSET _u(0x00042ff0)
#define M33_CIDR0_BITS   _u(0x000000ff)
#define M33_CIDR0_RESET  _u(0x0000000d)
// -----------------------------------------------------------------------------
// Field       : M33_CIDR0_PRMBL_0
// Description : Preamble[0]. Contains bits[7:0] of the component identification
//               code
#define M33_CIDR0_PRMBL_0_RESET  _u(0x0d)
#define M33_CIDR0_PRMBL_0_BITS   _u(0x000000ff)
#define M33_CIDR0_PRMBL_0_MSB    _u(7)
#define M33_CIDR0_PRMBL_0_LSB    _u(0)
#define M33_CIDR0_PRMBL_0_ACCESS "RO"
// =============================================================================
// Register    : M33_CIDR1
// Description : CoreSight Component ID1
#define M33_CIDR1_OFFSET _u(0x00042ff4)
#define M33_CIDR1_BITS   _u(0x000000ff)
#define M33_CIDR1_RESET  _u(0x00000090)
// -----------------------------------------------------------------------------
// Field       : M33_CIDR1_CLASS
// Description : Class of the component, for example, whether the component is a
//               ROM table or a generic CoreSight component. Contains
//               bits[15:12] of the component identification code.
#define M33_CIDR1_CLASS_RESET  _u(0x9)
#define M33_CIDR1_CLASS_BITS   _u(0x000000f0)
#define M33_CIDR1_CLASS_MSB    _u(7)
#define M33_CIDR1_CLASS_LSB    _u(4)
#define M33_CIDR1_CLASS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : M33_CIDR1_PRMBL_1
// Description : Preamble[1]. Contains bits[11:8] of the component
//               identification code.
#define M33_CIDR1_PRMBL_1_RESET  _u(0x0)
#define M33_CIDR1_PRMBL_1_BITS   _u(0x0000000f)
