Klipper3d/klipper/lib/pico-sdk/rp2350/hardware/regs/m33.h
#define M33_CIDR1_PRMBL_1_MSB    _u(3)
#define M33_CIDR1_PRMBL_1_LSB    _u(0)
#define M33_CIDR1_PRMBL_1_ACCESS "RO"
// =============================================================================
// Register    : M33_CIDR2
// Description : CoreSight Component ID2
#define M33_CIDR2_OFFSET _u(0x00042ff8)
#define M33_CIDR2_BITS   _u(0x000000ff)
#define M33_CIDR2_RESET  _u(0x00000005)
// -----------------------------------------------------------------------------
// Field       : M33_CIDR2_PRMBL_2
// Description : Preamble[2]. Contains bits[23:16] of the component
//               identification code.
#define M33_CIDR2_PRMBL_2_RESET  _u(0x05)
#define M33_CIDR2_PRMBL_2_BITS   _u(0x000000ff)
#define M33_CIDR2_PRMBL_2_MSB    _u(7)
#define M33_CIDR2_PRMBL_2_LSB    _u(0)
#define M33_CIDR2_PRMBL_2_ACCESS "RO"
// =============================================================================
// Register    : M33_CIDR3
// Description : CoreSight Component ID3
#define M33_CIDR3_OFFSET _u(0x00042ffc)
#define M33_CIDR3_BITS   _u(0x000000ff)
#define M33_CIDR3_RESET  _u(0x000000b1)
// -----------------------------------------------------------------------------
// Field       : M33_CIDR3_PRMBL_3
// Description : Preamble[3]. Contains bits[31:24] of the component
//               identification code.
#define M33_CIDR3_PRMBL_3_RESET  _u(0xb1)
#define M33_CIDR3_PRMBL_3_BITS   _u(0x000000ff)
#define M33_CIDR3_PRMBL_3_MSB    _u(7)
#define M33_CIDR3_PRMBL_3_LSB    _u(0)
#define M33_CIDR3_PRMBL_3_ACCESS "RO"
// =============================================================================
#endif // _HARDWARE_REGS_M33_H

